{"Reviews": [{"Title": "Best Ultra book for Value", "Author": "BudLife \"Prab\"", "ReviewID": "R1YVIQFJZ5BXED", "Overall": "5.0", "Content": "Better than expected. I thought Acer doesnt make a good quality product but this thing looks amazing. This is the best Ultrabook in Market for the price range. Its pretty fast for surfing web and occasional Microsoft office works. It feels sturdy and has a good battery life. Its very comfortable to carry .", "Date": "February 21, 2012"}, {"Title": "Central American ultra", "Author": "Lost in Amazon", "ReviewID": "R1URENPNYRON9Y", "Overall": "4.0", "Content": "The S3 I purchased is awesome. I bought it for a business trip in Central America and I'm loving it. The fast awake time is the reason I got it. Runs a little warm, but what doesn't.", "Date": "July 8, 2012"}, {"Title": "Great Computer!!", "Author": "Benjamin Schwab", "ReviewID": "R2SXMFTYSUCBGU", "Overall": "5.0", "Content": "Very light weight and easy to use. Has all functions a larger laptop would have but in a thin package. Long battery life, very quick processor, and sleek.", "Date": "April 3, 2012"}, {"Title": "Closest to MacBook Air You'll Get", "Author": "B. Patout", "ReviewID": "R24PWGAEYLWBYL", "Overall": "3.0", "Content": "Great little PC but the biggest hangup I have is the hinge for the screen.  When you move it, it shakes a tad until it settles out.  definitely a design flaw.", "Date": "November 28, 2012"}, {"Title": "Light but Powerful", "Author": "Ayoola Babatunde Oke", "ReviewID": "R27IU3AO3FYFHU", "Overall": "5.0", "Content": "Great price and value, ultra thin and really light with good width of screen, therefore easy to carry around and boots up pretty fast", "Date": "October 7, 2012"}, {"Title": "very good", "Author": "ligi", "ReviewID": "R37PUSML5XG7UB", "Overall": "5.0", "Content": "so happy for this slim  and light laptop. i am not an expert in computers ,but for home use is just fine! very pleased with this product.", "Date": "May 4, 2012"}, {"Title": "Awsome product for the price", "Author": "Electroic", "ReviewID": "R10LIEM91MNIA9", "Overall": "4.0", "Content": "It is an excellent laptop. However I wished it had more USB ports. Comparing it with Asus Zenbook, this laptop is $200 cheaper and more rigid.", "Date": "December 25, 2011"}, {"Title": "Great Labtop for low price", "Author": "Peter Shin", "ReviewID": "R26DOUGXTKQ6FQ", "Overall": "5.0", "Content": "I am an acupuncturist and needed a labtop that is small, light, but also very productive.If you are a gamer or software expert who demand high quality and productive labtop? I do not think this is going to be a home-run labtop. However this is very useful when it comes to clinic or work type of place need which its pro is  so valuable! Light, Right size, and very good price!!only $500.If you are going to use internet, MS Office, or checking e-mails? This is right lab-top for you!!I am loving it!!!", "Date": "July 3, 2012"}, {"Title": "Wait-- S5 due out June 2012 (and won CES best)", "Author": "Randall", "ReviewID": "RB89CDZPEDW40", "Overall": "3.0", "Content": "There are issues with the S3, but the S5 is due out any day now, June/July 2012, and the CES won best product at the January 2012 CES (Consumer Electronics Show). I am checking almost daily for the S5 which I sorely want, so much better in so many ways.", "Date": "June 27, 2012"}, {"Title": "Touchpad is Horrible", "Author": "Alex", "ReviewID": "RIPJDU9Q953I9", "Overall": "1.0", "Content": "This laptop has the worst touch-pad ever, only 2 hours battery and bad speakers. I bought the laptop then returned it a week later.", "Date": "February 16, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00677HRBU"}}