{"Reviews": [{"Title": "What a computer", "Author": "Reacher's Girl \"cochisecc\"", "ReviewID": "R1VP2YJEHCND15", "Overall": "5.0", "Content": "Wow! I have been searching for a while - and finally found the one I love!! lol - I am not a computer person, so I kind of guess and hope i guess right (after a lot of online research) - so far, so good!! This is my second HP - my 5 year old was starting to slow a bit (but mainly I had the 'new' bug) and I wanted the larger screen. I have had a week now and probably do not know half of what this computer has to offer yet, but what I've seen is pretty great! I keep hearing a lot of complaining about the beats music, but its great to me. The fingerprint recognition is so awesome! As we always do have a complaint, mine is the keyboard. I'm getting used to it, but as it has the number pad, the keyboard 'home' keys are off center. I have not been doing much, other than FB, mail and shop, but its lightening fast! I look foward to finding out what else she'll do! As I kick the tires I'll try to update. (I did not know about the coolsense until i bought. It senses when its on your lap versus on a table and cools itself accordingly, so as not to burn your lap.) All in all, right now, this is THE computer! Love it!! Love it!! Love it!!", "Date": "November 24, 2011"}, {"Title": "Bought November 14, 2011 - Problem May 18, 2012", "Author": "F. Fairfield", "ReviewID": "R2SLDUVEIFAU24", "Overall": "3.0", "Content": "So, barely six months after I bought it, it malfunctioned: I got rows of dots, namely:- Playing chess in Fritz-11, in \"friend\" mode, the computer showed a row of dots where it should have shown my handicap;- In WordPerfect, I could read a file, but as soon as soon as I put the cursor where I wanted to write something, the file would start to disappear one letter at a time, right to left, starting where the cursor was; I closed the file without \"saving the changes\" and my file remained intact, but I could not work with it;- I could go to the Amazon site, but was unable to write the name of the product I was looking for;- I could access my mailbox, but not write an e-mail.Whenever I tried to write something, I would get a row of dots; if I managed to type one letter, that letter would quickly move away and disappear, showing that the row of dots was not stationary, but continuously moving.I called the HP service center around 8:15 pm on Friday, May 18; the technician tried a lot of things, including a restore to May 9th, but basically we were going in circles, the same blue screen coming back again and again.  At one time the screen indicated: \"this operation can take up to 20 seconds\"; the screen showed a line of rectangles that turned yellow one at a time, from left to right, and back to the beginning of the row.  Twenty minutes later, it had not stopped yet, so the technician tried something else, that did not work either.  His conclusion was that the Alt key was sticking (he did not specify which of the two Alt keys, and I did not think of asking).  He said that I needed a new keyboard that would be sent to me free of charge since the computer was still under warranty; he made arrangements to have a technician install it on Friday, May 25th, in the afternoon, and charged my Visa card $49 plus Michigan sales tax.I was not convinced though, because none of the two Alt keys seemed to be sticking.  I tried again to solve the problem from the blue screen, and I finally managed to make everything work after doing a simple thing: switching from the \"Canadian\" to the \"US\" keyboard in the language bar.  I do not understand why it worked, and I am not even sure that this is really what did it.  All I can say is that I am now able to do all the things that I could not do \"before\".  I can even use either keyboard layout, without any problem.  Obviously, the problem was with the software, not with the computer itself.Of course, I immediately canceled the order for a new keyboard and the appointment to have it installed.  I was told that my VISA card would be credited within 2-3 days.I am happy with this computer, but I would not recommend it for two reasons:1. The obvious incompetence of the HP support technician (by the way, they are located in the Ozarks);2. The fact that HP did not provide the Windows disk that the blue screen said shoud be inserted to solve the problem.  That disk would have saved me 4 hours spent talking to their technician, and another hour or so waiting while another support technician (in India this time) obtained his supervisor's authorization to credit my Visa card. (My previous computer was a Dell, and it came with all the disks required to reinstall any program that needed reinstalling.)Note for HP, if they are reading this:  the ticket number was 8059362347; the order number KMK821. You have my name and address. Please send me the Windows-7 disk that I will need next time something malfunctions.  I tried contacting you and got lost on your website.Monday, June 4th, 2012:  If you have read this review, please also read the comments (from HP and my answers.)", "Date": "May 20, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00666VUQA"}}
