{"Reviews": [{"Title": "Product delivers", "Author": "th3_shiv", "ReviewID": "R26AQONZN21K5F", "Overall": "5.0", "Content": "As there are few reviews for this product I was a little wary, but I'm very satisfied with my first laptop. As a university student getting into upper division courses, the ability to take projects with me became a necessity, and since I recently built a powerful gaming computer, I needed something that I would *want* to travel with. After removing a bit of ASUS bloatware that comes with it, it runs pretty smooth. Some of the bloatware is actually nice like the power profiles switcher. All in all it runs faster than I expected with a low-power processor and 5400 rpm hard drive.First week review:Battery life is legitimately 7+ hours in battery save mode (which you can tweak).24 hours in Sleep Mode only cost the battery ~7% charge, and Instant On works as advertised.Computer is capable of light gaming in performance mode (it runs Dungeon Defenders on low settings).Hard drive is divided into two even partitions, OS and Data.Usable RAM is 3.6 GB as 400 MB seems to be dedicated to video memory, which is good.8-cell Battery keeps laptop slightly lifted, which helps keep it cool, but adds a little size.It is slim and light enough to compete with an ultrabook at half the price.Hinge construction feels more solid than it looks. Overall the entire machine feels sturdy.No optical drive. Helps keep it light and isn't an issue for tech-savvy users, but could be an issue for some.Yes, there is some keyboard flex, but I have to pay attention to notice it. It would be nice if the keys were backlit, but since the screen gives off light, that isn't really important. The keyboard feels like the cheapest component, but there are zero problems actually using it.Something to note is the USB ports are an extremely tight fit. It shaved some plastic off of my flash drive getting it into the ports the first couple of times. I've muscled in a couple other USB devices, but it doesn't seem to damage anything.", "Date": "April 29, 2012"}, {"Title": "poor man's ultrabook", "Author": "RJMacReady \"RJMacReady\"", "ReviewID": "R31EUCQ0ZS3WAM", "Overall": "5.0", "Content": "It's not easy to find a computer this slim and light without buying an ultrabook.  This is half the price of even a low end ultrabook, so of course there are some compromises.  It's not quite as sleek, the processor isn't that powerful, though it's good enough for most HD video and light gaming.  The keyboard has a little flex to it as well.  It's biggest flaw is the screen, which isn't that vivid and has poor viewing angles.  That's to be expected at this price though.  The battery life is very good, about 5-6 hours even with the brightness on high and the wireless on.  I didn't want to spend ultrabook money on a laptop, so I was glad to find this.", "Date": "April 18, 2012"}, {"Title": "Clean, slim, handsome, but...", "Author": "J. Warren \"NiALTA\"", "ReviewID": "R3O9I08UP756RN", "Overall": "2.0", "Content": "I really wanted to like this product it has many good features, but sadly, the system has 3* VERY bad points and 3 not so bad points.Here's the bad;*1. The viewing angle of the screen is horrible.10 degrees from dead-on at most.YIKES!*2. The Wi-Fi has no problem finding signals, it just won't stay connected to any of them.*3. Hard Drive is very slow.o4. Decals on keys, not laser etched.o5. Bluetooth is very picky and tempermentalo6. Multi-Finger gestures on the track-pad do not work as advertised.Here's the good;o1. Attractive aluminum and ABS-Plastic construction.o2. Keys operate smooth as silk (despite the decals).o3. Processor is quite efficient once all the crapware is uninstalled.o4. Plays back video gloriouslyo5. Two USB 3.o Ports!o6. Can run three monitors at once. Wow!o7. Plays semi-recent games at medium settingso8. Sound is low but very clear.o9. Thin Sleek ProfileIf the 3 of the 6 bad points had not been so serious, I would strongly consider keeping this laptop, but the viewing angle is so poor that I strongly recommend that people look else where. AND that's a shame, b/c ASUS went to the trouble to design and build a fine computer out of decent materials, but then shot themselves in the foot by coupling the system to such a low grade glossy screen with dismal viewing angles.This is a good effort, but ultimately a poor execution on ASUS's part. After working with this laptop for a couple of days- The defective Wi-Fi, agressively low quality screen, and an annoying trackpad issue make this laptop a dud. Had to send it back.", "Date": "July 16, 2012"}, {"Title": "My New Ubuntu Machine", "Author": "freak", "ReviewID": "R6XEAXLM0VRCN", "Overall": "5.0", "Content": "So, the first thing I did when I got my new ASUS U32U-ES21 was format the drive and install ubuntu on it.  So far, it's been fantastic!!  I've been a little too busy to play around with the integrated video card yet (and I know Radeon GPUs aren't supposed to work all that well with Linux in general), but it at least plays videos, flash, and streaming videos all seemlessly.  The only downfall of this computer so far is that REALTEK still doesn't have a Linux Kernal 3.0+ driver for it's multi-card reader, but everything else seems to work.  Viewing angles are crap, but I'm used to that and the screen is twice as bright as my last laptop, so I'm not complaining.  What I really love about this laptop is the battery life.  I can work on it continuously for about 6 hours before it dies.  That's truly incredible.", "Date": "April 11, 2012"}, {"Title": "Giant step up from eeepc, pretty nice laptop!", "Author": "Steve in Japan \"Islander\"", "ReviewID": "R3UBOS96NCOETX", "Overall": "4.0", "Content": "I've been waiting to replace my trusty eeepc 1005HA for a while now, and while looking for another ASUS netbook with a 12 inch screen, all of a sudden Amazon offers this a 13-inch model for very little more than I paid for the 10-inch netbook almost 4 years ago. To be honest, I was expecting to be disappointed because the 1005HA has been so dependable and functional. But the U32U-ES21 is such an enormous improvement that it is really in a class by itself. I am still getting used to it and especially to Windows 7, but here are my first impressions:- the screen angle issue is real, and obvious when compared to the excellent (matte!) LCD screen in the eeepc, but not a huge problem. Maximum brightness is about the same. The view angle might have to do with the U32U screen being LED-backlit, which probably saves battery drain. The much higher resolution and of course the extra \"real estate\" more than makes up for this, and blacks are richer too.- It's a joy to have the additional keyboard size and especially a more conventional layout of the right side keys. The keys are a bit on the stiff side but I am making far fewer typing mistakes. (The eeepc also had some repeated key problems that I am happy to find absent now). My eeepc had a black-on-white keyboard, which is easier to see in dim light than the new one, but that's only an issue for hunt-and-peck typists in darkened bedrooms, like me.- Fan is much, much quieter and the unit runs cooler than the eeepc!- Windows7 is a great advance over the familiar and reliable but now clunky XP. The 4GB standard RAM seems to handle it fine.- I've had no wi-fi problems at all so far, although I get different strength indications with the 2 laptops side by side.- I have not put them on scales yet, but it is about the same weight as the eeepc with an oversize battery.- Video playback is perfect at full screen, but I have not tried and HD yet.- The Caps Lock and Num Lock lights are very welcome features, avoiding errors and/or the need to install an on-screen program.One star down from perfect because of the stiff keyboard and screen issues, and the truly TERRIBLE Asus website, but really quite an amazing value.  Yes, I have to add that I have never even succeeded in registering my computer, getting access to their cloud storage, or even finding a list of models, on their website. I can only hope that I'll never need any type of real assistance. (Their webpage for driver downloads can't even recognize the model computer - I had to get drivers from other sites!  Boooo ASUS)Six weeks later:  I'm noticing how flexy the keyboard is, but it doesn't matter to me. More worrying is that I had to reinstall the keypad driver a couple of times before I got the 2-finger scrolling feature to work right, and also the default settings have to be changed for it to work right. (Forget about the \"Scrybe\" junk). And if you switch between a mouse and the trackpad you will find a little program called Change Mouse Speed very useful.To compensate for a slowish AMD CPU I installed another 4 Gb of RAM ($25), and disabled most of the Win7 screen animations. Now I am more than satisfied with the snappy performance, including HD videos (I'm not a gamer). I have rigged all my peripherals into a sort of quick docking station when I am not on the road - mouse, backlit keyboard, big monitor, backup HD. I have some issues with how Win7 handles its \"Libraries\", and can't for the life of me understand why ASUS makes the \"OS\" drive partition (C:) the default for data rather than the \"Data\" partition \"D\".Maybe that is why the Mac Airbook is so popular - it's not a do-it-yourself project like ASUS always seems to be.Now if Amazon would only quit changing the price every week it will be a great little laptop for about $400.", "Date": "July 27, 2012"}, {"Title": "Ultra Portable", "Author": "Gloriana", "ReviewID": "R16KXM1C6JOELW", "Overall": "4.0", "Content": "Pros:Battery life is amazing! 6 hours of full use and charges up again in less than an hour.Full size Keyboard.Good size mousetrack, comfortable position and features apple-like touch controls, zoom in and out, two finger up and down that's great!Very thin body and light weight (except battery)Screen size is great for work and small enough to be portable.Great low price!Cons:Aluminum color is NOT like the picture. Is way darker.Battery is not flat, has a elevated part that helps ventilation, but make the back of the laptop bulky.Mouse click sound is very loud (I'm that picky)Sound comes very low but can be fixed, now it loud enough.This is a beautiful, thin, ultra portable laptop. Great value for the money!", "Date": "May 9, 2012"}, {"Title": "ASUS Ultra Portable is terrific!", "Author": "Tech.Geek.Engineer", "ReviewID": "R15GPMV6K7CA9A", "Overall": "5.0", "Content": "The Asus Ultra Portable is a steal of a deal.  This little perfomer blows my mind.  Now granted I don't do any gaming, but for internet surfing, emails, spread sheets and all the other stuff I typically do this is just a terrific bargain.  I love how quickly it boots up!  The screen is bright crisp and flawless. I love that it's NOT loaded up with starter software that harrasses you to death to buy the real thing (like Dell's and HP's are, that starter software is such a tease and virtually no help). The Asus is configured exceptionally well, plenty of USB access points, WiFi is great, card readers built in and the battery life is very good with an easy 6 hours!  This is just a terrific bargain (I paid approx. $445 May 2012)!!!  I shopped Best Buy, Fryes and Office Depot, Amazon had the best deal and fast delivery, no sales tax.  LOVE this ASUS U32U-ES21 and can't imagine that there is anything else out there that comes close for the price I paid!", "Date": "July 13, 2012"}, {"Title": "Great Value!!", "Author": "CollegeStudent", "ReviewID": "R2VPRWWUZX0XI5", "Overall": "5.0", "Content": "This laptop does everything as advertised, and well. It is like another reviewer noted a poor mans ultrabook. The battery life is about 6 hours for me on high performance, max brightness, wifi.. (everything that can drain the battery essentially..) mode. which is remarkable. There is no optical drive but that isnt much of an issue since i almost never do use CD's and a usb optical is not hard to find. The touchpad click buttons are rather noisy, and if you really look for it there is minimal keyboard flex, but for the price little things like that are expected. overall it performs extremely well and i am very pleased with this laptop..", "Date": "June 14, 2012"}, {"Title": "Very Nice Laptop", "Author": "Barky", "ReviewID": "R9WDLB69TU80", "Overall": "5.0", "Content": "Quite impressed with this machine.Asus was kind enough to supply a (1) 4 gig memory chip that made it outstanding for an extra 4 gig of RAM upgrade. Hats off to Asus for the open slot.My battery meter at full charge indicates 8hr-4min of battery use. Screen brightness is at about 50% but very viewable.Early reports indicated poor screen angles. Although not fantastic, its a lot better than expected, totally acceptable. Also, it was reported keyboard flex at top may not suit you. Keyboard is fine and not as reported.Can't believe how thin the screen is. Beautiful display.I really like the Computer and Asus has done a top notch job on the design.", "Date": "April 30, 2012"}, {"Title": "An excellent value for an all purpose portable laptop", "Author": "Timothy Day", "ReviewID": "R3QVCWV5JWU4LE", "Overall": "5.0", "Content": "I found the U32U while looking for the UL30A, an older Asus \"ultra-portable\" that we've had excellent luck with. The U32U is an improvement on an already excellent product. Nice packaging, great design, 8 - 10 hour battery life, and thin profile make this an excellent choice for web browsing and general computing on the go. I'll be installing Photoshop and Premier Elements and expect to have them function well with the light duty photo and video editing tasks I do.Very easy to setup, though I did remove some of the installed ASUS apps like their media manager and sound enhancer. I've got no problem with the stock speakers and the screen has better viewing angles than I had expected. The fan blows slightly in high performance mode, and the bottom does get warm, but this is no noisy lap-burner. The always on USB port for charging is a nice upscale addition, as is the included bluetooth and multi-touch trackpad gestures.All is all this is a great deal on an almost-ultrabook sized lower powered laptop.", "Date": "June 1, 2012"}, {"Title": "Good looking, light, but too slow", "Author": "Pouledad", "ReviewID": "RGBWQK5D7RHOJ", "Overall": "3.0", "Content": "This is a very good looking, light, thin computer with a good amount of RAM (4 gigs) and a big harddrive (320 Gigs.)I'm glad it's got Windows 7 and not 8. It also costs short money: $400, roughly.There are two massive negatives with it: the hard drive is grindingly slow when you open the screen and it churns and churns for close to five minutes before everything's booted up and you can use it. Also, the processor is so slow you can barely stream video.", "Date": "April 8, 2013"}, {"Title": "Great computer", "Author": "Lee Geiger", "ReviewID": "RDY8E8MB6CV38", "Overall": "5.0", "Content": "I never had any complaints about my win XP computers, I thought they were great, but then this Asus U32U-ES21 laptop came around, & I think its better. I was warned about limited angle view, I don't see that, I was hoping that it might provide me some privacy in the house, But I can see the screen at any angle. It does reflect some light, like a mirror. It has a very sharp clear picture, almost as crisp as a cell phone screen, but much bigger, 13.3 inches. I had little experience with win 7, But I am retired & wanted a new toy. I spent the first 12 hours updating, I clicked on win explorer, so I could download Firefox, then I got my favorite old XP disks, of old programs, they don't load on Win 7, I loaded Rough Draft, from a memory chip, most companies use it as a bait to get you to download their junk. & I downloaded Word Web, it's the computer dictionary that works with anything, if you are reading & you get to a word that you don't understand, leave the curser on the word, & hit Ctrl  Alt  W  & your dictionary will pop up explaining your word. I also downloaded Microsoft Security Essentials.  Then when restarting, Microsoft downloaded  111 updates for 5 hours. At least its up to date now. I love my Microsoft works, but my stuff is out dated, so I downloaded open office, I am happy with the word processor & spreadsheet,.but it gives you it all. They tag on some bloat ware, but I uninstalled what gives me trouble. I don't want any adware.  The computer is amazing, light & thin, I don't know how people thought the battery was big, they haven't seen my eepc 1000 HA with double size battery replacement. But at the time I bought it, It was the best laptop out there, with long life.  I haven't reduced any bloat ware, but eventually I will research the live stuff, to see what I don't need. I also downloaded a KJV bible from freepcbible,com at least it works as a download, so I don't have to be connected to the internet all the time.  I noticed that I have almost an instant clock & calendar, just click on the time at the bottom right of the screen.  I also like sleep mode on this computer, the windows XP one, never worked too good. This one turns on quickly, even when rebooting. Its also very portable. I can pick it up Go anywhere in range of the wifi, & continue my work.  I bought it used from Amazon, Its like new, for $300 It seems to stay sold out, but I got mine in time. The keyboard seems sturdy enough & easy to type on, some people complain about it flexing, but I don't pound the keys & haven't noticed that condition. My son paid a lot more for one bigger & faster, But I like mine better.  I haven't tried to get longer life from the batteries, It tells me i have six & one half hours of battery life after charging, which only takes one hour to charge, so I'm good to go. The plastic finish looks like aluminum, but I'm glad that it is plastic, I don't want a cold clammy computer with metal chilling me. The mouse pad is much better than my other computers, so I am not complaining. It has 4 gig ram, & 4 gig  more could be added, its running 1.65 ghz, it seems to be fast enough, it performs well, there is 320 gig hard drive, more than I will ever use.. I always like older programs because they computed easier, but this works just fine, & better that anything I had before.  I had this laptop a week now, & really like it. It had no recovery disk, but I have a little portable usb dvd drive. I did a boot repair disk, on a dvd blank, which copied 160 megs of programing, to my understanding, this should work as a recovery disk. Then I did a backup, it took about an hour, to copy 3.6 gigs of information,it copied user, owner files & programs & copied nearly everything related desktop files & programs. I really don't know if this is all that I need, but it is everything  that the control pannel, back up & restore told me that would be necessary.  I know that my e-machine desktop tower came with a recovery disk, I love it, my computer was abused by anyone who wanted to play on it. It has gone through recovery 9 times, 4 dvd drives, six keyboards, upgraded with more memory & about 5 mouses already, Now my laptops are mine, & I keep them just for me.  When I downloaded open office, I received some ad ware, its a way of getting you something free, & yet getting paid by the ad ware people, but be careful & check control panel in (programs & features). Always remember & check often the files, so when a new file is added, you will know what to get rid of before it causes you trouble. My virus program alerted me.  This computer is good for any writer who needs to occasionally comment on an unfinished document, You can leave the page up, close the lid, & it will go to sleep, using 5% of battery power per day while resting, then you can open the lid, & within seconds, the page that you left, will be waiting there where you left it.  This is a real computer having the benefits of most tablets, But I like the mouse pad instead of on screen mouse functions. Those functions are ok for little tablets, but I still like that this works like a real computer.  I discovered problems with using sleep too often, you do need to shut it down occasionally, to clear the memory build up. I still love this Asus computer with win 7, But the trend is running to where google chrome will eventually take over, so if I ever need another computer, I will probably go the google chrome computer next. Its a step up from the tablets & people highly favor them, they are very internet oriented, but there are enough downloads from goggle that probably will work, to function for your offline needs. For now, this Asus Win 7 computer has all the benefits & more, So for now this is the best computer that I ever had the pleasure to play on, I've had it for six months & no complaints so far. During the day, i allow it to be in sleep, just open the cover, in 3 seconds it's up, 4 more sends it's on the internet, so I check mail, write little documents, & then close the lid. But every day or two, it is a good idea to shut it down to keep the memory clear.", "Date": "February 9, 2013"}, {"Title": "Good laptop", "Author": "jessica", "ReviewID": "R29HE5WY9P5BHY", "Overall": "4.0", "Content": "This laptop is perfect for school related things. That is what i needed it for and along with my specific internet connection, the internet is quick and the laptop delivers. What i dont recommend it for is viewing youtube videos or downloading lots of things. Any HD video takes a while to load, and forget watching anything in 1080px....it will always lag. Downloading isnt as quick as i would like. Eventually, the laptop will slow down a little as i store a good amount of pictures and music BUT for the price i got it for, i dont regret purchasing it at all!I recommend this product!", "Date": "February 2, 2013"}, {"Title": "SLOW", "Author": "shnnntam", "ReviewID": "R17D2MRY5NW18T", "Overall": "2.0", "Content": "I bought this laptop back in June and it looked great. Out of the box it was a bit slow, thinking it was due to all the preloaded junk new computers come with, but after I uninstalled some, the computer still wasnt as fast as I thought it would be, considering the specs. Alright, that's ok. Four months later though, I feel like this computer's speed sucks major. To put this into perspective, I don't even have many files on this laptop (everything is on my google drive or google play, so no documents or music files) or any major program (I dont even own microsoft word, sadly), I don't use photoshop or play computer games, I just use this laptop to casually surf the web and use google documents to write my school work. Casually, I can barely go on tumblr because the pages just never load, those gifs or whatever constantly lag and freeze, Youtube is a joke because NOTHING loads, facebook takes forever, and overall.. I am disappointed. Maybe I got a defective laptop shipped to me or something but... this sucks :(", "Date": "October 17, 2012"}, {"Title": "Not what I was looking for", "Author": "honestyisthebestpolicy", "ReviewID": "RBLYS6MDD8QZU", "Overall": "2.0", "Content": "The laptop just wasn't what I expected.  I opened 3 web browsers (gmail, pandora, and amazon) and the pandora music immediately started acting up.  I was hoping for a laptop to use at school but I won't be able to multitask like I'm used to.  The look of the laptop is really nice and sleek and it's super light weight, but the performance was not up to par so I returned it. Unlike some other reviews, the viewing angle wasn't a problem nor was there any bending in my keyboard.  I did notice the left click button was rather load and could be irritating after long use but it wasn't a huge problem.  I think if you know how to upgrade the components of the laptop then it'd be pretty good.  Also be aware the trackpad might have complications.  I've never had issues with other trackpads, but for some reason it wasn't picking up my fingers.  My boyfriend tried it and it worked fine with his so it may have been that I have much smaller fingers than his, but just something to consider and check out.", "Date": "October 17, 2012"}, {"Title": "Good in it's self", "Author": "Mercedes C. Humphreys", "ReviewID": "R2NO04EH2HSTQ7", "Overall": "4.0", "Content": "ASUS customer support is horrendous, have a problem? \"re install windows\". Their drivers often check for operating system version and OEM status, quite a few would not install when I upgraded to Windows Ultimate. More importantly, I updated the BIOS and BROKE SUPPORT FOR SLEEP. Now the computer stays awake and spins the fans loudly every time I try to sleep it, no matter what OS I use.Windows 8 works quite well. Most things work except two finger scrolling, the SD card slot, Hot keys and bluetooth.Ubuntu 12.04 has really bad support for the graphics card, particularly with dual monitors. It made me switch out and run it on a VM.", "Date": "September 25, 2012"}, {"Title": "Good value for the money", "Author": "Steve-O", "ReviewID": "R2I1REYYY0XPO8", "Overall": "4.0", "Content": "I needed a new laptop for a few basic things: internet browsing, email, video calls, and movie/live sports streaming.  I was looking for something under $500, relatively light and small, decent battery life, and an hdmi out to use with a home cinema/projector.  Most things that fit the description were $800-1500 'ultrabooks.'I kept coming across this Asus on Amazon.  I wasn't crazy about the processor speed but otherwise it seemed to fit the bill.  I went ahead and ordered it along with an extra 4GB memory and a 128GB Samsung SSD, about $20 over my target of $500 all-in.It is a light and thin laptop that feels somewhat cheap (as it is plastic - duh) but not like it is going to fall apart.  Keyboard is decent but takes some adjustment (enter key is not all they way to the right, etc).  Touchpad is very good but given the way I use it I will look into a bluetooth mouse soon.  Does 'click' very loudly but I usually use the touchpad for going to links.I used the computer with the factory hardware and settings for about a week and it was fine for browsing and some multitasking with a few apps open and a google hangout during a fantasy football draft.  This was day 1, without removing any bloatware or optimizing any settings.  It did about 6 hours of non-stop use without having to plug in...much better than what I was expecting.I have since installed the extra memory (but not the ssd) for a total of 8GB and cleaned it out a bit.  It has also taken over it's duty as my weekly NFL streamer (I live overseas and its the only way to catch football).  It is hooked up through an av receiver/projector and streams all the games flawlessly in HD (connection-speed permitting) while I use the laptop to surf at the same time.  Very minor occasional lag (1-2 second delay) in response time while browsing but nothing that is a deal breaker.  Picture and sound are as good watching Netflix/Amazon VOD as it is via Playstation 3 or Xbox.All in all, for the money, I am not sure how you could beat it.  No, it is not aluminum, and no, it does not feel like some of the laptops that cost 2-4 x's as much.  The processor could be more robust, but then it would not cost what it does.  For my needs it was the perfect compromise of performance and price, and I will edit the review once I get the SSD in to see how it impacts my experience.", "Date": "September 17, 2012"}, {"Title": "ASUS AMD 13.5 \" laptop", "Author": "Amazon Customer", "ReviewID": "ROSMUFTSLJR2M", "Overall": "4.0", "Content": "Serves its purpose of Surfing the web and handling email.  Good bargain but with a great deal of ad-ware and malware to eliminated.  needed to download Ccleaner to eliminate the unneeded programs.  Fast enough for its limited functions  at a very good price.Avoid using ASUS help.  It's clerks try to sell expensive unneeded programs.", "Date": "July 14, 2012"}, {"Title": "Pretty good", "Author": "JJ", "ReviewID": "R2OOQ6ZO7H6W83", "Overall": "4.0", "Content": "It is really small, light and quiet, nice for student to use for taking notes in class, I like it!", "Date": "July 8, 2012"}, {"Title": "Seems really good so far", "Author": "Florida Gal \"PBG2065\"", "ReviewID": "R1GIYG901AR90K", "Overall": "5.0", "Content": "I see that Amazon has temporarily removed this item for sale as it's reviewing some reported issues re: description, inventory, or other reasons that are not spelled out.  I won't write much about the technical features of this laptop (RAM, hard drive, ports, etc.) as they are all there in the specs and I'm not super-sophisticated about technical issues. I am also new to Windows 7 as my previous laptops have been XP so I'm learning about Win 7 now.  Perhaps a bit late as Win 8 is coming soon, but there are some significant improvements over XP.  What I can say is that this laptop is really lovely in design and it feels great to use. I don't find there is any flex in the keyboard and I like the chicklet design, feel and layout of the keys as well as the touchpad design and usability. Some other newer laptops have touchpads that don't separate the right and left clicking keys from the rest of the touchpad.  You sort of have to guess where the clicking part of the pad actually is.  This one does have clear separations on the touchpad and it makes it easier to use without looking at it.  I also appreciate the rapid ON feature of this laptop (or Win 7?) as I'm sick of waiting for my older laptops to boot and wake up.  I think the price is very good considering the features that are included (especially the long battery life) and it came quickly and well-packaged on Amazon Prime. It was very easy and quick to set up and get going.  The speakers that come installed are surprisingly good as my YouTube tests have revealed.  I have had an Asus netbook for several months now and I also like that one very much, so that's why I took a chance on ordering this larger laptop.  So far, after only one day, I like it very much and those looking for this sort of laptop should get on the wait list for when it become available again.  I also think it's time for me to put in a plug for Amazon Prime.  For those of you who use Amazon often, as I do, this is a wonderful deal.  So many items are available using Prime and they come reliably in 2 days with no shipping fee.  You also get privileges by being a Prime member such as free streaming of some movies and videos.  I know this is not much related to the Asus laptop I'm writing about, but after more than a year of having Amazon prime, I just wanted to comment on it.  It's a great value as my children and husband also get the same features and privileges at no extra cost as a result of my membership, so I just felt like writing about it!", "Date": "May 31, 2012"}, {"Title": "Great battery!", "Author": "JohnnyReb", "ReviewID": "R16SBXR9UYSVIE", "Overall": "4.0", "Content": "Well, after not being able to afford a mac book, i found this.  It was really  cheap for being so slim and its features. Although I had to  download the instant on software from Asus's website,  its a really good deal. The CPU isnt as strong as top laptop's, but for the price its great.", "Date": "January 14, 2013"}, {"Title": "not too bad", "Author": "uk@NY", "ReviewID": "R1GQKV6BVILI8B", "Overall": "3.0", "Content": "Item arrived fast and looking at the size of packing i was very happy.Everything started well but day by day i feel this getting slower in response.Size is good but not very sleek.Performance is not good, i have my old dual core Vaio that works better than this item.for the price its a good buy.", "Date": "September 26, 2012"}, {"Title": "Too cheap-o", "Author": "Kyrre", "ReviewID": "R94ANFBWNE7U9", "Overall": "3.0", "Content": "I thought I did get a small, rather sleek, computer, and I did, but was let down by cheap-ish details and that annoying clicking from the touchpad. EVERY TIME. It took me a couple of hours to realise that the Asus really wasn't what I wanted. Click. Click. Click.I ended up getting an iPad with a keyboard. All my documents are in the Dropbox on my home computer.", "Date": "September 7, 2012"}, {"Title": "Amazing Computer, you cant beat the price.", "Author": "Ej Dahm", "ReviewID": "R25E7CG3XON9RY", "Overall": "5.0", "Content": "First thing that I noticed when I received my Asus u32u was the quality of the product it seems very sturdy and has a great design that feels very premium. I added some RAM to my notebook to give it a extra boost and I think it dose very well running programs, such as fairly recent games, Office, multiple website browsing. However I do notice a slowdown when watching videos. The notebook is also very portable and is great for students on a budget. I can say that this is the best laptop I have ever owned.Pros-Great DesignLong battery life (High Performance) 4-7 Hours/(Balanced Performance) 7-12 HoursStrong Performance for the cost.Cons-No CD SlotSlight lag when watching videos.", "Date": "August 24, 2012"}, {"Title": "Good!", "Author": "Jeeeun Lee \"cthamstar at yahoo dot com\"", "ReviewID": "RHD00NRO9DD2M", "Overall": "3.0", "Content": "This laptop is really light and pretty. It's super thin and super light, and it's extremely portable. I'm taking this laptop to college, and this is so perfect. I'm so glad I bought it!However, the laptop itself seems to be very laggy and I have trouble watching videos on google chrome since the audio and the video are very choppy. The scrolling is also off. My older laptop, Dell inspiron 1520 with the re-installed 4gb ram is much faster than this laptop, although this laptop also has 4gb of ram as well. The battery life is great, but it is not functioning as well as I had hoped it to be. Adobe flash player is upto the latest version and I have tried restoring it to factory state, but the problem still remains the same.I don't do much on the laptop. The computer itself is laggy when I'm running only Google Chrome and Skype, and I barely have anything on the hard drive. This is very frustrating to me. :/ I only use the computer for internet and a few other drawing/office programs, and if it's laggy, that's a problem for me. I'm thinking of calling the warranty center tomorrow.Can anybody comment with the list of bloatware that could possibly be removed?", "Date": "July 23, 2012"}, {"Title": "Extremely slow", "Author": "jay", "ReviewID": "R2R01X070NICJW", "Overall": "2.0", "Content": "The numbers advertised (4gb memory, dedicated graphic card, dual core processor) made me think this would be at last usable, but the hardware can't prevent firefox, excel, explorer and most other software to periodically freeze for a few seconds. Multitasking is slow and frustrating, watching HD movies is near impossible because of the lack of power.I have never tried any other ultra portable laptop, so I can not say if the is standard in this category, but I am returning it and will spend a little more money to get something faster.", "Date": "June 5, 2012"}, {"Title": "asus laptop", "Author": "donshot", "ReviewID": "RK5EAR4LPMZJP", "Overall": "5.0", "Content": "i got it well packaged it works well and it came in good shape i got it shipped on time and i loved it", "Date": "August 17, 2012"}, {"Title": "not good the sound sometimes doesn't work", "Author": "123thepoper", "ReviewID": "R2CFB4F7E6T69N", "Overall": "1.0", "Content": "the worst thing i had ever work with the screen sometimes feels loose and it is really slow also if you are a gamer dont get this at all it lags it moves slow and it is bad the only good this is that it has a a HD speaker", "Date": "August 19, 2012"}, {"Title": "Dont buy. You'll get what you pay for", "Author": "Darren Le", "ReviewID": "R3AHB7CNTMMTT7", "Overall": "1.0", "Content": "This is the laptop i bought ASUS U32U-ES21 Ultra-Portable 13.3-Inch Laptop (Silver)Be alert especially if you plan to stay oversea and bring your laptop with you. Why?- Quality: you'll get what you pay for. I always go for ASUS brand because it seems very stable, but this model sucks.- Global warranty: dont be fooled by ASUS about so-called Global warranty. I bought this laptop in US and brought it with me to Sweden. It's a terrible life-time experience.Here are the details:- One day, when i close down the screen, there is a soft eraser in between screen and keyboard. I swear, we couldnt find softer eraser than this, and i'm not that muscular to... break the screen by closing down the laptop.Alright, if this is just my fault, and not because the quality sucks, see another reason below (just let you know, my friend bought one, and he now needs to repair the keyboard).- I sent my laptop to ASUS Global warranty in Sweden, and here is the quotation:+ For changing a new screen: pay 500$ (i'm sorry, is that more expensive the laptop?. Yes!)+ For sending back my laptop to me: pay 175$ (what is this!)+ For discarding my laptop: pay 100$ (this is like kidding me?)And here is the f**king quotation, it's in Swedish but you can see the price![..]", "Date": "July 6, 2012"}, {"Title": "ASUS is paying real close attention to detail here", "Author": "azezal", "ReviewID": "RQEQ0FK0G84DN", "Overall": "1.0", "Content": "According the specifications on the right side of the product description: Dimensions:112.9\" x 9.2\" x 1\" (W x D x H)That's right, it says it is 112.9 inches wide, over 9 feet. This conflicts with the specs on the official global asus site:\"32.8 x 23.8 x 22.5 mm (WxDxH)\"That's right, it now says it is only 32.8mm in width, or just over an inch. And even less in depth and height. Amazingly compact for a 13.3 inch laptop.Amazon's specs also say there are 3 usb2 ports, while asus' site says 2xusb2 and 1xusb3.If asus can't even list the thing correctly, then what makes you think they can design and build it correctly? I tried contacting them about the mistakes, but they haven't even acknowledged my email in over a week, so they don't care about even fixing it.", "Date": "May 3, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "AMD E Series Dual Core E 450 Processor 1.65GHz\n4GB DIMM RAM\n320GB 5400RPM Hard Drive\n13.3-Inch Screen\nWindows 7 Home Premium 64-bit; 3 x USB 2.0 ports", "Name": "ASUS U32U-ES21 Ultra-Portable 13.3-Inch Laptop (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/4152O3iZpCL._SX300_.jpg", "ProductID": "B00713DPM4"}}