{"Reviews": [{"Title": "Wow this thing is amazing", "Author": "Ekallas", "ReviewID": "R15CZ4DOGICXE3", "Overall": "5.0", "Content": "So first I will say I am coming from a MacBook air 11' mid 2011 with 2GB ram and 64GB harddrive. This one I got has 4GB of ram and 128GB harddrive. I use this laptop mainly for browsing the internet and some programming. Now that you have a little background Ill give a quick review.From the get go this laptop is MUCH faster then my previous Macbook air. When you open the lid you are ready to go that second. On the old one I would have to wait a little for it to load and if I left chrome up and clicked on it right away then I would get the loading wheel. I havent seen this do it once. That could be because of the harddrive being so much faster.When I opened the box the laptop was already charged to 91% so im trying to kill it. Well I was on it ALL NIGHT last night and now its the morning and its only at 60%. That battery life is amazing and let me honest thats what we ask for in a laptop.If you are up in the air about this laptop(no pun intended). I would say give it a go. You could even buy it from the Apple store and if you dont like it just return it.If you are replacing an older Macbook air and have one thats because the mid 2012 then I would say get it but if you have the mid 2012 I dont know if I would suggest spending the money unless you really want battery. I hope this helps anyone trying to purchase this laptop.I am not an Apple fan boy. My desktop is a custom build Window machine so I know both worlds. Please if you have any questions just comment and I will be happy to try things for you or just answer questions.I am a Computer Engineer so im use to testing things so feel free to ask.(This is my first review)", "Date": "June 19, 2013"}, {"Title": "MBA Will Be Perfect Once It Gets Retina Display", "Author": "Mike B", "ReviewID": "R434HN9G6BT0B", "Overall": "5.0", "Content": "This might look like just a minor spec bump from last years model. However, the new MBA boasts all day battery life: 11 inch (9 hours) and 13 inch (12 hours). This is a big step up from the previous generation. This is due to a larger battery and more efficient processor. The upcoming OS X Mavericks is supposed to be even more energy efficient than Mountain Lion. The MBA is also faster due to the new processor and has a faster wifi connection. The solid state drive in this computer makes it much faster than a regular hard drive computer.This is a great computer overall. The screen is not as nice as the retina Macbook Pro, however it is not a deal breaker. The MBA is a lightweight, portable computer and the Retina screen is thicker, heavier, and more expensive. Once they manage to make a thin, lightweight Retina Display this computer might be perfect. You will probably not miss the disc drive on this computer because it is a featherweight without it and you can use an external disc drive if you have to or remotely access another computer with a disc drive.If you are debating between the 11 and 13 inch models, it depends on what you want to use it for. The extra screen space, SD card slot, and longer battery life for $100 more makes the 13 inch a worthy choice. However, some want a truly portable machine that can fit easily in a large purse or briefcase.If you are debating between this computer and an iPad with a bluetooth keyboard, consider the ease of use and functionality of the computer versus the portability and cost of an iPad. For students, it is nice to have a real keyboard and be able to easily create documents, spreadsheets, and powerpoints on an actual computer, but I see more and more students with iPads and a keyboard case getting by just fine.If you are debating between 128GB and 256GB (or custom order 512GB from Apple), consider cloud storage. Flickr now has 1 TB free photo storage with no size restrictions. Google Drive and Evernote are great for documents and you can always store your iTunes library on an external hard drive if you have a massive library.If you are debating between this and a Windows Ultrabook/ Google Chromebook, consider the operating system, reliability, customer service, and resale value. People love Apple products and you can resell the computer if you want to eventually upgrade. They hold their value pretty well. The operating system takes a little getting used to but it is a lot smoother than Windows and you will probably never want to switch back to the dark side. If you really need a Windows Program, you can run Windows on a Mac.", "Date": "June 12, 2013"}, {"Title": "Amazing, am shocked how it far outperforms my older Macbook Air", "Author": "VeritasluxMea \"Neoplatonic Platonist\"", "ReviewID": "R1RAKRYX5GWI32", "Overall": "5.0", "Content": "Working off formerly a 13\" macbook air mid 2011, I just bought this new 2013 model with the Haswell CPU and low power consumption infrastructure.Off a full charge, I disconnected 3 hours 40 mins and had an external drive connected the entire time, restarted 4 times, and did NONSTOP heavy application installs (Office suite, Photoshop etc.), a total of 23 applications, and ran youtube vids in the background the entire time, and after all of that nonstop heavy loading, I had 76% on my battery, of which id have around 35% on my older Macbook Air.Further still, the entire unit has run UTTERLY COOL during this EXTREMELY heavy loading, installing and heavy 1080P video graphics play. My other Macbook Air would be almost too hot to touch underneath near back under same conditions.Even without 802ac (new Wifi connection thru the new Air), I notice roughly 25% faster throughput on likewise file downloads using my new Macbook Air than that of my older version Macbook Air.This new Macbook Air contains PCIe-Based Flash Storage Approaches 800 MB/s Read and Write. I notice BLAZING fast write speed on my 1.1 Gig Photoshop app, and seemed about 40% faster than my previous generation Macbook Air. Also, this new Air model contains PCIe-based SSD modules made by Samsung and is smaller than the previous Air model SSD made by Toshiba.These new Airs also sport batteries with increased capacity driven by higher voltages: increasing from a 7.3 V, 6700 mAh power battery to a 7.6 V 7150 mAh power battery. Other changes include a redesigned expanded heat sink covering both the CPU and GPU, which must be why this unit runs SO COOL even maxed out.ALL my apps run perfect on this new Air, including Office suite, and the entire Adobe suite and the rest of my apps, ....which it should, its still running Mountain Lion OS.I really have to say again, that write speeds on HUGE app instals is just faster than you dare hope for; its just blazing faster than my previous gen. Air.My Macbook Air has been without a question my most treasured gem of \"go-to\" Mac product hands down, I own all of them (2 Airs, Macbook Pro, MacMini etc),...I was skeptical when I shelled out $1099 today for the new Haswell Air and its presumed prognosticated \"crazy long\" battery life and improved speeds overall; but the hype isn't hype, its real and amazing. The mere NOTION that I can overload this Air with App installs, and have a 2.5\" HD attached for nearly 4 hours, run 1080P Youtube vids,...and still be at 76% Batt life is just, well, its stunning.Tested out the NEW dual (stereo) mic and it IS much nicer in record, additionally the camera/vid is much sharper and  crisper than my other Mac Air.  Considering the price point is lower on these new Airs than the older ones,  I give the new Macbook Airs a \"110%\". Having repaired laptops (non mac) in the past, and owned at least 20X more laptops than most consumers, I don't lightly conclude this is the cornerstone workhorse for everything I dare consider doing, fast got faster, and battery life now is enough to make a crusty \"hates everything\" person like myself nearly cry with joy. Congrats Apple! Homerun on this lovely gem.I didnt get this delivered in one day, I picked it up from my local Mac store, I got my buddy to sell it to me 1 day before they officially \"have\" them which is today 6/12. As for the questions about using this new Air with Photoshop and it lagging on heavy filtering and photo editing, Ive tested that fully and this IS the machine you want for ultimate portability, it works fantastic.Also of great importance is that this version of Mac Air is supposed to have \"nearly double\" fast write speeds as the Macbook Pro Retina. And the new Hard storage on this Air has \"up to 6X faster than a 5400RPM disk drive\" as found in current Macbook Pro which contain 5400RPM Toshiba Hard drives (made by Hitachi for Toshiba actually). In short, YES, this is a perfect \"must own\" book in the field or travel use for photoshop work, with just blazing fast write speeds, and crazy long battery life.This new Macbook Air brings TRUE definition to being \"disconnected\" and \"portable\" to those who want to do a LOT of work free of the power socket! Genuine portable is finally here, ...no more staring at the battery % to rush to shut down!", "Date": "June 11, 2013"}, {"Title": "Simply the awesomest one out there", "Author": "Jonathan Arnoux", "ReviewID": "R1NSENQ6BRBUR3", "Overall": "5.0", "Content": "I was shopping for a laptop for college and I was initially not considering buying a Mac by principle (anti-Apple-ism, price,...). However, I received many good arguments to buy the Macbook Air and was finally convinced because all the other laptops working under windows I was considering had problems of some sorts, as reviewed by many users. Therefore, I bought the Macbook Air with a 14-day trial. I thought I would bring it back but I never did and ever since it's been a love story.Even though you've probably already heard it all, here are overall the best things about the Macbook Air that makes it the best laptop out there (even with the new Macbook Pro):-Battery life is excellent and recovery is fast. There are several ways to make the battery last longer and some options in your settings.-It's SUPER light, which is a major plus for a college student if you need to bring it to class and around. After a few weeks working with it I was surprised how big and heavy other laptops seemed to me, you have no idea.-The design is very nice, but that's a somewhat subjective notion.-It really doesn't take long to get the hang of all the commands and you might discover some cool \"shortcuts\" by accident, like I did. The experience is just wonderful and if you need any help, there are just so many websites and blogs that can help you and have tutorials or problem solving for new-to-Mac users like me.-The operating system upgrades are free, unlike Windows'. The new OS X Mavericks is just amazing, it's slick, stylish, colourful and just so much adapted to a student's needs!-You can work on many screens, so multitasking is made easy.-If you're Windows-nostalgic, you have the possibility to install a parallel. Plus, the Office for Mac is mainly the same as the Windows one except there are maybe more templates and the designs are more aesthetically appealing. You can also install Google Chrome, Mozilla and other browsers, as you wish.-Internet-browsing is fast and you can zoom/unzoom pics just with your fingers and the trackpad.-The trackpad is life itself in the form of a technologic device: it just feels so smooth and you almost feel like you're the one moving the page like you would with a book or magazine.-The new OS X Mavericks gives you iBooks for free, and iMaps and you can add a map or directions to your events on iCalendar.-If you have an iPhone or iPad, you can sync them with your Macbook and you just have an infinity of possibilities and uses.I hope this was useful and that it helped you in your decision-making process.", "Date": "November 1, 2013"}, {"Title": "Macbook Pro 13 Retina vs. new Air 11", "Author": "A Customer", "ReviewID": "R1EG9KS4GK7MDJ", "Overall": "4.0", "Content": "These reviews really helped me when I was figuring out what to buy, so here are my two cents. I couldn't figure out if I wanted the Pro Retina or the Air, and I wasn't sure if I wanted 13 in. or 11 in. Now, I actually own both the Macbook Pro 13\" Retina and the new Macbook Air 11 inch, and I understand most people won't want to buy both but these are my thoughts. I first got the 13\" Retina, because I loved the screen, esp. the way text looked because I read a lot and it made such a difference. I have the i7 version, plus the 8 GB RAM, and 256 hard drive. I love that thing. It's gorgeous and fast, a pleasure to work on. BUT. The only problem with it for me is the weight. I know it's lighter than it used to be but I'm petite and when I'm traveling and need to give presentations, this thing is in my bag the entire day, and I find it heavy. Many people may well be stronger than I am but I personally find it a pain to drag around when I'm on the road. Also, the battery life is good but not brilliant, so if I use it all morning and a part of the afternoon unplugged, it's dead.So I recently bought the 11 inch Macbook Air as well, the new version, also maxed out, i7, 8 GB, etc. It is so light, it's amazing. It' lightning fast and the battery life is incredible. I can use it and use it and the battery won't budge. However. The screen is so much less good than my Retina Pro. I'm not a picky person and before I got used to the Retina screen, I didn't mind but now, it's a huge difference. The text is pixelated and very small, the whole thing looks much less good.Basically, I think that if you're going to be mainly stationary when using the laptop, I would definitely go for the Retina Pro 13 inch. At home, it's all I use nowadays. It's a joy to use and looks amazing. However, if you travel a lot and will mainly be using it on the go, I think the new Air is fantastic.  I hardly notice it in my bag and the screen is fine, just not as beautiful as the Retina, plus the performance and battery life are incredible. If the weight of the Retina doesn't bother you, that would be the clear choice.", "Date": "August 29, 2013"}, {"Title": "A battery that does what a laptop needs / Volume Fluctuation Issue", "Author": "Publicagent \"Publicagent\"", "ReviewID": "R1Q0F7VTF30P2S", "Overall": "4.0", "Content": "I have been using the new Macbook Air for almost a week now. I actually started with the 11 inch because I wanted the lightest possibly laptop, and I used to have a smaller screen, but I guess it was just too small. I was noticing things like a shaking screen and I had been using a 15 inch Macbook Pro with the aluminum keyboard for the last five years. When I got the 13 inch, everything looked and felt just right.In my opinion, a laptop battery has one major task. It should allow users to do everything they want on their laptop without having to plug it back in. I used it for about 1.5 to 2 hours two evenings in a row doing internet surfing, minimal video watching, and some word processing. The next day I used it for close to 8 hours of word processing and internet surfing. You know you have an amazing battery when the bar goes red, and you check to see that you still have two and a half hours remaining. I did not check exact times, but I think I got over 11 hours before charging it back up (including 3 days of sleeping). I was also surprised to see that it had recharged before I went to bed!In this day and age, laptop users should understand that you never get the same amount of battery life watching non-stop high quality videos as you would using basic software and the internet. I use a laptop fairly frequently for projects/entertainment, but can not think of one instance in which I would need over 12 hours of battery life. More than 8 hours and my eyes start to blur. The bottom line is that Apple's initial estimate of 12 hours is not off, and I am happy to say that I will not be taking my charger with me anytime I plan to return to my house to sleep later that evening. I don't have to worry about battery life for the first time.One small quirk is that the time estimates of the battery are sometimes off. For instance, I have checked my battery status and seen an estimate of 17 plus hours remaining. I admittedly got overexcited before it quickly went back down to over 12. The percentage is always accurate, however, and it's intriguing to see how long you can last with 100% battery life remaining.As for the rest of the computer, the keyboard is great, the screen is nice, but not stellar, and there is a slight glare when I work in direct sunlight though it's nothing objectionable. I think that Apple has set a new standard with this laptop because it's obviously light, but the battery is truly amazing. It's also picking up the internet feed in my house as good if not better than my other devices.IMPORTANT UPDATE: I have noticed an issue with volume fluctuation when watching movies on Netflix and sports on ESPN. The issue persists on Safari and Firefox. Unfortunately, other are having this issue and no one that I could find as of yet reports it as being resolved. This is a shame. This laptop is so good otherwise I am still giving it 4 stars, but this is a major issue. I have downgraded to 3 stars until this gets resolved.UPDATE REVISED: The volume fluctuation issue appears to have been fixed with an update. Loving the laptop again. Battery still going pretty strong.", "Date": "June 17, 2013"}, {"Title": "Mac-Brick Air", "Author": "grh2011", "ReviewID": "R5FSSO00RCQ3J", "Overall": "2.0", "Content": "Bought a mid 2013 Haswell Macbook air 3 weeks ago on the basis of 12 hour potential battery life, thin size and light weight and general trust in Apple products. We have an older 17\" Macbook Pro that has been through the war and still functions perfectly. Since day 1 this MBA has dropped wi-fi connections everywhere continuously, and despite doing everything by the book-phone support and software upgrades, genius bar appointments, higher level support,etc, and 3 swap outs for other machines it still drops wi-fi. This is a widely known issue worldwide, yet Apple still has no fix for it. They continue to sell it and then ignore you or make you jump through senseless hoops for no reason-there is no fix. Was contacted by an Apple engineer who made me run a diagnostic and send it to him. He said he would help me-never heard from him again.After my last genius bar appointment, after running a diagnostic that proved the drop, the best they could offer was for me to upgrade to a retina-pro-at my expense. I really like the machine otherwise, but Apple has really dropped the ball here and in my opinion is committing fraud. There is much speculation on the forums as to why and how, but as consumers its really not our problem to diagnose or fix.They know its broken-its a widely known issue world wide, there is no fix, yet they continue to sell it. The official Apple Macbook support forum has probably 200,000 views on the wi-fi issue posts and 1100+ replies....more than any other post. Wake up Apple!-fix this issue. We have all been more than patient!. DO NOT BUY ONE TILL THIS IS FIXED!-YOU WILL BE SORRY!.", "Date": "August 18, 2013"}, {"Title": "I chose this over 13 ''Macbook Pro Retinal Display", "Author": "Sam", "ReviewID": "R16MNCYIMJR1D2", "Overall": "5.0", "Content": "Pros1. Portability is a very underrated advantage.  Great to use at bedside. Easy to carry around the house or in an office setting. So light, you can pick it up with one hand and lay it down on the floor while in bed without moving.2. Doesn't get Hot and you don't need a lap desk - MacBook Pro models don't get hot relative to PC's but are more hot compared to the 'Air3. Battery lasts a very long time. Lasts longer than MacBook Pro models especially retinal display4. Very Fast - solid state hard drive not a disc so very quick loadingCons1. Display isn't as nice as the MacBook Pros particularly the retinal display.2. Only two USB ports and thunderbolt  port. No SD port. No Ethernet port3. No Disc Drive \"Optical Drive\" but none of the new Mac lap tops (MacBook Air or MacBook Pro models) have this. Also it wouldn't be a MacBook Air if it had the disc drive(would weigh more) so it's a moot criticism. I already owned a separate disc drive than I can easy attach through a USB port and I never need to use it anyway since everyone can be downloaded online. Only time I need it is to watch DVD'sWhy Mac over PC1. No Spam - search the internet in peace without multiple pop-ups and adware slowing your computer down. No viruses2. Not Windows! - I recently experienced Windows 8 on another laptop and it is atrocious. I'm so glad I don't have to deal with Microsoft products and Windows. I can't believe they found a way to make WIndows more cumbersome3. Intuitive - Macs are designed with human intuition in mind. Everything is designed to be simple and easy to use. You don't need experience with Macs to use this. Since 2007 when Macs began to use Intel chips, the Macs took the best Windows had to offer and improved upon it. You can even buy Microsoft Office for Mac (which I have) so you lose nothing.  So if you are scared to use a Mac, you will find these new Macs are very easy to use.4. Great Service in Apple Store - if something breaks down, Apple is great about replacing parts, computers and honoring warranty.5. Reliable and Durable - My Macbook Pro from 2009 still works like it is out of the box. I just wanted a lighter smaller computer and keep my Macbook at home.", "Date": "September 19, 2013"}, {"Title": "I'm a believer", "Author": "Jpeppard", "ReviewID": "RLT1NYZMRA7XG", "Overall": "5.0", "Content": "Let me start by saying that thus far in my career of Windows PC building, operating, and maintaining, I have never before used a device that could be seriously described as elegant.PROS:The form factor is astounding, I find myself picking the unit up just to look at it and consider it from different angles. The all aluminum chassis has a pleasing texture, it is lighter yet feels far more solid than any other ultrabook I have encountered. The hinges have no undue give, yet there is little effort needed to engage them.The trackpad is a marvel. After only a few days I am amazed I ever used a Windows laptop without proper OS trackpad integration. Every flick and swipe is picked up and acted upon without hesitation, it is a shame this responsiveness is so alien when coming from Windows.OSX is very polished, lightning fast on this SSD. I find myself much preferring it for every activity I use my PC for besides gaming. Swiping between fullscreen pages is intuitive, trackpad gestures are tight and do much to streamline navigation. I feel more compelled to recommend it to clients, no more ad-ware, no flavor of the week virus infections. No embarrassingly mid-life crisis 'reinventions' to fight with as in Windows 8. One OS for desktops and laptops, separate OS for touch-enabled devices.802.11AC Wifi! I can finally use my lonely 5GHz band! I have not experienced any wireless dropouts or hiccups as others have described.Haswell architecture has enabled an unheard of real-world 10-12 hour wireless browsing battery life while packing a fully featured quad core i5 chip with HD5000 graphics. Unprecedented for this size and weight. HD5000 tackles Skyrim at comfortable mid-level graphics and playable frames, at the expense of extreme system heat.Built in bootcamp allows easy Windows 7 dual booting for those OS specific applications, still eeking out 6-10 hours depending on usage, providing a better Windows experience than Microsoft themselves.CONS:Maybe HDD space? All my music is stored with Google, photos and documents on Dropbox and Skydrive. Install Office and Photoshop and still have 90GB left.This is not really a con, just a function of nature. Packing this chip in this form factor means heat! Working in OSX is fine, doesn't break a sweat. Once you bootcamp Windows 7 and try on your gaming pants however, expect this thing to live at 99 degrees celsius with fans full tilt.I used to argue against Macs purely from a price point perspective, but for $999 (bought at Best Buy) I feel this machine is a steal. I can see myself using this system for the next three years easily. With no mechanical hard drive and sturdy construction it will take quite a drop or impact to take this thing out.In closing, the Macbook Air shows that a carefully controlled eco-system can work in the right hands. As opposed to leaving manufacturers to their own devices and quality control standards, Apple has examined every facet of their platform and made purposeful design choices, polished them over several generations and realized them with very strict hardware standards.I have experienced the Windows 8 bombshell from ground zero. Poorly implemented and designed manufacturer software, random black screen freeze ups and hundreds of other software bugs, 5 different operating system recovery methods for 5 different manufacturers, it no longer makes sense to me.I have been assimilated into the cult of simple OS interface and reliable, controlled hardware platforms.", "Date": "August 6, 2013"}, {"Title": "It's small, light & the battery lasts FOREVER.", "Author": "Jonathan Edwards", "ReviewID": "R2CS3FXYZFYE3I", "Overall": "5.0", "Content": "I sat at the store debating on the 11\" MacBook Air or the 13\" MacBook Air for about an hour the day I bought this laptop. I had been using a 2007 MacBook Pro for 6 years and was ready for something new and wanted my next computer to be ultra-portable but have a great battery life as well.Needless to say I got the 11\" and haven't looked back.The battery lasts longer than my iPhone 5s, seriously. For the first time in my life I can go an entire day without being even slightly worried about the battery life. It's incredible. It's a laptop you can go on a weekend road trip with... and leave the charger at home!I purchased the base model for $999 and it has all the power I could have hoped for. It turns on in an instant. It ALWAYS wakes up from sleep in what seems like no time at all (half a second maybe?) and the thing hasn't once crashed, froze, stalled or overheated.I had my MacBook Pro for 6 years, from the looks of things I'll have this one even longer. Everyone I know comments on how small & fast it is. It's like driving a Ferrari, everyone stops to check it out.I can't recommend this laptop enough. I regret absolutely nothing about this purchase.", "Date": "October 30, 2013"}, {"Title": "Best laptop available for the price at the moment", "Author": "Marky Mark \"Mark\"", "ReviewID": "R1266LFM3YSUNQ", "Overall": "5.0", "Content": "This laptop is really nice.  For the price I would recommend this as the very best laptop for your money and here is why.+It has the most modern SSD (released in Q1 of 2013) that runs 40% faster than Gen 1 SSDs.  The drive and laptop in general is amazingly fast.+It has the just released new wifi protocols which will future proof the laptop for some time.  The wifi on it is amazingly fast and out performs all other wifi devices using the some internet source that ive tested.+It has the legendary apple keyboard and track pad which are the best I've ever seen on any laptop regardless of price.  The track pad especially is amazing... if you've never used an apple track pad you have no idea what your missing, it literally controls almost every function on your computer except for typing and it's very intuitive and easy to use.+It has the newest integrated intel HD graphics (5000) which are faster, better and use less power than any other laptop.  Very few other laptop options have the HD5000 graphics chip.+It has Haswell processor.  It is very fast and very efficient.+It has 12 hour battery life (continuous use).  Its battery is nothing short of amazing.  I used the laptop off and on as I would normally use it and it took 5 days for the battery to die.-Screen is mediocre.  It doesn't reflect too much light though which is good and it performs well enough (but it's nowhere close to the retina display).-Quality control is lacking.  Numerous negative reviews on the laptop refer to specific manufacturing defects (wifi, laptop body defects, ETC).  If you get a good one, you're good, but you might not be able to notice a defect until the return period has passed.If you're on the edge, this is the laptop to buy if you want a light, portable machine that is fairly high powered.  If price is not a concern I would wait for the Q3/Q4 2013 MacBook Pro as that will likely be a nicer, more powerful machine with retina display and the same great features found on the air.", "Date": "July 3, 2013"}, {"Title": "Great but had some Quality Control issues...", "Author": "D \"Darker\"", "ReviewID": "R202V0VL5COIYI", "Overall": "4.0", "Content": "Well, I purchased this at the Apple Store at Manhattan Beach, CA, and immediately upon opening the box, the Macbook Air had two small dings in the aluminum - one on the side of the monitor, and one that appeared to be small hole by the keyboard. It was small but noticeable, so I returned it and got another that was in pristine condition. Any Apple executives out there reading this, please check out this store. I don't know if they're repackaging returned products or what but this was the second time I purchased something from there and had to return it because of some issue.The Macbook Air was a better choice for me over the Macbook Pro Retina (which I kept for three days and returned), and here's why - (1) better battery life (until they come out with the new Haswell Pro's)... you will get 12 hours at least if you're writing and doing light surfing or watching Youtube videos. If you turn off wifi and bluetooth, you may get more; (2) smaller and easier to carry, hold, etc. (this factor might not sound much but it makes a huge difference and is probably the #1 reason why people love their Macbook Airs); (3) less expensive (which means I was less paranoid about it); (4) and for some reason, the screen doesn't hurt my eyes as much. It's strange but the Retina display hurts my eyes after a few hours. (5) the keyboard is great right out of the box so it's easier to type on than the Macbook Pro. I had to work on the Macbook Pro for 3 days before the keyboard was soft enough for me to type faster. Also the fact that the laptop is shaped like a wedge also helps me type faster and is more comfortable for me to type on (Apple exec, please take notice of this for the Macbook Pro's).Concern?: the monitor is a bit looser than the Macbook Pro. For instance, if you adjust the viewing angle, the Macbook Pro was stiffer. But then again, I am a perfectionist and I notice little things like that.Conclusion: if you want one of the most reliable brands out there, and you like ultrabooks, the Macbook Air in my opinion is your best bet. Just make sure to check every detail before you keep it. And it sure does beat using Windows 8. Damn that OS is ugly and close to unusable. I have no idea why anybody would want to touch their monitors. I'm probably in the minority, but I think tablets aren't really efficient for productivity. It's harder to cut and paste, use word processing software, etc. I'm more productive on a laptop... and I definitely don't want to touch the screen but that's just my personal preference. THIS IS BY FAR THE BEST LAPTOP I'VE EVER HAD. THANK YOU APPLE!!!! I'M IN LOVE WITH MY MACBOOK AIR!!!", "Date": "June 13, 2013"}, {"Title": "Known problem, how to reproduce", "Author": "Alan", "ReviewID": "R3VIHLDJS3ABOB", "Overall": "1.0", "Content": "The screen goes black (sleep) and needs restarting. Many people have lost their work and faced embarrassment. Apple will not acknowledge the problem. This issue was covered by CNET in July 2013: reviews.cnet.com/8301-13727_7-57595935-263/mid-2013-macbook-air-experienc ing-black-screen-bug/ And again in December 2013: reviews.cnet.com/8301-13727_7-57616121-263/2013-macbook-air-black-screen-woes-continue/Summary:On any mid-2013 MBA (11\" or 13\"), when system is idle long enough to dim the display/go to sleep, the screen fades to black. If the user tries to prevent sleep by tapping a key or trackpad, the system hangs with a black screen. The CAPS LOCK key toggles on/off when pressed, but no other user input seems to do anything. Closing the screen and reopening has no effect. Only a hard boot will bring system back. The happens whether on battery or plugged in. Any unsaved documents/code files are lost.Steps to Reproduce:1. Let system idle and wait for display to dim (based on power settings).2. Wait a couple more seconds for screen to go black.3. Wait a split second more for keyboard backlight to begin to fade.4. Before keyboard backlight is completely off, press a key or swipe the trackpad (as if trying to prevent the system from sleeping, thus requiring re-entry of password)Expected Results:I would expect the system to wake up and let me continue with what I was doing.Actual Results:When touching the input as the keyboard backlight is fading, the backlight illuminates brightly, but the screen stays black. The CAPS LOCK key will toggles its light on/off. No other action will wake up the system. Only a hard boot will bring system back on.", "Date": "January 23, 2014"}, {"Title": "I expected greatness; this MB Air is even better!", "Author": "samgn", "ReviewID": "R16T9XHS6UTL8O", "Overall": "5.0", "Content": "I laughed recently when I was told about an outlaw (an in-law's in-law) who read my wife the riot act because we use Apple products. It took me back to the time a number of years ago that I did the same to people who chose Macs over PCs. That was in the days before iPhones and iPads, even before iPods. At the time, it seemed that everybody except a few college students was using machines that ran on windows.  I remember bragging about how great my laptop was and what I could do with it.Fast forward to today, when we use an iMac at home, iPads for a variety of tasks and I carry an iPhone. I have gone through a succession of MacBooks, from a basic MB to a MB Pro that I loved. I had reached the place, however, that I just carried my iPad with me in a nice Zagg case with keyboard. I wasn't sure I would ever carry a laptop again.My travel got bumped up a bit this year and I found some weakness with my iPad.  I'm a touch typist who found that the loss of my bluetooth keyboard or airplanes was more than a small disruption.  I was also missing some robust software that just couldn't be matched by the company's IOS app.  Therefore, I decided to try out the 11.6-Inch MB Air.  Here is what surprised me:1. This Air is so small and light that I have no problem carrying it and my iPad with a smart cover.  The weight gain from this little computer is negligible.2.  My former MB Pro had 8 GB of memory and I was concerned that this one only had 4GB. The updated processor and the SSD drive make the new computer significantly faster.3.  The keyboard is full-size and helps me stay focused on the screen, where my work is taking place.4. The display itself, though small, is just enough workspace for the word-crunching that I do.For those who are considering a migration from windows, imagine life without the \"blue screen of death.\"  Think about the ease of document management between your laptop and those other i-devices you probably already have.  When people ask me today why I love a particular Apple product,  I usually say, \"It just works!\"  Try one and see.", "Date": "April 7, 2014"}, {"Title": "Ideal laptop except for a couple of concerning points", "Author": "Sameer Ismail", "ReviewID": "RM9QI8YWS8NSE", "Overall": "4.0", "Content": "Perfect machine except for a couple of things:-sleep/wake failure: sometimes that screen dims and then immediately sleeps while the backlit keyboard and hard drive/sound/network card are still active and the only way to use the display again would be to force a restart. a search on google would show that MANY people who have bought the 2013 MBA have this problem (\"black screen of death\"). I still have not found a fix and I would assume that if I brought in my MBA to an apple store, they'd replace it for free. it does not happen often enough to force me to replace my machine though. I might do it in the future-it is so thin that the end of the machine feel sharp and if you aren't using the laptop on a desk, they will jab into your wrists and it will be painful. i guess i got used to it.", "Date": "November 17, 2013"}, {"Title": "13.3 MacBook Air 256gb 4gb ram new version", "Author": "Cole", "ReviewID": "R1V7AE10D08GG6", "Overall": "5.0", "Content": "I have never written a review on Amazon and I have spent over $20,000 on this site. I must say that this computer has blown away my expectations. It is completely sealed just like any SSD shell would be. It doesn't get hot, it doesn't freeze up, and it doesn't require or even prompt for anti virus software. It is fast and very responsive. I have been an Aircraft Mechanic for the DoD for the past ten years working with aluminum structures. This MacBook Air is very well build. Aircraft grade but I cannot see any rivets. I will never buy a PC again. I have talked down about Macs for years until I got this one in my hands. When you first get this and run the battery down for a full discharge it will exhaust you. Even at 13% it gives 2.5 hours of battery life left. When I charged it fully it showed 14 hours till death but it levels out and is accurate pretty fast. I highly recommend.", "Date": "September 20, 2013"}, {"Title": "Best Macbook Air Yet", "Author": "Christopher Mayo", "ReviewID": "R2Q4JYL0NG6OER", "Overall": "5.0", "Content": "I moved from a 2012 11\" Macbook Air to the Apple MacBook Air MD711LL/A 11.6-Inch Laptop (NEWEST VERSION) and I don't notice any difference at all in performance. However, I think it is the best one I've ever used because of the battery life. I easily get roughly double what I used to with the 2012 Macbook Air. I have the base model with the i5 processor, 128 GB of storage, and 4 GB of memory. [REVIEW EDITED JULY 10]Battery Life---------If you change the brightness to about 75% (this is the level at which Apple did their testing) you ought to easily get 8-10 hours of use out of the computer. From online comments, it looks like other people are getting better results from their batteries after the first charge cycle, so if you are having problems, discharge it once (I went down to 7%), charge it, and see if that doesn't help.Should you Upgrade?----------You ought to see a huge performance boost upgrading from a 2011 or earlier Macbook Air, but is it worth it to upgrade from the 2012 Macbook Air to this one? Probably not for most people, unless battery life is a critical factor for you (it is for me). Some of you might notice a small performance bump, but most (including me) won't. Physically, with the exception of a tiny hole on the side for the mic, it is also indistinguishable from last year's model.11\" or 13\" ?----------I wrote a review of last year's model here (http://www.amazon.com/review/RLCO4ZC1NVQMD/ref=cm_cr_rdp_perm), where I extolled the virtues of the computer. Everything I said there applies to this year's model as well, and my only complaint (the battery life) has been addressed. I also still think the 13\" base model is a better buy for the money, but because I value portability, I stuck with the 11\".If you are a student or teacher, you can get an academic discount ordering through Apple instead of Amazon. At the time of this writing, it is $50 less than Amazon, but you pay tax, so it ends up costing about $15 more. Both Apple and Amazon offer free shipping.", "Date": "June 16, 2013"}, {"Title": "Why would you buy anything else?", "Author": "Caohu09", "ReviewID": "R2RATBZH1OJP63", "Overall": "5.0", "Content": "I will probably sound like a HUGE Apple geek, but I have to say, this is the PERFECT travel computer.I bring it to the office, university, and business trips out of country. It is amazingly light, versatile, and strong.In reviewing the actual usage, it is AMAZING. I can play League of legends with little lag on high graphics and a good connection. I can do small editing to videos from my go pro, and I can zoom around on the internet.For my battery life, I have have between 16 to 20 hours on normal webserfing, and 8 or less on gaming days. (Pictures if requested.)Though desktops might have an upper hand due to the fact that windows computers can be user upgraded, Apple beats the world in portable electronics. Think about it, why does every laptop look like an Apple now?", "Date": "March 12, 2014"}, {"Title": "Love it.  Small, light, good for travel", "Author": "Earle S. Greene", "ReviewID": "RXZH3K4P0J330", "Overall": "5.0", "Content": "UPDATE 3/20/2014 - I'm still loving this computer.  I took my first business trip since buying this computer and am now using it to type this update in my hotel room.  I decided not to take my Galaxy Tab with me, and so far I have not missed having a tablet with me at all.  The 11.6 inch Air is truly the best of both worlds.______________________________________________I really like my Macbook Air.  I got a great deal on a refurbished unit from the Apple Store with a  duo core I7 with 8 gigs of RAM and a 512gb SSD drive, almost $300 off the original price.  The computer looks brand new and no blemishes as far as I can tell.  The display is clear and sharp and the Air is very light.  I can hold it easily in one hand.  Some have complained about the lack of retina display in the Macbook Air line.  I have seen both a non-retina Macbook Air and a retina Macbook Pro, and while I agree that the display on the Pro is much nicer, the display on the Air is still very nice.  I have no complaints in this regard.  This is not my primary computer, so I don't need a retina display.  I travel a lot in my work, and the 11.6 inch air is perfect for this purpose.  It's as light as a tablet, fits nicely on a airline tray table when flying, and is a fully functioning computer to boot.  I really don't  need a tablet anymore after getting this computer.", "Date": "February 25, 2014"}, {"Title": "Nearly my favorite device ever!", "Author": "C. Moore \"Chris\"", "ReviewID": "R2YFV5RKZVTEKT", "Overall": "5.0", "Content": "This computer is the second favorite gadget I've ever owned behind my first iPod Touch.  There's just a novelty and a fondness to everything that I could do with that little iPod that I'll not soon forget.  With that, this little laptop is more capable than any other computer that I have ever owned.  It only weighs about a half a pound more than an iPad 2 and gets 2 more hours on a charge (12 hours) thanks to the Haswell processor that was introduced with the mid-2013 update.  This is also my very first Mac and it couldn't be a better choice.  I can't say enough about this machine!", "Date": "February 24, 2014"}, {"Title": "Horrible Customer Service Experience", "Author": "MacAttack \"MacAttack the World\"", "ReviewID": "R3ZMJ8DR1AOWS", "Overall": "1.0", "Content": "I want to preface this by saying that I owned a Macbook Pro a number of years ago. I was playing music professionally and touring around the country. The Pro was solid for 4 years straight without a single issue. However, I decided to quit music and return to academics, and upon doing so I had to sell everything in order to afford tuition, including my Macbook Pro.For the last three years I had been using a cheap, yet incredible for what it was netbook (Lenovo X100e ThinkPad), but mid-way through the Spring '13 semester it died on me. I had been wanting another Macbook for a long time, and I used this as an excuse to get one - I was very excited.I ended up purchasing a brand new Macbook Air 11\" and for the first few months I was very happy with it - it was everything that I remembered being great about Macs, and more. However, two months ago I installed a new OS update via the App Store. The computer immediately crashed after the update was completed, and when I tried to restart it the computer booted to a flashing hard-drive with a question mark - it couldn't find the hard drive.I decided to just turn it off and let it sit for a while, and upon returning to it and turning it on the bootup went normally and it was working fine again. I figured it was just some weird glitch. Thirty minutes passed and all of a sudden the computer froze - only option was a hard reset. Again, the same problem - it was not able to find the hard drive.I scoured the forums and found that this is a fairly common issue. I did a full wipe of the HD and reinstalled the OS (twice) and the issue still remains. The computer freezes and crashes about 1 to 5 times a day. It randomly does this, and it randomly decides to work again.Now, the significant issue that I have had is that I'm a poor student who doesn't have hundreds of dollars sitting around waiting for me to be able to leisurely spend - I have enough trouble buying enough food every month and I literally live in the cheapest apartment I can find, with wonderful amenities such as cock roach infestations, drug addicts, etc.I called my local Apple Store and explained my situation - the computer was brand new and I had even purchased some kind of 1 year warranty when I purchased the computer (which was over $100) and I asked them what they could do. They were quite rude and told me that they wouldn't do anything until I paid them $300 for extended 3 year AppleCare. I only found this out later (via a more friendly call rep from the national Apple Store) that there was a student discount for the AppleCare.The local Apple Store rep certainly knew that I had purchased the Macbook at the student discounted price, yet he didn't even bother mentioning to me that there was a student discount available for the AppleCare - he evaded it all together and attempted to con me into paying the full price, which I refused to do anyways - the computer (at the time of calling them) was only 3-4 months old!I was infuriated, and this is when I called the national Apple Store hotline - I thought that perhaps I hadn't explained my situation properly, and I didn't want to deal with my local Apple Store again. This is when I found out about the student discount, and I have to be honest and say that the call rep was very friendly and wanted to help me; however, the situation was the same - he was requiring that I pay an additional $200, on top of everything I have already paid the company, before they would even consider looking at it.I find this downright appalling. I shouldn't have to pay $1300 for a brand new computer from a giant company, have the computer fail after the company releases a software update 3 months later, and then be conned into paying an additional $300 before they will even consider looking at it for me.Maybe my expectations were too high given the exceptionally high quality of my old Macbook Pro, but either way I find this situation to be quite absurd. This company should take care of its customers.I won't exaggerate and say that I will never buy an Apple product again, but I am definitely in the process of selling the Macbook - probably at a financial detriment - and giving my business to another company (probably Lenovo again).The Macbook Air actually seems like an overall great product - when it works. I suppose that if I forked over the $200 that all these problems would go away, and it would cover me for an additional two years. I do honestly think that $200 is reasonable for the amount of time of coverage. However, my experiences with their overly rude customer service and the principle of the matter is what upsets me most. This is why I have decided to extricate myself from the company at this time.Obviously this is just my experience, and I doubt that it is a common one as I'd imagine most people have the extra cash to spare ($300 is $25 shy of covering 1 month of rent for me, so it's a big deal - especially given the circumstances of it being a brand new computer). If you have the extra cash to spend, then I would recommend the computer, but a part of me (the biased and irrational part, perhaps) is giving this product a 1 star due to my experience and is suggesting that you seek out another company to deal with.", "Date": "August 22, 2013"}, {"Title": "Impressed", "Author": "Paul L. Alford", "ReviewID": "R2VAKYJJLEZU87", "Overall": "5.0", "Content": "There are so many reviews of this item, another might seem unnecessary but maybe a word would help someone. I had an older Toshiba running windows 7. Like many I was concerned about learning a new Operating System. Not too worry. Within a few hours i was comfortable. This machine is light years ahead of the Toshiba. It took over 4 minutes to boot up the Toshiba. This Mac is ready to go in 15 seconds. The various functions seem designed more with the user in mind. The pad can be used for most functions while surfacing the web using one, two, or three fingers.  Battery life is amazing compared with other laptops i have used. I regularly use the Mac for two days, several hours a day before recharging.  As I write this, the battery indicator says over 15 hours. A friend who has had his Mac for several years says going back to windows is like going back to a model T. If you have any reservations about getting a Macbook Air, I say give one a try. 98% of users can't be wrong. Highly recommended!", "Date": "April 14, 2014"}, {"Title": "LOVE this Laptop!", "Author": "Roberta", "ReviewID": "R194STO19N1XYM", "Overall": "5.0", "Content": "I've had Dell and HP computers before buying the MacBook Air.  The HP laptop literally fell apart in 15 months and their support would not fix the problem although obviously a manufacturing defect.  It was difficult for me to justify spending extra money for an Apple, but have absolutely no regrets.  Should have done it much sooner.I am not a techy and do not understand all the internal greatness of these machines, but know from Apple's reputation and family and friends that have them that they have been pleased with the laptop and service Apple offers.  In my unprofessional opinion, this Mac is awesome - lightweight, easy to use, everything I want/need and more.  Buying through Amazon was quick, easy, AND I saved money!  Don't hesitate - buy it!!!", "Date": "April 11, 2014"}, {"Title": "Great computer, much better than previous models", "Author": "switters", "ReviewID": "R1JC70RO6TAQRF", "Overall": "5.0", "Content": "This is my first computer with a solid state hard drive, but it will not be my last. It is so fast, it is absolutely amazing. The newer MacBook Airs are much better than the older versions, the computer handles all of my daily multitasking with ease, and I can also play my video games on it with no issues.I was not sure if I would be able to go with this because of the graphics, and I play games like Borderlands 2 on Steam. But I've been able to play solo and online with friends with absolutely no issues, and the game looks great.I cannot stress how fast this is. It can completely reboot in less than 20 seconds. It is not the powerhouse of the MacBook Pro, and no, it doesn't have a huge hard drive, but if you want a great computer that will last for a while, I would highly recommend it.", "Date": "April 8, 2014"}, {"Title": "I will never buy a PC again after this.", "Author": "Danny Curtis", "ReviewID": "R3RAZIDRNXSPVR", "Overall": "5.0", "Content": "Bought a laptop with the new update of Windows 8.1 and hated it.  Never owned a Mac before but love my IPads.  It was perfect right out of the box and set up was so quick.  Couldn't believe it.", "Date": "March 30, 2014"}, {"Title": "Prefect for Traveling", "Author": "Brittany Johnson", "ReviewID": "R3BB1X95ZF7C7F", "Overall": "5.0", "Content": "My White Unibody Macbook from 2009, which was my first mac, was unable to update any software or connect to a server and the bottom was falling off so I thought it would be a great time to upgrade. I am sure glad that I did and it is a huge upgrade.Weight: It's lightweight which makes it perfect for traveling.  I'm a professional musician for a living and plan on taking this on the road with me to work on music projects. It folds down nicely but there is still some substance to the machine which I love. It doesn't feel flimsy at all. I've also noticed that it doesn't heat up like my old macbook did. It's cool as a cucumber, even when running some light games. The only time I've noticed it slightly hotter is when the battery is plugged in or installing apps.Battery Life: The battery life is AMAZING! I have yet to hit below 50% in a day of heavy web surfing, emailing, Garageband, light gaming, and Finale (music notation software). If you are someone that travels and will not have access to an outlet for long periods of time, I would highly recommend this laptop.Fast!: The flash storage makes opening applications and documents significantly faster than on my White Macbook. I can also tell that the Wi-fi is a little faster as well. While writing this review I had both open and the air had a faster load time. Everything seems to be more zippy if you will and it's so clean.Storage: I was worried at first that 128GB would not be enough. However, if you are using this as just a basic computer without heavy programs it will be plenty. I couldn't justify an extra $200 for 128GB more of memory. With external hard drive prices coming way down, I will buy one if I am running low on storage. I'm struggling to find things to fill it with. With movies and music in the cloud, and helpful storage apps like dropbox and google drive I definitely do not foresee it being a problem.I am very happy that I chose the Air over the Macbook Pro and Macbook Pro with Retina display. The battery life and weight were what sold it for me, and it is also currently the cheapest option. If you really need the disc drive you can purchase one from apple for about $79 but there are cheaper alternatives. So glad I picked this laptop and as always apple has great customer service and wonderful software included like Garageband, iPhoto, iMovie, Pages, and Numbers.If you are coming from a PC you won't regret it. This is my second Mac and I don't think I'll ever go back.", "Date": "March 4, 2014"}, {"Title": "The Spoiler", "Author": "Samuel Chell", "ReviewID": "R18SSBR9UPQNXX", "Overall": "5.0", "Content": "When Apple came out with the first Mac Air in 2008, the computer (and the company) received widespread criticism, derision, ridicule--what! a computer without an optical (CD) drive?  The machine was universally declared a loser accompanied by predictions of Apple's demise.  When 2009 produced no sequel to the first Air, it was pretty much assumed that the Air was gone with the wind.  But then Apple surprised everyone, including the experts, by not only releasing a new edition of he Mac Air in 2010 but adding an 11\" model to the original 13\" screen.  Both machines caught on with users, receiving  high recommendations from Consumer Reports, and eventually leading to the phasing out of the laptops with optical drives that the Airs had replaced.It's no secret that computer sales are getting trounced by tablets and mobile devices and that the Apple managed to lose much of its polish in 2013.  But things would have been much worse without these exceptionally practical, lightweight, sleek machines (so thin and light I always seem to have trouble finding it in my shoulder bag).  I purchased the 2008 model, then immediately sprang for the first 11\" model (anything to lighten the load).  I doubt I could ever return to a heavier machine.  The 11\" Air has proven a reliable work-horse, quick and practical in every way (as they say, the best camera is the one you have with you).  If the photos and print are occasionally a trifle small (and my eyes aren't getting younger), clicking on the capital \"A\" in the menu bar is sufficient to enlarge and clarify the picture.The major improvement of the 2013 over my 2010 model is a backlit keyboard (a return to the keyboard of the original 2008 Air), plus twice the storage of the basic model and, above all, a long-lasting battery (easily worth the step up).  I tend to run my screens bright and wasn't get much more than 2 hours' use out of a single charge.  Now I can use the machine for 8 hours or longer without a charge.I purchased the 2013 machine past the mid-way point of the cycle (an upgrade should be due out in June or July) because the price was right (Apple's discounts are refurb models are generally worth the discount), and I simply don't see how Apple could possibly improve the machine.  (If they did, I probably wouldn't want it.)", "Date": "February 23, 2014"}, {"Title": "Awesome!!!", "Author": "C. Meyer", "ReviewID": "R27TOM5H74N703", "Overall": "5.0", "Content": "This laptop is one of the best purchases I have ever made! It is lightning fast, paper thin, and light as a feather! Here's a bit of advice though: when you are buying it, the 128 gb is something like $1,048, but when you go up to the 256 gb, you add another $200 dollars to the price. Take my advice and just get the 128 gb version, then get a 1 tb external hard drive for about 50 or 60 bucks. This saves you so much money and gives you so much more space. Other than that, this is the best laptop I have ever worked on, and I definitely recommend it!", "Date": "February 16, 2014"}, {"Title": "A great laptop", "Author": "Wesley T.", "ReviewID": "R349ELLK7KXM01", "Overall": "5.0", "Content": "Not much else to say other than what has already been said about the MBA '13. It's simply a great laptop, and gets tremendous battery life. Windows also runs okay in boot camp, but really requires an external mouse to do anything useful. The trackpad works in Windows, but it's not really a good experience (navigating and especially right-clicking are somewhat unintuitive and cumbersome).I'd like to point out a couple things that are more particular that others might not have mentioned or that potential buyers might be wondering:- For coding, it's more than adequate. Running a 10,000 particle custom C++/OpenGL SPH fluid sim, I got about the same performance as a baseline-model Mid-2012 MBP that my coding partner was using. For XCode, I can run the iPhone simulator on my apps and games at the full 60 fps. All this can be attributed to the HD5000 GPU. For raw CPU compute power, it won't be as powerful as a recent MBP and will be comparable to the previous generation MBA, but that's the tradeoff for the 9 hours of battery life.- For graphic/2D design, it's got enough compute power for pretty much anything, but the screen leaves something to be desired. In a pinch, it works, but you'd be better off with something else as your primary laptop.- For 3D design / CAD, its got enough compute power for basic objects, but you should try to keep the poly count of the scene/model fairly low, as the HD5000 isn't really intended for such use.- If you are a user of Lyx, it is very problematic on Mavericks (10.9). I've yet to actually get it working, and other users who seem to have gotten ti working report a lot of error. You'll either have to use Lyx on Linux/Windows, or revert back to writing up in pure Tex/LaTex.- If you are a Windows user, there are many applications you can get that more closely replicate the Windows experience. The two main ones are KeyRemap4Macbook and Hyperdock. KeyRemap lets you customize your keyboard shortcuts to be the same as Windows (or anything else you want), and Hyperdock gives you taskbar previews and Window snapping like in Win7/8.", "Date": "February 8, 2014"}, {"Title": "An outstanding little laptop", "Author": "Zachary M Burtsche", "ReviewID": "R15Y14XQ19W2E6", "Overall": "5.0", "Content": "I am a software developer and I use this machine to program, run business applications, and do some heavy surfing.  I am very pleased with the performance this machine can get from its fairly modest hardware specifications.The 4 GB of RAM is more than enough for OS X Mountain Lion, which itself outstanding.  It feels faster and more stable than my old Asus G73JH running Windows 7, which had 8 GB of RAM and a 2nd generation Intel Core i7-740QM.The display is small, but I normally use an external 27-inch Thunderbolt Display, which this machine runs win zero problems and turns the visual experience into a joy.  I have used it for about 6 months with zero issues, and I love it.", "Date": "February 7, 2014"}, {"Title": "Slam dunk!", "Author": "Johan", "ReviewID": "RUSVMG99FMS73", "Overall": "5.0", "Content": "I bought this laptop for my job (I do web design, graphic design, as well as normal day-to-day business stuff) for when I'm on the go (I have a Mac Mini in the office and a Mac Pro at home). Both my other Macs have 16 Gigs of RAM, so I was expecting that I would have to upgrade this one too (it only comes with 4GB). I was figuring this would be like a netbook with sub-par performance. However, the performance has blown me away, in all the times I've used it, it still seems like I've never even really strained the performance (to be fair, I don't multitask on this laptop or use extra displays). My guess is that it's because of the Flash Memory being extremely fast, and the computer thus having super fast swap memory. I've had it for months now and I probably charge it once a week at the most. It's very light, very aesthetic, powerful, just all around amazing. I've had an iMac, a MBP, a Mac Pro, and a Mac Mini, but in terms of price to performance this has blown me away. Highly recommend!", "Date": "January 17, 2014"}, {"Title": "BEST PURCHASE EVER!!", "Author": "CM", "ReviewID": "R1TKV7GX47GYCV", "Overall": "5.0", "Content": "I got the upgrade with 8gb memory.  This is my go to machine.  Its very fast, very user friendly, and can handle many programs running at once.  I'm a teacher so my typical day is as follows: MS word, MS excel, Chrome (10 tabs), Safari (5 tabs), evernote, mint.com, iBook,pdf viewer.  My husband is a software architect so he has lots of other things open as well.  This still out performs all our machine in speed.  By the way, this machine NEVER GETS HOT and makes ABSOLUTELY NO NOISE!I especially wanted a machine that would be easy to use and I don't have time to fix viruses, software glitches, and such.  I also don't want to trouble my husband with anything as he is usually very busy.  He is looking it that I never bother him at all.  As a matter of fact,  I think he is considering getting a high powered apple machine because of the ease of use I have with this one.Our last apple machine was an ibook in 2001 and that was a real disaster and considered never going back to Apple.  But Apple has come so far in the last few years.", "Date": "January 16, 2014"}, {"Title": "Best I've Owned Yet", "Author": "Teehee", "ReviewID": "R28X5RMOUD0GMC", "Overall": "5.0", "Content": "This is the third laptop I have owned, but this being the first Mac. Most of my old windows PC would crash often and have many other issues causing me to look into other OS's. I decided I was going to get  a Mac, and I will never be going back.", "Date": "December 31, 2013"}, {"Title": "Macbook Air just keep getting better!", "Author": "Far2Go", "ReviewID": "R2472J7NTBMAYX", "Overall": "5.0", "Content": "Another perfect laptop in the Macbook Air line.  It's my 4th Mac laptop and best yet.  The illuminated keyboard wasn't on my 2009 Air and man, did I miss not having it.  Other speed and port enhancements make the Air the finest laptop computer going, be it for home, work, travel or school.  With DVD and CD's on the way out there seems no call to lug the added bulk an optical drive adds.Note: I bought a Square Trade Warrantee this time around instead of Applecare; hopefully I won't need it, but Applecare is overpriced in my view.  It's been helpful for my Mac Pro's, but for a portable product, the Square Trade deal covers possible disasters Applecare omits.", "Date": "November 20, 2013"}, {"Title": "Great computer, but takes some time to adjust and using PCs for 20 years.", "Author": "Wayne J. Kassel \"Wayne\"", "ReviewID": "R2D4G67COFAD66", "Overall": "5.0", "Content": "This is my first Apple computer and I must say I am having some difficulty learning the ins and outs after many years as a PC user. Apple has many tutorials to help the transition.  The SSD is super fast and the battery life is better than any computer I have ever owned.", "Date": "November 12, 2013"}, {"Title": "I love it.", "Author": "B. Bodine \"R0D1MUSPRIME\"", "ReviewID": "R3FPUYSFO1BI34", "Overall": "5.0", "Content": "This laptop is great.  It is super fast, instant on.  I leave it in sleep mode most of the time, I rarely ever shut it off.  It used for our home computer on our lower level.  I charge it about once a week.  The battery life is second to none.  It's even better with Mavericks.  I couldn't imagine owning a different laptop after this.", "Date": "November 5, 2013"}, {"Title": "Best laptop I've ever owned", "Author": "N. Sweeney", "ReviewID": "R3B7Q08XW1GNRL", "Overall": "5.0", "Content": "Until I got the MBA 2013 I used only PCs.  I'm not going to get into the differences between Mac OS and Windows;  Suffice it to say that I don't necessarily see that one is much better than the other...they're just different.  Regarding the hardware, however, this Macbook Air is incredible.  The design is just beautiful.  If the Sony and Dell laptops that I've owned in the past have been Toyotas and Nissans, then this MBA is an Audi or BMW....a truly luxurious experience.  I bought the laptop because of the reported 12hr battery.  I've been waiting for a laptop that gets 10+ hrs in stock configuration (I'm not counting thinkpads with battery slices attached), and this laptop has totally met every expectation I've had.  It really has transformed the way I use my laptop and how readily I will consider packing it when going out/away.  I'm happy with the non-retina resolution.  It appears to be a fairly high resolution to my eye when compared to my most recent laptops.  It runs completely silent 99% of the time - the only exception is when I run a game that taxes the GPU.  I pretty much love the thing.  Am looking forward to see what Mavericks will bring to the game.", "Date": "October 20, 2013"}, {"Title": "Beautiful computer!", "Author": "Matthew Leach", "ReviewID": "R1T67MN5XAUILZ", "Overall": "4.0", "Content": "I sold my mid-2011 11.6\" MacBook Air simply because the battery life just didn't cut it for me. With all I find myself doing on the computer for school and work, 3 hours of battery just didn't cut it. I bought the new 2013 Macbook Air (13\") for two main reasons:1) I wanted a bigger screen size. The 11\" model, while gorgeous in its own right, was just too small for me. Too much scrolling, not enough space for my palms when typing and very small text on the screen. I know there are ways to fix that by spreading your fingers out on the trackpad to enlarge the text, but c'mon...I shouldn't have to do that :)2) I NEEDED a longer battery life. For gal's sake, it has been quite the struggle to find ANY respectable computer with a decent battery life. I hate having to charge up two or three times a day. Without internet or bluetooth, and the lowest brightness setting, my old MacBook Air lasted maybe 5 hours.Needless to say, the 13\" model nips both of these problems in the bud. Not only is the 13\" more enjoyable to look at (higher resolution, bigger text size, larger trackpad, etc), but the battery life is quite impressive. (Now I'll add a disclaimer in here: Apple says to expect up to 12 hours of battery life, but I don't think they mean 12 hours of continual use. I used this thing for about an hour and a half --light browsing/word processing, a little more than half the brightness--and it went from 100% to 85% in a little over an hour and a half. I mean, nothing to really complain about, but it's not as strong as I was led on to believe. Maybe I should decrease the brightness some more?)It is true, the 13\" is a bit heavier than the 11\", but I still consider it highly portable and easy to take around. It's a super fast and quiet machine, and contains all the beauty one would expect in a Mac. Oh yeah, and the price? Definitely worth it! If you want to save $100, you may want to consider the 11\" model, which is going for $949. I guess it just all depends on what you'll be using this machine for.All in all, 4  out of 5 stars (I'd do 4 1/2 if I could). Marvelous, sturdy machine with an impressive battery life.", "Date": "September 10, 2013"}, {"Title": "Black Screen of Death/Now Fixed", "Author": "Mike Robbins", "ReviewID": "R3MCKXT8YUK1Y2", "Overall": "4.0", "Content": "Update: FIxed with OSX 10.9.2For the last few months the screen goes black at least once per day while the keyboard is still lit. The mac has to be hard booted to be usable again. The Genius at the retail store told me this is a known issue and Apple will eventually fix this problem. This sounds like something Microsoft would say... \"Just live with it, there is no problem, It's a feature.\" This is the first macbook I have owned and will nor recommend to my friends and family. I purchased this expensive machine so it would work. How can I do presentations in a business environment and still look professional with an issue like this?", "Date": "February 25, 2014"}, {"Title": "A polished machine that delivers on portability and functionality", "Author": "Laurent \"grinmister\"", "ReviewID": "R25XG1WCK0F6V7", "Overall": "5.0", "Content": "Bought this laptop for my wife. She switched from Windows 8.1 to Mavericks. There was a bit of a learning curve, which is to be expected, but she took right to her Mac. I'm not a huge fan of the \"everything proprietary\" approach: it makes the Mac hard to compare to anything else - but she loves it and Apple's pre-installed suite of software (which now includes Works). She also loves the fact that her iPhone and her Mac sync automatically via iCloud.Two possible improvements:a) on our home-brewed battery rundown test, the Macbook 11-inch ran out of juice 5.3 hours into running an .mkv video on a loop, using the VLC Media player. I'm told Quicktime might do better, but Quicktime is not a great player.  This much less than the advertised battery life. In normal browsing and word-processing, the battery life increases to nearly 9 hours. But many of us watch videos on those cross-country flights and 5.3 hours is cutting it close.b) How about a touch screen? That would make it even more like an iPhone.", "Date": "November 9, 2013"}, {"Title": "Great MacBook with an amazing battery life", "Author": "Manuel Mueller", "ReviewID": "R337JSY5QJQ6EF", "Overall": "5.0", "Content": "I was looking for a new laptop that would be primarily used for travelling. For this purpose it had to be light, compact and have a great battery life.Initially I wasn't looking into Mac's as I was always more familiar with Windows than with MacOS and never had any problems with the OS from Microsoft but the advertised 12 hour battery life of the 2013 MacBook Air convinced me to give this one a try and I did not regret it.The real battery life that you will get per charge will heavily depend on what programs you are running. When using programs that are very CPU/GPU heavy, combined with maximum display brightness you will likely get about 4-5 hours.However, I use this Mac primarily for working with MS Office programs like Excel and Word as well as for surfing the web, and under those conditions the battery does indeed last for 11-13 hours per charge.The compact form factor allows the use of this Mac even when you don't have a lot of space available (i.e. Economy Class seats), and the spectacular battery life means that you don't have to worry about the battery running out even when you are on long flights.I can fully recommend this MacBook Air to anyone who is looking for a reliable mobile computer that will be primarily used for working/media/surfing, if you are looking for a mobile gaming machine you are likely better served with a Windows laptop as the selection on available games is fairly limited on the Mac.", "Date": "July 4, 2013"}, {"Title": "Never getting a Windows machine again", "Author": "Austin Kish", "ReviewID": "RI3KZ2VNE3T7N", "Overall": "5.0", "Content": "I work for a technology company writing technical documentation, and took a Windows laptop when I started working there.  But, my department needed to migrate someone to a new MacBook with the 802.11ac wireless protocol, so I took one for the team (ha!) and was upgraded to this sweet little machine.Wow.  What took me so long to move to a Mac?  I love it.  And I'm only on the 13\" base model (128GB HD / 4GB RAM / 1.3GHz)I think I've always been a little sticker-shocked when looking at Apple prices for personal use, but I do have an iPhone and an iPad and there's something to be said about the wonderfulness that is the Apple ecosystem and the Apple Cloud.Everything worthy of being said has already been said in the numerous reviews:- The battery life is impressive- The start time and general load time of applications is jaw-dropping- The machine is incredibly light but feels very sturdySome things I appreciated coming from the world of Windows:- iMessaging integrated into the laptop, so when I have an important text message come to my iPhone, I get a pop-up and can respond from my computer without pulling out my phone.  Super convenient.- Multi-touch on the trackpad, I don't think I can ever go back to old trackpads.  There's a slight learning curve but once you start utilizing the multi-touch gestures regularly, the efficiency is great.- Even though I practice good computing practices, after a year or two of use, I would always have a few nagging issues on my Windows machines.  Usually issues could be fixed by running malware extractors or registry fixes, but there would always be *something* and I found it to be good practice to do a complete restore every other year or so.  While I've only had the MBA a few months, Apple reviews and my short experience indicates that nonsense will be left in Windows-land.Accessories that I got for my MBA (since this is my main machine at work, I use it as a desk computer):- Logitech K750 wireless solar keyboard for Mac (Apple currently doesn't make a wireless keyboard with number pad)- Apple Magic Trackpad- An HP Pavilion 23xi IPS LED monitor for second screen; I did have to run a script to make it work with the MBA which you can find by googling.- If price is of no object, go for the Apple Thunderbolt Display.**all of the above have a gray matte finish similar to the MBA and look very nice together on my desk**- The Grid-it!  Since there are a lack of peripherals on the MBA, I had to get a few adaptors, namely a Thunderbolt display port for second monitor expansion, Thunderbolt Ethernet port, USB port expander, and the standard stuff you'd need for any laptop: Wireless adaptor for non-BT keyboard, a few thumb drives, headphones, iPhone/iPad charger, SD card holder and adaptors.  Instead of all of these things falling to the bottom of my laptop bag, my life is neat and organized with this accessory.- Ubiquiti UniFi 802.11ac Access PointOther accessories to consider: External CD/DVD or Blu Ray drive, External HD, and/or AirPort devices.After about three months of use, I am a very happy camper.", "Date": "September 5, 2013"}, {"Title": "Better than I expected!", "Author": "George", "ReviewID": "R1AG34JVEZSO7V", "Overall": "5.0", "Content": "This laptop blows my mind! The battery life on this incredible! It's a fully functional computer with a tablet battery life. I chose to buy this because the \"12 hours of battery life\" advertisement. At first I was slightly skeptical thinking that 12 hours is 12 hours of doing absolutely nothing on the computer and was expecting more like 9 hours of battery life. Once I got it however, I realized that 12 hours really means 12 hours on this laptop (sometimes even up to 15 hours)! At least according to the battery percentage thing on the Mac (which is surprisingly accurate as well). Of course if you're watching HD movies or playing games it would be a lot less, but under normal circumstances (normal web browsing and some normal work like word, excel, and powerpoint) you really can get 12 hours out of this thing!I have yet to drain the battery of this thing. Closest I've been is about 60% on a weekend where I was on it whenever I had free time. Also, 1.3Ghz may not sound like much, but somehow everything runs so smoothly (I was able to play World of Warcraft on this thing with the default \"good\" graphics, with 1.3Ghz... wtf?!). The fan is so quiet that you'd think it doesn't have one until you start doing intensive processing, however under normal usage you don't even know that the fan exist. I personally think that if you're going to go with a high end iPad, might as well go with the Macbook Air. You can do so much more with the same amount of battery life, and only a couple hundred more than a high end iPad.This thing is so lightweight and portable, you can pretty much treat it like a tablet anyways (especially if you get the 11 inch version). And if you need internet, just use your phone to tether. Worried about phone draining when tethering? Just plug it into your Air and recharge it while it tethers internet for you! I honestly think this Macbook Air will finally be a computer of mine that'll last more than 2 years. I've had many PC computers and laptops, and nothing has wow'd me like this Air has.Oh, and last but not least. The entire thing is solid state! No moving parts! So it might as well be as tough (or even tougher, because the screen is protected when closed) than any other tablet out there! It can be dropped and still function fine, with maybe a few dents and scratches. But who cares, it still works! It's ultra portable and ultra tough!", "Date": "August 10, 2013"}, {"Title": "Great laptop", "Author": "Lani O. Cornell", "ReviewID": "R3BHSO64E6N7WR", "Overall": "5.0", "Content": "Very pleased with this purchase.  I have always had a PC but this time decided to go with Apple.  I am so glad I did.  The learning curve is rather painless and when I did need to call Apple for support, they were fantastic.  All in all, very happy.", "Date": "April 20, 2014"}, {"Title": "Totally lives up", "Author": "Ysabel Mullarky", "ReviewID": "RL3K6IYV4F7H7", "Overall": "5.0", "Content": "Another great machine by Apple. The one thing I was concerned about was that it might not be able to handle some of the statistical software that I needed to load on it but so far it's holding up beautifully. I'm planning to have it with me for a long time.", "Date": "April 20, 2014"}, {"Title": "The Perfect Laptop", "Author": "Greg", "ReviewID": "R9SA8M8M4LBBW", "Overall": "5.0", "Content": "I don't usually write reviews, but after owning this laptop for a bit over 6 months I felt compelled to give it the glowing review it deserves. This is simply a fantastic machine.Pros:Speed! With the SSD, everything is so snappy and waking up the laptop is virtually instantaneous.Trackpad is second to none. Make sure to configure custom gestures for common tasks.Battery life is absurdly long under normal use conditions. After 6 months I'm still getting 8+ hours per charge.Great looking screen with high brightness.Lightweight while still feeling really solid & sturdy.OS X is a pro for me.Cons:Bigger SSD is unjustifiably pricey.Speakers are just okay.", "Date": "April 14, 2014"}, {"Title": "It's A Mac!!!", "Author": "navydoc", "ReviewID": "R3VRD0WWWUGNVD", "Overall": "5.0", "Content": "I have been using Macs since the original in 1984. This MacBook Air is a beautiful piece of Industrial Design and Engineering; it is a piece of art. If you hold the MacBook Pro in one hand and the MacBook Air in the other, the MacBook Pro feels like brick! And if you have ever used a Mac you are aware of all of the advantages of OS X and the beautiful Apple monitors. The MacBook Air is an engineering masterpiece! I love it!!!", "Date": "April 9, 2014"}, {"Title": "Love it", "Author": "Andrew D.", "ReviewID": "R2TCFEWDWEV8XN", "Overall": "5.0", "Content": "If you are on the fence in getting a mac or a pc. Do yourself a favor and try mac out. I was a proud pc user for years and I have now owned 5 macs, and I will never go back.", "Date": "April 6, 2014"}, {"Title": "I love this machine!!!", "Author": "Ricardo", "ReviewID": "R15UEYUHCIXZRH", "Overall": "5.0", "Content": "I have loved this laptop since Day 1, Its been 2 months now and I don't regret it!!! Haven't needed to call tech support or nothing.Pros:Wifi 802.11ac(fast!)High Res screenbeautiful designAMAZING backlit keyboardBest Trackpad Ive ever usedVERY USER FRIENDLY (Set up my printer in like 5 sec. and a wireless mouse in 2)Battery life is spectacularCons:Hmmmm, missing retina display but that doesn't bother me AT ALL!!", "Date": "March 10, 2014"}, {"Title": "Sleek and speedy.", "Author": "Nathaniel Bannister", "ReviewID": "R13FBHQ7E6NIGG", "Overall": "5.0", "Content": "The air has really earned it's place at the head of apple's notebook lineup. Great speed and an amazing profile defined the ultra book form factor and have made the Air the computer to beat.", "Date": "February 4, 2014"}, {"Title": "Superfast compared to the Mid-2011 model.  Same form factor and screen quality", "Author": "Mark B", "ReviewID": "RVE76OQZWO9H3", "Overall": "5.0", "Content": "This latest iteration of the MacBook Air is very speedy.  At least double that of my mid-2011 model.  Other than that, the form factor is the same and the screen is of the same clarity, brightness, and quality.  I have not seen a great improvement in battery life compared to my 2011 model either; it has been lasting about 8 hours with normal use, and about 6 when running Parallels (with Windows 7) or working with pictures.  So maybe not worth an upgrade just yet if your MBA is 2011 or newer, but a highly recommended laptop otherwise.  I am the only MBA user out of a company of a few hundred, and my MBA has lasted longer and remains faster than the stock PCs we buy.  Using Parallels (and Windows 7), I am as able as any of them to use Windows applications as needed.  100% compatibility with our network and others so far!  I sure wish Macs would get a little more traction.  Apple laptops like the MBA are truly innovative, user friendly, and quality-built.  If you are new to Macs, the MBA is a great place to jump in.", "Date": "October 17, 2013"}, {"Title": "everyone should hv one.", "Author": "holin", "ReviewID": "R16YFG49IPQFR3", "Overall": "5.0", "Content": "This is my first ever purchased laptop. I just love it. It is very light, fast, user-friendly. Some may think 11.6 inches is too small, but I (a small girl) am completely fine with its size. I just need to buy the Microsoft office to do my documentation work.", "Date": "September 18, 2013"}, {"Title": "smooth, sleek, and functionally fast.", "Author": "B Vuong", "ReviewID": "R12OUHQLJ16FJ", "Overall": "5.0", "Content": "i prefer my laptops to be mac's and desktops to be windows. im, but no means a fanboy, but i love the MBA. it's replacing my 2009 MBP which is now slightly long in the tooth with performance for today's streaming media demands, as well as even everyday internet usage.no hiccups.", "Date": "September 16, 2013"}, {"Title": "Perfect balance of size and weight", "Author": "Dan Farley", "ReviewID": "R1EN8BBI612O3B", "Overall": "5.0", "Content": "Bought this for my wife - she didn't like being tied to our iMac. Impressive battery life, faster than the iMac (you have to love solid state drives). Screen is gorgeous. If your a mac person - you'll be used to the high build quality - if you're coming from windows it will delight you for months.", "Date": "September 13, 2013"}, {"Title": "Mac does it again", "Author": "J. Philip Geddes", "ReviewID": "R11Y4V7Q4YXN08", "Overall": "5.0", "Content": "A masterpiece in terms of size and weight with all the bells and whistles that make the mac top dog.  I'm an admitted Mac freak and have been since the macPlus many moons ago, while I wince at the price I revel in its simplicity and (horrible word) functionality.  Once you get over the sticker shock retreat to mac Heaven.", "Date": "September 4, 2013"}, {"Title": "great", "Author": "jie yang", "ReviewID": "R3F4RSZRQDBFYW", "Overall": "5.0", "Content": "fast delivery, good price and excellent produce, i love it. i think it will be better for cheaper price. Huh", "Date": "July 15, 2013"}, {"Title": "BEWARE - Get Warranty - Spend More Money to Protect your Investment or Spend More in Repairs!", "Author": "Jaswinder S Bola", "ReviewID": "R2UUFWJK8DW4Q9", "Overall": "1.0", "Content": "Get the WARRANTY - My Mid 2012 Macbook Air i5 8gb has already had:- Screen replaced (due to dead pixels)- Hard Drive SSD crashed and was replaced under their recall program- Now, that I am out of warranty the Memory has started to fail, so I was told by the Apple Tech - Ironically this is right after I took my Laptop in for Hardrive Replacement Recall... They messed up my laptop when they replaced the SSD and now I'm at fault for the memory failing!Apple wants me to fork out another $280 to replace the logic board after I have already spent $1400 USD on this laptop!This laptop is only a year and a half old!!!Apple \"USED\" to be reliable... but not anymore... which is probably why they are promoting the warranties so much.Good Luck to all... This is made in China so I guess we get what we pay for...By the way I own a lot of Apple products: iPad, iPad mini, iPhone 5, macbook pro, airport extreme, ipod's, iTouch.. Apple is slowly losing their loyal Customers...", "Date": "November 26, 2013"}, {"Title": "Great Purchase", "Author": "R. Allen", "ReviewID": "R3GD72ZIQ0H4J4", "Overall": "5.0", "Content": "Needed a Windows-based ultra book to take on the road for work. Purchased a Dell XPS 12 at a local retailer, and the machine had numerous issues so I took it back the next day.Fortunately I woke up and realized that I could run OS X and Windows on a Macbook Air - so no problem with running the Windows-only software that I needed for work.The new Macbook Air 13 is the best machine of its kind - design, materials, build-quality. I ordered it with the newer Intel i5 Haswell processor which is more than sufficient to meet my needs. It has 4GB of RAM and the 256GB Solid State Drive. The overall performance of this machine substantially exceeds the performance of my mid-2012 Macbook Air 11. Battery life is very significantly improved.Recommendation to those out there searching for a Windows-based ultra book - don't overlook running Windows via Boot Camp on a new Macbook!", "Date": "February 9, 2014"}, {"Title": "Recent Convert", "Author": "JayU", "ReviewID": "R2HOAG51GW4PV0", "Overall": "5.0", "Content": "If you're looking for a Windows PC equivalent, you've come to the wrong place. A Macbook is not a Windows PC, and that's the beauty of it. Apple does not believe in the numbers game of the hardware spec of a computer. Instead, it focuses on creating a beautiful machine in which all the parts work in harmony creating a spectacular result for the end user.Being a PC-guy, it took me a long time to even give Apple a chance. In terms of raw power and customizability, a Macbook in the same price range could never come close to a PC. However, when I saw how beautifully the touchpad and hotkeys worked in sync with the OS, I was hooked. I saw the beauty in simplicity, and how the this Macbook had everything I needed and none of the junk.The MBA is a small, light, extremely portable, has roughly a 12hrs battery life. The 1.3GHz i5 processor isn't the most powerful in the world, but it's perfect for running the everyday things that most people use their computers for, such as surfing the web, emails, streaming videos, and writing word documents, all without destroying the battery life. And if you need that extra power, it can boost up to 2.6GHz for the extra tasks. I haven't noticed any performance deficiencies between this laptop, and the $1000 desktop I built 3 years ago (granted 3 years is a long time). One thing that I did notice though, is that it is not a PC. Coming from a PC, many of the programs that I used to use were really optimized for PCs only. Sure Macs have their own equivalents, but if you're thinking about making the leap, you have to know there is a slight learning curve. But who cares, when Apple's software updates are free or close to free, and they hand out their amazing iLife and iWork suites for free for purchases made after Oct 2013.Great product, and great company! IMHO", "Date": "November 28, 2013"}, {"Title": "Will never buy a PC again!", "Author": "Jennifer Jahn", "ReviewID": "R2I2LIMLI7HHTT", "Overall": "5.0", "Content": "The Macbook Air is the perfect piece of technology for college students, such as myself, who need to have a laptop on them at all times (NOT A TABLET) but cannot stand carrying around a big chunky computer on top of all our books. It is so light, portable and fully functioning I would recommend this to anyone even though it is pricier than a PC from Windows or HP, etc. LOVE IT", "Date": "November 5, 2013"}, {"Title": "overall review of my I Mac Air", "Author": "Joel M Serin", "ReviewID": "R4DV80ZRHXAYS", "Overall": "5.0", "Content": "I love my Mac Air because it is so much faster than my PC desktop and so light  I can carry it  or store it easily  on trips. Because of the keyboard it is easier to type than on a pad plus my screen is free of smudges this way. I also like that my home screen has  my Favorite places which I use  frequently.", "Date": "April 7, 2014"}, {"Title": "an apple convert", "Author": "N. janus \"Kitzler Kino\"", "ReviewID": "RY0F8H68H09R7", "Overall": "5.0", "Content": "I hesitated getting this product from Amazon instead of going to an Apple store, turns out, everything is pretty intuitive and if you don't know, you can always go on line and get the right answer, I am a convert to Apple, no more Mr. Monkey Boy Ballmer products  for me!Sorry Mr. Nadella, but after trying Apple, your predecessor killed any goodwill I had for MS.", "Date": "April 6, 2014"}, {"Title": "Apple, what can I say", "Author": "peanuttz", "ReviewID": "R2LVP9J64TDF4U", "Overall": "5.0", "Content": "I hate iTunes.But, I love MacBook. Pro. Air. With retina display! An integrated experience. Leight weight. Nearly perfect...Get!!!", "Date": "April 4, 2014"}, {"Title": "A great choice", "Author": "Andrew W. Ryan \"Andy\"", "ReviewID": "R17FW86IJ84KJS", "Overall": "5.0", "Content": "I got this as an open box with an education discount when my desktop died. These discount put the MBA into my price range and I couldn't be happier.It's really an amazing machine. I'm not a fanboy of Macs or PCs. I've used PCs since the '80s and know my way around them pretty well.The instant-on features and battery life of about 10 hours makes this more like using an iPad than I ever would have thought. It's great to just pull out and get to work; no startup delay, no looking for a plug, and it's silent (I don't know if it has a fan, but I've never heard it). The SSD makes programs open nearly instantly. And it comes with Pages, Numbers and Keynote to get you up and running with productivity apps.Biggest pluses over everything else:- Best trackpad I've ever used: I never would have thought I could get used to a trackpad after almost unusable experiences on nearly every PC laptop I've used. It's huge, sensitive and nearly always makes sense after just a couple minutes of figuring out the gestures.- Long battery life: This really has all-day power. No need to find a plug or carry a bulky cord (this cord is actually not much bigger than an iPad cord and very portable).- Macs seem to make better use of screen space. It's hard to look at an 11-in Macbook and realize that's the same screen size as Windows netbooks. Multiple desktops, smart use of full-screen and fast gestures to navigate them help a lot.- Light and well built. Macs are known for this and it's no joke. Every aspect seems well thought out.Things to consider:- I got the base model because it was available but 256 GB would be a lot better than 128 GB. (Base OS install is about 12 GB; another 20 for included apps, Photoshop, MS Office, Xcode; 10s of GBs more for music, and that space goes quick). You really need to think about what files you need to keep on your computer and shift some to external backup drives. The extra space would all be available for downloads, pics, files.- There are still some things the iPad does more intuitively with dedicated apps, like keeping your Facebook current and Pandora playing.- More RAM. I'm not a power user but there are times I think I've got too much going on.- Retina display would be nice.Bottom line: With an external drive this makes a perfectly fine desktop replacement if you don't run ridiculously intensive apps -- you probably know who you are -- and if you're not a gamer. It seems every bit as good as the base MacBook Pro model. With the discounts, this wasn't a choice between this and higher MacBooks but a choice between this and midrange Windows laptops. There are some interesting things going on with the transformables and touch screens, but I'm completely satisfied with my choice.", "Date": "March 23, 2014"}, {"Title": "Simply beautiful", "Author": "Trotti", "ReviewID": "R1S5RAQLN1CAK2", "Overall": "5.0", "Content": "Everything I could want in a computer.  Great battery life, great keyboard, easy to use - it's nearly flawless.  I think my single complaint is the bulk of the charger and the fact that the battery lasts so long that I tend to misplace the charger because it's needed so infrequently.This was also my first Mac - a big switch for a long time PC user.  Not sure I'll ever go back to slow loads and bulky computers that are slammed together with inconsistent manufacturing standards.  This is a work of art that is also a great computer.", "Date": "March 20, 2014"}, {"Title": "Great computer", "Author": "Jeferson", "ReviewID": "R2EN37P6LN72U3", "Overall": "5.0", "Content": "I gave this computer as a gift to my wife. She loves it! It is really light and has a fast processor. I have been an IBM PC user for a long time so to get used to the different configuration of the IOS it is a little difficult in the beginning. As we are Iphone and Ipad users it made a little easier. In general a great computer, well designed and it is great looking!", "Date": "March 12, 2014"}, {"Title": "Apple's best Mac", "Author": "MARIA CELADA", "ReviewID": "R3QUS5D8WWCBX9", "Overall": "5.0", "Content": "This our fourth Mac within the family !!! and we think that MacBook is the best !! Light, Friendly, Nice performance !! and fair price", "Date": "March 8, 2014"}, {"Title": "Fantastic Laptop", "Author": "NL", "ReviewID": "R3JPOYLF4LQXVZ", "Overall": "5.0", "Content": "Lightweight and sturdy, with excellent battery life, this is the best laptop I have ever owned. Admittedly, I had to pay a little more for it, but that's okay when it comes to apple products--because they are built to last. It's amazing how fast the computer boots up when I flip up the screen. The flash hard drive is incredible. I would very much recommend this product to anyone in school needing to transport a laptop around throughout the day and who also requires said laptop to have a long battery life.", "Date": "March 2, 2014"}, {"Title": "My first Mac", "Author": "Mike Garzelloni", "ReviewID": "R10LG22HUO6WCB", "Overall": "5.0", "Content": "Allot more than I could afford, but Amazon/GE 12 month free financing plan made it work.Years of windows computers I thought would make for and awkward transition. WRONG. Mac's are really easy to use and their support people are the best ever. No regrets!", "Date": "February 28, 2014"}, {"Title": "Awsome", "Author": "neyda Hernandez", "ReviewID": "R30Y3PUBY676JM", "Overall": "5.0", "Content": "I like the sleekness of it and that it does not weight a lot, also that it does not take long to turn on.", "Date": "February 25, 2014"}, {"Title": "Apple MacBook Air", "Author": "Mrdwe", "ReviewID": "R2YOG6I8XQYS7", "Overall": "5.0", "Content": "I am very happy with the MacBook Air. My  Dell Laptop stopped working after 5 years and I purchased the MacBook Air to tie in with my iPhone and iPad. It is fast, great screen, light weight and the battery last a long time. I purchased through Amazon but my local Apple Store help me with the setup. My purchase was in December 12/2014 and it has worked as advertised so far.", "Date": "February 22, 2014"}, {"Title": "light and does all your need", "Author": "xtreme", "ReviewID": "RLGNVKSFJ45D5", "Overall": "5.0", "Content": "started on Mac notebook, then the Mac pro and finally this one. Though It has no CD rom, the ethernet port and has smaller hard disk space and smaller ram memory, the convenience of carrying this when you travel is priceless. This and a mini iPad and you have a perfect way to travel. As in any mac, you have to purchase all the softwares and cannot transfer old purchases (word for mac, adobe etc.) which I found was quite an expensive endeavor consider you now have 3 laptops with individual software. Thus, before buying a mac you prefer, consider its weight specially if you travel as this laptops are your carry ons. the rest of the missing component can be bought thru their store or online (portable cd rom thats mac compatible, an ethernet adapter thru mac port ..there is a name for it which i forgot, and a portable HD or usb with high capacity.", "Date": "February 9, 2014"}, {"Title": "I love it!", "Author": "O. Guzman", "ReviewID": "R1DECZ8V3XU0YP", "Overall": "5.0", "Content": "Not only does this computer feel well built, the battery lasts as long as an iPad.  I am amazed how I only have to charge it once a week for normal browsing.If you are stuck on picking between a MacBook Pro or MacBook Air, just ask yourself if you really ever watch physical DVDs anymore...it's not worth it.Computer boots in around 11 seconds, the flash hard drive is killer fast.  Some may say the 128 GB is small, however I no longer really keep stuff on my hard drive due to iTunes Match and iCloud, and you can always insert a large SD card for additional storage.In regards to the 4 GB of RAM, think about the fact that the computer has a solid state hard drive, which it uses for virtual memory.  4 GB RAM may not sound like much, but having a wicked fast solid state drive for virtual memory will not make it feel like a Mac Mini with 4 GB RAM.  I have 16 GB in my Mac Mini and my MacBook Air is faster.", "Date": "January 20, 2014"}, {"Title": "Best computer I've owned so far", "Author": "Trysta", "ReviewID": "R3C98ZBK4Q8N3K", "Overall": "5.0", "Content": "For my purposes as both a scientist and a student this laptop is basically perfect. You know how usually people say nothing is perfect but this gets close...NO.This computer is (at least for me) perfect.I wanted the lightest computer I could have with a reasonably sized display (because my laptop is my only computer and I use it for both work and personal stuff). I needed something powerful enough to handle Adobe illustrator and some scientific imaging software (imageJ) which I need to use for work. I also wanted good battery life. I would have been happy with 8-9hrs. This laptop regularly breaks 10hrs and mostly I run out of juice long before the battery does. Some people may complain about the lack of a retina display. IMO retina is not quite ready for primetime. I am happy that ALL of my software (whether it is ancient and abandoned or new) works perfectly with my display as does all of the web. The screen is just fine if you've never seen retina on a computer (I have an iPad Air and a Nexus 7 2013 both with \"retina\" displays and I don't cringe when I use my computer).The only issue with this laptop is the price but, if you can get over paying for the 8gb of ram (you should) and the higher storage options, you'll be happy.I upgraded from the 2012 MBA and even though the only real upgrade was the battery life it was totally worth it!", "Date": "January 18, 2014"}, {"Title": "I love my Air!", "Author": "Car321", "ReviewID": "R3UH0YHB2B5DMK", "Overall": "5.0", "Content": "This is a fantastic little laptop. I have no regrets about purchasing it, and I will likely stick with MacBook Air as long as they keep making them!I use my computer as a casual user I guess - web surfing, Office/iWorks type stuff, photos, etc. I sometimes stream Netflix but not often. The Air is PERFECT for my use.- It is SO LIGHT. So light. I just can't believe how portable this computer is. I use a MacBook Pro for work, and the Pro feels like a huge brick compared to the Air. I do a lot of casual web surfing and work alike on the couch with the laptop on my lap, and the Air is just perfect for that. It's light, it's compact, and it doesn't get hot.- The battery, oh the battery! This machine has amazing battery life. I charge it every few days. Right now I am just doing web surfing and I have 83% left...which it says is 10 hours and 49 minutes. My brightness is at a little less than half, which is how I usually keep it, because I don't like high brightness and that really kills the battery life. Although even with the highest brightness, This Air would last several hours on one charge.- It turns on and off in a a second or two. When I press the power button the computer is on SO quickly, it's unreal. Gone are the days of waiting for various programs to boot up. The Air gives instant gratification.- It's silent. Truly. No matter how many hours I'm on it, I've never heard any noise out of this thing.I have the 128GB solid state drive. I was worried at first that this wouldn't be big enough, but didn't want to pay the rather large price difference for 256GB. Honestly, I've discovered 128 is just fine. I can't store every single thing I own on here, but we have an external hard drive for that. It's changed the way I use my laptop, but that is fine with me. But then, I am not a person who has some enormous music library or owns an expensive DSLR camera and spends lots of time working with huge, high res images. I am, as I said, a casual user. 4GB of RAM is also just fine for me.I wish I had owned this computer in college - it would have been so perfect for those days where my laptop had to travel around with me everywhere!Anyway, I completely love this computer, and I would recommend it to anyone who uses computers like I do. I realize that others may have needs that require more power. For the casual user like myself, it really doesn't get better than the MacBook Air.", "Date": "January 18, 2014"}, {"Title": "Outstanding", "Author": "Shelley Baxter", "ReviewID": "R15UDXET34T3NG", "Overall": "4.0", "Content": "Since I can remember, I've always wanted a MacBook whether it was the Pro and Air, I wasn't that bothered which.When I was given this present for Christmas, I was so happy that I'd got a MacBook, and again I wasn't really that bothered if it was the Pro or the Air.The one thing that I was a tad confused about was, that one minute my battery said I had 11 Hours left, and one the next minute it goes straight down to 9 Hours, but I seem to have figured out why that happens now!Also, if I close the lid and come back to it later without pressing 'Sleep' or 'Shut Down', it seems to take a while for me to be able to type in my password to come back onto my Computer, but again, I feel that I have sorted that out now also.So all in all, I think this is a great computer and i'm glad that I got it for Christmas from my parents, but I felt that some things could be improved but nothing that caused me to make a hassle over it.", "Date": "January 8, 2014"}, {"Title": "Great buy!", "Author": "Reagan Harper", "ReviewID": "RC2UFYI7G9QVW", "Overall": "5.0", "Content": "A near perfect laptop!!! This is so much better than any PC I have owned before... I don't know how I could ever leave Apple for a PC again.", "Date": "January 4, 2014"}, {"Title": "great product", "Author": "Ed", "ReviewID": "R3RYS8ND42WOJP", "Overall": "5.0", "Content": "All is great with Mac Air. Truly easy to use and setup.I would recommend to anyone.Amazon made every thing easy", "Date": "January 4, 2014"}, {"Title": "Worth buying!", "Author": "Tomapep", "ReviewID": "R387GYWF11TVRN", "Overall": "5.0", "Content": "This Mac book air arrived like the next day. It came well packaged. My husband uses this device for everything. It also came with a one year warranty. I highly recommend this device and seller.", "Date": "December 30, 2013"}, {"Title": "Great computer", "Author": "John W. Chan", "ReviewID": "R38MXVPLK7E2C8", "Overall": "4.0", "Content": "I bought this mac because my old Sony labtop that is around 5+ years old (window XP was the O/S to give you an idea) and heavy touching about 6-7 pounds with a extended battery. Therefor it made me start shopping around for a new labtop. Also the main job for my labtop is for school work, microsoft words, power point, presentations and etc. a work horse and i'm not a gamer. In one aspect some say its a bit over kill for my needs. What made me go with this mac and comparing to my old sony is the battery life 12 hours Vs. about 6-7 hours. Weight 3 pounds vs. 6-7 pounds. Carrying labtop along with books around campus is a lot of work.Coming from a mircosoft and in to mac it is a huge learning curve. I have used older mac O.S but this one is so different.The only thing that I don't like on a mac Vs. p.c is some of the adapter is standard on a p.c but you have to buy on a mac, which mean more money.", "Date": "December 22, 2013"}, {"Title": "Best laptop!", "Author": "Dr. Oceanfront \"Oceanfront\"", "ReviewID": "R157PZP8X0ABWJ", "Overall": "5.0", "Content": "I bought my Air at the Apple store, just so I feel comfortable working with my local folks for when I eventually have to go back in with an Apple issue ( I have lots of Apple items, so building relationships helps <g>).I love Amazon, but I just felt safer this way.The computer is a real dream and very aesthetically pleasing to the eyes.  This is my third MacBook Air.  For my use, I see no reason to go any heavier then 3 pounds, and a 256hard drive works for me.  If your a gamer, you have different requirements.  I just need it for work, with no heavy spread sheet usage.I find I have to carry the Air around a lot, and every pound I save on weight makes a difference.I would not hesitate to recommend this computer to anyone!", "Date": "December 21, 2013"}, {"Title": "Amazing machine", "Author": "Deryck Payne", "ReviewID": "RFS9737W2HFFU", "Overall": "5.0", "Content": "This machine is perfect for me. Its light, and has a stunning battery life. Start up time is very fast and I would recommend this laptop to anyone.", "Date": "December 20, 2013"}, {"Title": "Mac for the ages?", "Author": "Kenneth R White", "ReviewID": "R1UPE9WB7Y6RXZ", "Overall": "5.0", "Content": "I have been using Macs since 1985, the first one out. My new MacAir is amazing and maybe I can use 10% of its capacity. One CAVEAT and that is that non iOS devices are being programmed (often) in favor of iOS devices. Apple has to slow down a bit and get the billion plus details involved all lined up for seamless iCloud performance. It IS NOT seamless yet and the iOS devices have stolen some of the desktop user friendly fine points of the recent past, before the iOS frenzy engulfing us all.", "Date": "December 17, 2013"}, {"Title": "Not bad, Apple. Not bad.", "Author": "Sloan", "ReviewID": "R1WAQI8ELD6EFO", "Overall": "4.0", "Content": "Not typically a fan of Apple and their overpriced products, but I decided to purchase this to get familiar with the OSx and see why so many people hate it or love it. It's not bad for the price depending on what you use it for. I have a PC tower I built myself, an Alienware m17x, and now this. The Macbook Air is great for portable web surfing, document editing, etc. which is why I understand why a lot of college students own them. However, I dislike the fact that the operating system is so simple it pretty much thinks for you. Nonetheless, good little computer for what I use it for.", "Date": "November 16, 2013"}, {"Title": "Just like all the other Apple products we've bought..... great to use.", "Author": "David D.", "ReviewID": "R10ZAO033K77CJ", "Overall": "5.0", "Content": "Works well, fast and is easy to set-up and run.  Much more intuitive in what you want to do or where you want to go.", "Date": "November 6, 2013"}, {"Title": "Perfectly me.", "Author": "Amanda", "ReviewID": "R2YOQNV5DR3OTS", "Overall": "5.0", "Content": "I spent a lot of time looking for the perfect ultrabook... plus my older brother is a major computer guru so he was helping me out. I used to dislike macs and honestly I never thought that I would buy one... and yet here I am. I was tired of waiting for better processors so I decided to buy a mac because of all the positive reviews that I recieved when asking about them. I absolutely love my MacBook Air. It is extremely portable (really light and fantastic battery life), sleek, and stylish. The only problem with buying a mac.... is the cost.. But in all honesty... totally worth it!", "Date": "November 1, 2013"}, {"Title": "Love my Mac", "Author": "Kha N. Phan \"kha\"", "ReviewID": "R1T72B8E4RM9EX", "Overall": "5.0", "Content": "I went to windows for a few years and now I remember why I buy Macs.  My only regret is that I should have ordered it with 8G RAM instead of 4.  The Macbook Airs are not upgradeable.", "Date": "October 30, 2013"}, {"Title": "Ideal college student computer", "Author": "Michelle st george", "ReviewID": "R4CGPFQWPV1DQ", "Overall": "5.0", "Content": "Every college student has a shopping list, not only with books but of essentials to help them succeed. This list can vary from dorm necessities to simple pencils and paper,but one of the key objects in this list should be a reliable laptop.  The functions of  laptop for  college students are vital due to the technological dependency our society has now: researches are made online,everything must be typed and assignments are on the web . Picking a computer can get tricky due to the vast choices available in the market ;however knowing exactly the needs of a student can help. The Apple Macbook Air 13.3 inch can be an exceptional purchase  for all college students who are looking for the foolproof laptop.  There are many components needed to be able to categorize a laptop as foolproof, instead of just simply helpful or ordinary . One of them including remarkable features and reliant performance. The Macbook Air 13.3 inch comes with many programs a student can benefit from such as: Safari, Office Suite and iCloud. Having iCloud can be favorable since this program allows you to store and share data between other apple devices, as well as syncing to do list and notes from one device to another. This laptop comes with password assistant assuring your documents are safe and HD graphics making everything on this computer clearer and more enjoyable to look at.Macbook Air's features expand from a 128GB storage to a 12 hour battery life, reassuring you that there will be enough storage for all important paperwork and enough battery to take notes in a classroom per say. Aside from these unique features the Macbook Air 13.3 inch is well known for its ultra thin exterior and professional look.  The difference between a laptop and a desktop is that a laptop's purpose is to be adequate  for people on the go. A college student would greatly fall under this category. The Macbook Air 13.3 inches, as in the name is 13 inches in screen, weighs about 2.38 pounds and is .68 inches thin. Compared to other devices this laptop is very easy and accessible to carry around. As a student books and heavy backpacks are enough of the weight, having a light backpack is always a pro.  Having the top of the line, best quality isn't always easy. As everything, this laptop has its cons. A Macbook can range from $999-$1299. Even though the price is eerie and can scare customers off there is reasoning behind the price. The Macbook Air includes a one year warranty that can cover anything that goes wrong with the computer. For example, if a speaker stops working you have the chance of getting a whole new laptop. Another reason for the high price is that its made by a worldwide known company: Apple inc.Lastly,the Macbook Air will be a one time money's worth purchase due to how durable the laptops tend to be due to the aluminum body design.  An enduring and  dependable laptop has to have many characteristics and programs to do its job completely. Due to the lifestyle of a college student,the expectations of a laptop can be very high. Even though the price can expand a student's' budget the purchase can be worth carrying out if the pros of the computer are noticed. The Macbook Air 13.3 inch is a reliable laptop that every college student should consider buying", "Date": "October 15, 2013"}, {"Title": "Thinking about buying another", "Author": "Carey Hull", "ReviewID": "R1UD52TITV45Q", "Overall": "5.0", "Content": "Just bought this for my boyfriend- It's the perfect size, very light, very easy to use, and battery lasts a long time and doesn't heat up. I now want one for myself!", "Date": "October 14, 2013"}, {"Title": "Portable and perfect!", "Author": "T. J. Perkins", "ReviewID": "RX47NHPDMFEYY", "Overall": "5.0", "Content": "First off, I am techno-impaired and won't be dazzling folks with tech-speak. What I will say is that the size is perfect. In fact, I bought a 13\" Macbook Air and exchanged it for this. The size is perfect. Picture clarity and colors are incredible. It is so easy to carry and so light. The battery life is unbelievable. I got eight hours the first time I used it. Finally, best of all, it is lightning fast. I sold my MacBook Pro, just a year old, to my son, so it's not like I had a dinosaur. But, there is virtually no time difference when I click on a link. (Except when I'm in a motel, like now, where everything is in slow motion). FYI, the keyboard screen and the palm guard are exceptional.", "Date": "October 10, 2013"}, {"Title": "My first Mac, my first love", "Author": "D. Mengistie", "ReviewID": "R2W22VCFFOUCZ0", "Overall": "5.0", "Content": "Speed, Mobility, & BatteryIt boot up quick (less than 10 seconds) and it is very light. The battery life is amazingly long. I love it. This is my first mac. I've been using PC for the past 17 years, I will never buy another PC again!", "Date": "September 2, 2013"}, {"Title": "MacBook Air", "Author": "Terry Haldiman", "ReviewID": "R34R8PJQ94NVC3", "Overall": "5.0", "Content": "Awesone computer!! Light to handle and easy to take anywhere. A very fast processor. I like the lite keyboard.  Battery life is great.", "Date": "August 29, 2013"}, {"Title": "Best laptop I have ever owned!", "Author": "xman", "ReviewID": "R3KNNMRJ5PD03Z", "Overall": "5.0", "Content": "Words cannot describe how impressed I am with this laptop.  I purchased this as a secondary / mobile solution to compliment my custom built Windows 7 desktop, and this laptop is amazing.  A little expensive for a secondary computer but I'm willing to pay the Apple premium for the quality I receive in this product.  Everything from the screen, keyboard, trackpad is amazing.  The keyboard and trackpad is just a pure pleasure to use and makes navigation and typing a breeze.  The portability is amazing, its a true featherweight.. I have a speck case around it and I just put it in a sleeve and I am good to go.  I never have to take the charger with me because this thing literally gets 10+hours doing typical web browsing / internet and well over 6 hours of video playback.. I cannot run this battery down if I tried, it literally takes all day.. its that ridiculous - in a good way.i5 haswell processor with a SSD gives it more then enough performance then I need as well.I love windows and its still my favorite operating system, but as far as laptops go, Apple kills it.  Windows does okay here, but until they are able to make windows laptops with a keyboard and trackpad that can match Apples, they will always take second place here.If anyone is worried about the wifi problem that is apparently floating around.. I have not had any issues with mine, its been rock solid from the day I purchased it.  I seriously cannot find a flaw in this laptop, any I would find would just be pointless nitpicking.", "Date": "August 27, 2013"}, {"Title": "Excellent Product", "Author": "Daniel Ginsberg", "ReviewID": "RPJ0BU6RBQM02", "Overall": "5.0", "Content": "It is so light and compact and yet so powerful.Just one little thing has been bothering me and is that in some places (Panera Bread) the MacBook air has not been able to connect to the wi-fi. I researched it online and found out that there is a problem with this computer and the wi-fi. Hopefully Apple fix it soon", "Date": "August 21, 2013"}, {"Title": "Great product", "Author": "sun_shines", "ReviewID": "R1XCWC5WQ2RBAI", "Overall": "5.0", "Content": "My first apple product. Usually what held me back was the price. I could easily find computers with similar specs for hundreds cheaper. However, the macbook air has a great design, weighs less than 3 lbs, and has an incredibly loooong battery life. Totally worth the extra cost.", "Date": "August 20, 2013"}, {"Title": "pint sized powerhouse", "Author": "K. Strand", "ReviewID": "RLKHCUXMWTXF3", "Overall": "5.0", "Content": "This computer is small and light, essential for a road warrior like me. It slips into my bag or pack like an extra file rather than a laptop. It is fully functional and nicely handles all my \"heavy\" apps, such as those I use from the Adobe Creative Suite, Microsoft Office, etc. The resolution on the small screen is very good and during most work sessions feels as spacious as my 13\" mac pro.  The battery life is terrific; that was a major selling point for me. Amazon price and delivery were excellent. This is the first time I've purchased an Apple computer through Amazon but I will certainly consider doing so again.", "Date": "August 18, 2013"}, {"Title": "This is an amazing laptop!", "Author": "Hannah Wood", "ReviewID": "R1BTIOGABIWXX2", "Overall": "5.0", "Content": "I was a staunch PC devotee for a long time. I've had two HP laptops. The older one, I actually have no complaints with, it just got old. The newer one was a little slow and glitchy. I got an iPhone and loved it. Then I paid several visits to the Apple Store over a period of months and decided on the MacBook Air 13 inch. (I'm a writer and student, so I mainly use word processing, but I also watch a lot of TV, so I wanted a laptop with a fast processor where video would look good). I have no complaints so far. It's beautiful, the screen is amazingly clear and who wouldn't like 12 hours of battery life? Anyway, I would recommend it. I'm sad to leave HP, but honestly, I like this computer so much better than any PC that would have Windows 8.", "Date": "August 18, 2013"}, {"Title": "Best laptop I've ever owned", "Author": "Ohio Guy", "ReviewID": "R2PPHUAF7GNJPO", "Overall": "5.0", "Content": "I've been hoping my old Dell laptop would die and FINALLY the hard drive crashed so I had my excuse to get what I've been wanting for years - my own MBA.  I love it!  I abhor trackpads on Windows machine so I bought the smart mouse with it.  Well, other than checking to see if it worked, haven't used the mouse since.  The smart trackpad is incredible,  Lightweight, it's not much heavier than my iPad but does a heck of a lot more.  I wish it had the battery life of the newest version but a few hours still isn't all that bad for a laptop.  I'd rate this ten stars if I could.", "Date": "July 19, 2013"}, {"Title": "Bootcamp is currently not working", "Author": "N.Yorker", "ReviewID": "RY0XF75LOGLC5", "Overall": "4.0", "Content": "If you need to work under Windows 7, stay clear until apple fixes out all the bugs. Other than that, this Macbook Air 2013 is the best laptop currently out in 2013. Battery life is running at 12-13 hours and is unmatched by any other company. The screen resolution is more than enough for the 13 inch size, and the trackpad is also the best currently in the market.Once bootcamp works, I'll increase the rating to 5 stars.", "Date": "July 19, 2013"}, {"Title": "tops in my 2 fav laptops all time", "Author": "Kent Magnuson \"kmjinx\"", "ReviewID": "R1FDEA1LM1415H", "Overall": "5.0", "Content": "My fav traveler, and I get a newest version each time the changes come out. Had the 13 inch for a week, as the 11 inch was not avail yet. Also a great traveler and #2 fav of mine. I still prefer the 11 inch for the road warrior. Ease of packing, slim/trim profile...nothing better.", "Date": "July 16, 2013"}, {"Title": "Excellent product.", "Author": "Ray", "ReviewID": "R1JOWXZTLG2T46", "Overall": "5.0", "Content": "The laptop performed as advertised and has very good battery life. Very pleased with the purchase and a well built machine.", "Date": "July 15, 2013"}, {"Title": "More than expected", "Author": "scott f katherman", "ReviewID": "R3EBMRD5XB0MMD", "Overall": "5.0", "Content": "My transition to Mac has been smooth, and the 11.6\" MacBook Air has just added to my Apple-ness joy!  I thought I might be upset with going with the smaller display, but that is now history.  For those who travel much and want as little space for your gadgetry as possible, choose the 11.6\" and you won't be sorry.  I thought I might be missing out by not having the Retina display, but unless you are a serious gamer or graphic design developer, this laptop will be more than sufficient.  I might have gotten the greater memory model, but for my purposes this device will take me through until my upgrade purchase (say, 2 years) without any grief.  And the transaction through Amazon was, well...as it always is with Amazon: flawless.", "Date": "July 14, 2013"}, {"Title": "Great upgrade!", "Author": "FC", "ReviewID": "R1VSORL84FMM26", "Overall": "5.0", "Content": "Definitely a huge improvement in battery life and performance from previous models.  Much lighter than the Macbook Pro and just as powerful.", "Date": "July 9, 2013"}, {"Title": "Impressed!", "Author": "Luiz Felipe Silva", "ReviewID": "R38VX3MPD4F3DX", "Overall": "5.0", "Content": "I never thought it would be possible to use a computer for so long away from a power plug, this new air did it. I used it for more than 9 hours without charging!My use profile was just browsing the web, but anyway, I've never seen something like this. Amazing!", "Date": "July 7, 2013"}, {"Title": "First Time Mac User", "Author": "Marcia", "ReviewID": "RQLCX4D6LL2O6", "Overall": "5.0", "Content": "I am loving my new MacBook Air.  I have always owned PC's and after using an iPhone and an iPad, I decided to try an Apple computer when my HP started giving out.  The first MacBook arrived promptly and right from the beginning I had problems with it.  I couldn't get it to recognize my wireless printer and also couldn't get it to send mail.  I called the Apple support line and after a 2 1/2 hour session, the technician felt it was a defective computer as nothing seemed to fix the problems.  Amazon sent me a new computer which arrived within 2 days of contacting them.  I returned the defective computer and have had no issues with the new one.  The only thing I'm missing is the screen being bigger.  I love how light weight it is and the battery life is incredible.  I'm still learning to operate it but getting better all the time.", "Date": "April 8, 2014"}, {"Title": "Mavericks+Flash Storage+New Haswell Chip= FAST FAST Smooth Running Laptop", "Author": "Mark Pcola", "ReviewID": "R1N9MXK9U6UMQX", "Overall": "5.0", "Content": "I was pleasantly surprised how fast this computer runs. Its faster then my Mac Pro Desktop with 32 GB of Memory. The reason this MacBook Air is so fast is because the Solid State Drive HHD & Haswell Chip this technology makes this thing FAST. I have the MacBook Air all MAX Specs i7, 500GB Hard Drive, 8GB Memory. I chose this MacBook Air over the MacBook Pro because the all day battery life and YES this thing will stay on all day no problem I never seen this laptop die on me. Battery life is a lot more then I can ask for. The sleek design is the future of Apples laptop the MacBook Pro will be redesigned to look like the Air. It is such a pleasure to own this laptop. The look of this laptop is so much better looking then the Air and unless you are running multiple high level programs at the same time you can't tell the difference between a Air or Pro. The Air definitely blows any older MacBook Pro out of the water with the NEW HASWEL Technology. I build websites use high memory running programs like Adobe Photoshop, Dreamweaver, I write code on Python IDLE Shell. I use Xcode to build Apps. I use Final Cut Pro for youtube commercials. I do Internet Marketing and this Computer runs all my high lever programs like butter. I have a Mac Pro Desktop it doesn't have the new Haswell or Mavericks but it has 32 GB of Memory and Has a Regular 500GB Hard Drive and I use my MacBook Air for everything I was surprised how fast it runs. Don't let the specs fool you with the Haswell Technology this computer is SICK. I think this laptop is underpriced I think it should be more. I been using Apple since 1995 My first Apple was the Performa 6320 which let you watch cable TV on your computer. I remember my mom bought it for me and it was over $3k. I have been a Apple user since I was a child. I learned how to build websites on one at the age of 12.  Remember owned a Apple computer please don't waste your money on a windows computer. You never been on a computer unless you used a Apple Operating System. Windows is pure garbage. I wouldn't use a windows computer if you  paid me. I think the BBB should not allow Microsoft to sell Windows OS other programs they make are good. But windows should be illegal to distribute fact being it is worthless garbage. That being said the MacBook Air is the perfect computer for a person buying a Apple computer for the 1st time or a professional computer programer. It is very safe to buy the MacBook Air because it will be around for a very long time this design is the future of laptops. Enjoy this wonderful computer.", "Date": "December 18, 2013"}, {"Title": "Lightning fast, even compared to Macbook Pro, does not heat up!", "Author": "Zana711", "ReviewID": "R2UKB82ZJG0XS1", "Overall": "5.0", "Content": "Bought this through Amazon Warehouse Deals - while it was described as \"used - very good\", when it arrived, it looked brand new and in all original pristine packaging. I was a little hesitant at first in buying electronics through Amazon Warehouse Deals but at close to a $100 discount, I thought I'd give it a try. The MacBook Air itself is lightning fast, even compared to my 2012 MacBook Pro, probably courtesy of the SSD drive and it can re-boot in 15-20 seconds once it's been upgraded to OS X Mavericks. Keyboard is not as light as the Macbook Pro and harder to type but I've been using it for a few days now and getting used to it. The best improvement I got, compared to the Macbook Pro is that the Air doesn't heat up. My Macbook Pro heats up after a few hours, to the point, where it is impossible to use it as a \"laptop\" as it literally burns your lap! The Air doesn't seem to heat up at all and very comfortable to use even after a couple of hours of straight usage. Highly recommended, as it even fits into my handbag!", "Date": "December 10, 2013"}, {"Title": "One improvement left... Add a Retina Display", "Author": "Tim", "ReviewID": "R34ASYV146E484", "Overall": "5.0", "Content": "This is by far the best laptop on the market at the moment. The only thing that could make it better would be a higher resolution display (such as the Retina display) but I'm sure that would lessen the 12+ hour battery life. And yes, the battery does last over the 12 hours stated. I went an entire day at school using my MacBook Air from about 7:30 am to around 6:00 pm, practically on my laptop the entire time for those nearly 11 hours. I had to use Adobe Connect video conferencing, which is a battery killer and on my old computer would be below 20% with a full charge after my Adobe Connect session of about 1.5 hours. On this powerful machine, its always at about 80% to 70%. Occasionally lower, but rarely. On that day, I believe I made it home with over 20% charge left and a time remaining of 2.5 hours. Another thing about the battery to note, I got it down to 3% before and got a 30 minute estimate. 30 minutes! With 3% left. Sheesh. I have regularly went days with heavy internet browsing for 6-8 hours and had 50-60% battery remaining. It takes two days to kill the battery apparently!Enough about the battery. If you are switching to Mac from Windows (or contemplating it), just stop reading all these reviews and buy the darn thing! 4 gigabytes RAM has been plenty for me: someone who regularly has 5-6 safari windows open, all filled with 5-10 tabs. Yes, I know, thats horrible of me. But, it still runs blazing fast. Even running apps that take up high cpu, it will still run fast thanks to Apple's implementation of App Nap.The keyboard is amazing. Its very nice, easy to use, and obviously high quality as it should be. The trackpad though, is where half your thousand plus dollars are going (not true, but... the trackpad is amazing). The trackpad is responsive like it should be, and literally everything can be done with gestures. One/two/three/four finger motions in different ways allow you to go forward/back a page in Safari/Chrome/etc. w/o having to click a back button. It makes even the easiest things, well, easier! There's also the option of having multiple desktops, so no more switching between windows in one cluttered space. Your able to have say, in my case, 5 desktops open. And use each for a specific thing. Say desktop 1 for school work, 2 for work, 3 for social networking and news, 4 for movies, videos, pictures, etc., and 5 for the miscellaneous stuff like shopping. That way you can have full screen windows without having to share a space between so much stuff. And you can leave all you stuff open on say desktop 1 when working on a project for school w/o having to minimize it and do the four-finger gesture to the right to begin working on documents for your job, or move over to your Facebook on desktop 3. You get the picture, multitasking is easily done and very efficient on this machine. Also, you get the iWork Suite for free, Apple's versions of Word, PowerPoint, and Excel (dubbed Pages, Keynote, and Numbers). Thats well over $100 savings from Microsoft. If you only need Word and the others for the basic you should be good with Apple's versions. Just a note though if you do use them, I'd advise to save them in Word formats by going under 'Export' to... as someone with Windows won't be able to open it up even though you sent it as \"Windows Friendly.\" If you depend on Microsofts stuff though, just get it and be done with it.There are two small glitches I have been having and others have been as well (Google \"MacBook Air 2013 slow wifi\" or \"MacBook Air 2013 kernel task\" for proof). The first of the two is the most annoying. It has to do with select routers so it may not affect you. It only happens when I am at home. Randomly, the internet will work at a crawling pace. It only does it once in a while (like few hours) and for a minute or so. Never has it happened at school or elsewhere.The second is simply where kernel_task takes up 100% cpu for no reason, drains your battery rapidly and bogs down your Mac. It requires a restart. But the thing is, a restart takes 20-ish seconds. No joke. If you can't wait that long for a restart every couple days when this occurs to fix it while we wait for Apple's fix, I don't know what to suggest. Start up from being completely shut down is about 12 seconds. It takes about the same to shut off for me, only because I have so many windows open though that it must close. And they re-open automatically upon restarting as if they were never closed.One final note, the 128 gigabytes of Flash is plenty for most. If you won't be saving videos like crazy, only pictures and such, you'll be fine. I've downloaded tons of stuff and still have 90 gigabytes left. I only had about 100~ straight out of the box though. So yeah, its plenty for the average person.", "Date": "December 9, 2013"}, {"Title": "Apple excellence again!", "Author": "Richard Marshall", "ReviewID": "R1D16Z49OWFH4H", "Overall": "5.0", "Content": "Excellent laptop with the design and features I would expect from an Apple product.  13\" screen is all you need in a laptop and the weight and small profile of the MacBook Air make it easy to take it anywhere!  I am thrilled.", "Date": "December 7, 2013"}, {"Title": "Macbook air review", "Author": "john zuijderhoff", "ReviewID": "R2PXZN26XUOBLF", "Overall": "4.0", "Content": "like the apple macbook air a lot since it is small, light and very convenient in use.I find it easier than the ipad since I find it easier to use when working and the extra weight is more than worth it.", "Date": "November 22, 2013"}, {"Title": "I love it", "Author": "William Sherman", "ReviewID": "R1QDWGKCZ4XBPU", "Overall": "5.0", "Content": "i made the switch from PCs to a 27\" iMac it was way easier than i thought it would be learning a new OS and all i fell in love with just how easy Apple made everything but a 27\" iMac is not exactly portable so I bought the new Macbook Air to use when I travel again i love it it just works", "Date": "November 13, 2013"}, {"Title": "Exactly as billed", "Author": "Ronn Berrol", "ReviewID": "R2XEUC4GREVIEZ", "Overall": "5.0", "Content": "I decided to order from Amazon as the shipping is always superior and saved us a trip to the Apple store, which is always a headache.  The item is exactly what we ordered.  Works perfectly out of the box.  No having to deal with \"geniuses' at the Apple Store.Is light weight, good battery life, nice resolution.", "Date": "November 10, 2013"}, {"Title": "My son loves his MackBook.", "Author": "Marlene63", "ReviewID": "R2PPPGHP83MI4V", "Overall": "5.0", "Content": "I bought this for my son for school.  It is super fast and very attractive.I also bought myself a sony vaio using windows 8,  I am so sorry I did not get a Mac.", "Date": "November 6, 2013"}, {"Title": "Wow..my first Mac..Blows Windows away..Never seen anything like this...", "Author": "Jeep Stanley \"Stanley\"", "ReviewID": "R26N891GCZ35VE", "Overall": "5.0", "Content": "For the last 15 years, I  had multiple desktops and laptops. Most recent an $800 Asus i7 with 8GB Ram. So many issues, crappy sound card, screen burns, hard drive failure, sent back couple of times for repair, all in one year. Just got fed up and read the reviews on Apple products on Amazon . Didn't understand what everyone was raving and getting so emotionally attached about.. Convinced by the reviews, I ordered my first Apple product. I am blown away. My Mac has an i5 and it blows away my i7 on the Asus. The i7 is probably slow due to heavy bloatware. The screen clarity is unbelievable. Crisp, sharp and processor speed is unreal. MacBook has back light keyboard , another awesome feature. The download is really fast. No plastic bezel or plastic casing. Aluminum casing and it looks sharp and so beautiful. I am shocked at how well this machine is designed and built. I work as an engineer. I pay a lot of attention to detail , especially when it comes to form and function. Windows coupled with HP/DELL/ASUS are like circus clowns compared to this fine machine. I cannot believe all these years I missed out on such great product. Well built, really really fast, great audio, great video,  aesthetically pleasing...Great job..Time for me to sell all my other Windows run machines and buy Apples. This is it...", "Date": "October 23, 2013"}, {"Title": "Best ultra in 2013", "Author": "Wajih", "ReviewID": "R39XQ9G6IHSKY6", "Overall": "4.0", "Content": "I buy this laptop because of the all reviews i see before but you can't believe them until u try it,So i will put my review as features and disadvantageFeatures1) thinest and lightest laptop2) battery life up to 12 hrs with normal work will be 8 hrs with wifi and watching videos3) the speed in installing and transferring unbelievable it is take just 1-2 minutes to install office or big games like Xcome also it is transfer 50gb from and to hdd in minutes4) the keyboard and trackpad very good for working5) it will not be warm until you play big game like borderlands 2 and not that much warm so always you will not hear the fan workingDisadvantage1) wifi issue - wifi always disconnect even after update because the wifi need new modem with 802.11.ac dual band or you need modem near to you without pressure on it2) the screen is nice because it is thin but i think it's need more resolution than 1440*900Finally it is amazing laptop and it is good choice even for users more than normal which need to make some clips and photoshop workI need to mention that i use 1.3 i5 8gb ram 256 sdd", "Date": "August 31, 2013"}, {"Title": "So Happy!", "Author": "John Monahan", "ReviewID": "R4MQ1PILUJ6QB", "Overall": "5.0", "Content": "This is my first Macbook. I'm an IT person so I use a laptop every day for work. I usually get a new Windows laptop every 18 months. So most of my review will come from that experience.I bought the 13 inch version of this MBA with 4GB memory and the 128GB SSD for personal use. I travel a lot for work so I wanted something small so I could take both my personal and work laptop on business trips. Others in my family have the Macbook Pro. I went with the Air mainly for the portability, thin size, and weight of the Air. But the long battery life is what really sold me in the end. As far as choosing between the Air and Pro:- Everything is wireless now so I didn't need the physical network connection.- I bought a USB 3.0 hub to get additional USB ports.- I also go an external HDD for backups and movies, plus I got an external DVD writer.The SSD disk drive is really nice. New programs install in a matter of seconds. I have found everything quick and snappy, in general. Much better than my Windows 7 Lenovo.Other than the excellent battery, I think my most favorite thing is how cool this thing runs. My work Lenovo runs hot and I need a laptop pad to keep from sweating. Even with the pad, that thing still gets me hot when sitting with my feet up and the laptop in the lap. This new Air is hardly even warm. I always use it without the pad and have no issues. It really is a night and day difference.This is just a nice and sleek machine all the way around. I'm happy with everything. Performance, look, and feel. The only single thing I wish was better on this machine is the screen resolution. My other laptop has this one beat in that area.", "Date": "August 4, 2013"}, {"Title": "Mac-brick Air freezing constantly", "Author": "Balázs Zoltán", "ReviewID": "R3FD8F1D0CTRT8", "Overall": "2.0", "Content": "I bought this Macbook Air to my girlfriend. This is her first Apple product. It looks great, and it feels great to use it. She basically loves it. But she also hates it when it freezes. And it freezes a lot. In the first week, it freezed 5 times ! And when it freezes, you can't do basically anything, but hard reboot the system, and all of your unsaved works are lost.Apple know about this issue for months, and yet no solution at all. Just google for \"macbook air screen goes black\" or join the facebook group with the same name.This is really sad. Buying a premium quality machine, which freezes more than Win95 on a chinese hardware :( Disappointing...", "Date": "January 23, 2014"}, {"Title": "It's late 2013, and I just switched to a Macbook air from a PC.  I am not planning to go back.", "Author": "Amazon Customer", "ReviewID": "R2RUZMAWZGLU27", "Overall": "5.0", "Content": "When Apple makes the best, fastest PC on the market (i.e. running Windows via Bootcamp), there is no other choice but to buy a Mac.  This is coming from a lifelong PC power-user.  No more noisy fans, no more whirring, slow disk drives.  No more idiotic bloatware gumming up the circuits.  It's late 2013, and I just switched to a Macbook air.  I am not planning to go back.", "Date": "November 23, 2013"}, {"Title": "Plagued by Problems", "Author": "Rin \"yaoifix.com\"", "ReviewID": "R3834211DLOI4T", "Overall": "2.0", "Content": "This is my 3rd Apple and sadly, each new one I buy has more problems than the previous. It feels like Apple is riding on it's reputation at this point. The pro with this machine is of course its portability, and its SSD is nice and quick. On the downside, mine has been horribly unreliable. I had to bring this laptop into support a few months after buying it. The issue was so bad they had to wipe the entire computer and re-uploading from my time machine didn't work, so I had to add everything manually. I've had chronic problems with it ever since, but each time I take it in, they put a bandaid on the issue and run the software and hardware tests- never finding anything, and yet things KEEP going wrong. And this is a NEW machine, not refurbished. Apple doesn't seem to care that there are chronic problems, as long as the immediate ones are fixed. Which basically means that as soon as my support package runs out, I'm going to be left with a very unreliable machine that will need expensive repairs or an entire replacement after just a couple years. Maybe that's ok for people who have money to burn. I'm not one of those people. I need a reliable machine that doesn't require me spending hours on the phone with support or leaving my laptop for days at a time in the Apple store. Frankly, unless you are a dyer Apple fan and are married to the Apple OS, I would look to a good PC- especially considering most of them have touch screens and there's not a single Apple computer that does. Believe me, I've used Macs for over a decade and I used to love them. The quality just isn't there these days- at least not in my experience, You take your chances.", "Date": "October 25, 2013"}, {"Title": "It's almost as good as in my dreams", "Author": "Phoj", "ReviewID": "R3NRFHNYT6EY5W", "Overall": "4.0", "Content": "The BATTERY!It's not quite 12 hours but it's got lots of stamina that puts many men to shame in bed. I seem to get around 8 through basic uses such as web browsing or typing on Pages. I do a little light gaming but nothing big.After that the mac is a sleek, thin, and speedy computer. That kind of makes it sound like a race car, but it is in fact a laptop computer... not a race car.  It would be cool if it transformed into a car though.I can't say I do anything to push this thing to it's limits such as any 3d imaging or current gen high end gaming on it, so I can't comment on any of that crap.  For what I do though it is very fluid. pages load, menus transition, and magic happens on my screen without any lag.  It's really quite nice. Well.. in fact it's pretty close to great because its so light that I can hold it on my lap without it seeming like a oil filled space heater burning my skin.I do honestly have to say I am impressed with this laptop. It defines mobility and power like advertised.  Sure it's not an alienware or a fully upgraded macbook pro, but it does have a lot of power under it's petite frame. Of course boobs would help, but it's not a human girl so i'm cool with that.I completely recommend this hunk of aluminum.  It's sturdy, lasts most of the day, has a high quality look and replicates that in function as well.If you don't have a significant other in your life it'll fill in that empty space.  If you do, it'll drown out their nagging.", "Date": "August 19, 2013"}, {"Title": "Best laptop I have ever owned", "Author": "H. Jaynes", "ReviewID": "R3U0P19K22VUZ1", "Overall": "5.0", "Content": "Battery life is through the roof. If youre a techie nerd and see a fewer lower benchmarks, think about how much time you would actually spend ripping movies on a MBA. The PCIe drive is incredible.  The one thing i may suggest is heavily consider how much storage space you need. 11\" MBA actually has a higher pixel density than the 13\" at a higher resolution.  Although not a retina display, it's still great.  I've been using it on and off for a few hours now unplugged, and battery life is still @ 73%", "Date": "July 9, 2013"}, {"Title": "Super Fast", "Author": "Olli Bliss", "ReviewID": "RLD1ACO50QENF", "Overall": "5.0", "Content": "Lightning fast and much faster than my 2011 MBP 15\". Screen is small but I bought this as an alternative to buying a tablet - suits my needs for photo editing etc much better than an iPad. Battery life is great.", "Date": "June 28, 2013"}, {"Title": "Decent laptop with minor issues", "Author": "bobbypins", "ReviewID": "R318856UHWNIXK", "Overall": "4.0", "Content": "Purchased this laptop at an Apple Store, after my mid-2011 Macbook Air was stolen. It was still in excellent condition, and I simply wanted an equivalent replacement.I'm a software developer, and this laptop met all my needs just as well as the 2011 model. The battery lasted a full day of travel (& travel delays), with intermittent use from 4am to 10pm.There appears to be a bug with the audio on this laptop, and I'm not sure if it's hardware or some sort of firmware issue. The volume of the built-in speakers fluctuated quite a bit while listenting to music and watching video. I'm not the only one with this bug ([...]), and it's pretty annoying. I'm planning to return the laptop and get a 2012 model.If you're totally gung-ho for the 2013 model, I recommend waiting until Apple resolves the audio issue.", "Date": "June 25, 2013"}, {"Title": "Save your money. Known issue. Apple knows and not doing anything", "Author": "dipak pokhrel", "ReviewID": "R1CFI77TA8XI9C", "Overall": "1.0", "Content": "Bought it brand new from best buy and having this issue of computer going to sleep and requiring a force shut down to bring it back.I have lost hours of my valuable work because of this issue. I hate it.Look at the videos.Black Screen Of Death (BSOD)[...][...][...][...]This is ridiculous. Apple knows this issue and isn't doing anything to fix. Its been more than 3 months since I reported it to apple and no solution yet. I can't get my money back not get it replaced.", "Date": "January 24, 2014"}, {"Title": "What a technologic marval", "Author": "D. Ng", "ReviewID": "R2L2QDU2M4YVUU", "Overall": "5.0", "Content": "I am a software engineer-a big nerd. I bought this MBA directly from Apple via special order. I have the top of the line 1.7G i7, 500G SSD and 8G RAM! :) This configuration might be over kill for most consumer use but hey, I know I will regret it 6 months down the road if I  don't max it out as MBA has zero user upgrade path.The battery life is amazing, I work on it 10 hours on one charge! And it's amazingly FAST and amazingly LIGHT!!! So much computing power in such a small package! Size really doesn't matter in this case. :}As an iOS/OSX engineer, I installed the Mavericks OSX 10.9 DP3, it works small wonder! I looooooooooooooooove it!! :))))))))Even if you are not a nerd like me, get the lesser configuration, I assure you will love it as much as I do. :)", "Date": "July 15, 2013"}, {"Title": "Incredible Lightweight Laptop", "Author": "J.Smith", "ReviewID": "R3JG7A0UP3UD4P", "Overall": "5.0", "Content": "I am a long time PC Windows user, and this is the first time purchasing a Mac.  I bought this laptop to replace my aging Asus U6 laptop running Windows Vista.  I decided on the Macbook Air because I also own an iPhone and iPad, and wanted to own a Mac notebook to complement my i-devices, and fully move over to the Mac ecosystem.  I'm going to review the MacBook Air in several aspects and then provide an overall review.Build Quality: 10/10. Extremely well built, and doesn't feel flimsy at all despite the thin and light design.  Coming from a Asus laptop that was 4.6lbs, this one feels light as a feather.  There are essentially changes to the build design compared to the 2011 and 2012 models.  The one physical feature that is different are the dual stereo mics versus the single mic, which noticeably improved background noise cancelling during calls, and helps improve the accuracy of the dictation feature.Power: 8/10. The 2013 Macbook Air packs the latest Haswell processors from Intel which promises improved graphics and better power management (more details in battery life review). This is the perfect laptop I've wanted for everyday use. If you are looking for video editing intense gaming, I believe the MacBook Pro would be more suitable.  For everyday use such as web browsing, Office computing and video chatting, the Air is great.Battery Life: 10/10.  This is the key feature that convinced me to finally upgrade my existing laptop.  The new MacBook Air boasts up to 9 hours of battery life, up from 5 hours in the 2012 models.  After using the MacBook Air for a day, it has certainly delivered on the promise!  My old Asus laptop only lasted 2 hours at max, so I am definitely very happy about the longer battery life.Screen: 8/10.  With the release of the Retina MacBook Pros, I can't rate this a solid 10/10, even though to me the screen looks perfectly fine.  The viewing angles are incredible.  I find myself having to adjust the lid much more infrequently compared to my old Asus laptop.Sound: 8/10. When the volume is maxed, I felt that the sound was adequate.  A cool design feature is that the speakers are actually underneath the keyboard, yet the speakers are still very impressively loud and clear sounding.Expansion: 4/10. Both RAM and hard drive are not user replaceable.  Make sure you choose the desired configuration for the RAM and SSD at the time of purchase!  My rationale for choosing the 4GB RAM and 128GB configuration is that 4GB is sufficient for everyday usage (not video editing or intense gaming), and I will be using the MacBook Air at home most of the time, so my external hard drive is readily available.Overall: 10/10.  Despite scores that were lower than 10 in some of the individual components, overall I feel that the MacBook Air is the perfect everyday device, and there is no other notebook that better suits my needs.  In terms of build design, battery life, portability, this notebook delivers.  The transition from PC to Mac may be a bit tough in the beginning (day one as of this review) but I am looking forward to learning all about the Mac!", "Date": "June 13, 2013"}, {"Title": "unreliable: failed after only three months", "Author": "Vladimir", "ReviewID": "R1JTBEOXRW3V7Q", "Overall": "1.0", "Content": "Latest software and all patches and here we are -- started to shut off unexpectedly (first in Skype), more and more frequently to the point of being unusable. Will be repaired under warranty (we'll see...), but still, this apple was rotten.", "Date": "December 4, 2013"}, {"Title": "Black Screen Bug", "Author": "edp285", "ReviewID": "R3M3ZNMGE0JRH5", "Overall": "3.0", "Content": "I wanted to post this because I haven't noticed it on Amazon, and I think it's a growing problem that still hasn't been explicitly addressed by Apple.It's happened about 5 times now: I open up the Air and shortly after the screen goes black. I then have to re-awaken it by typing a key. In my case it's happened when operating on battery at lower than 30%. I just purchased it about a week ago from Best Buy, so I'm trying to decide whether I should take it back and avoid the potentially worse problems that could arise in the future, or keep it, and assume that the issue will be fixed.There's already a lengthy thread on it here: [...]And you can see it happen spontaneously in a review on YouTube (when being compared to the Leonovo 11s) here @ 17:29:[...]Anyways, I'm giving the product a temporary score of 3/5 because, besides the very seldom black screen issue, it's still been the best laptop I've ever used. If the problem is resolved shortly, I'll update the score to a 5/5.", "Date": "August 7, 2013"}, {"Title": "Speakers buzzing", "Author": "Sandy", "ReviewID": "R5SEDN8C4WT1I", "Overall": "1.0", "Content": "Right Speaker was presenting buzzing sounds after only months of purchase. 30 min later after presenting the buzzing sounds on the right speaker, it stopped functioning.", "Date": "December 2, 2013"}, {"Title": "Battery life is as good as advertised", "Author": "JoshM5683", "ReviewID": "R3QSCLQ5TE660P", "Overall": "5.0", "Content": "Ok I've had the MacBook Pro Retina and the latest version of the Air.  This thing may not have the screen resolution of the Retina, but the battery lasts forever.  I got this fully charged and turned on at 2pm and spent the day installing Microsoft Office and various other programs and media from my other machines.  At 1030pm I was down to 54% battery.  Today I've been on it the last few hours and its still down to the 40s.The other features of the Macbook are good as expected but nothing ground breaking.  I wouldn't switch up if you have a model thats pretty current.  I can't tell a big difference in performance between this and my one from mid 2012 I got.  I just switched because I travel a lot and want the extra battery for flights.  The 13\" model is definitely noticeably heavier than the 11\" was, but nothing too crazy.  Overall great machine and I can't begin to express how amazing the battery is on this thing.", "Date": "June 17, 2013"}, {"Title": "What's up with apple lately?", "Author": "Meghan Lewis", "ReviewID": "R902ZBJSMLINP", "Overall": "3.0", "Content": "I've only had this for a month and have already had several chats and Skype calls with Apple support because it's been freezing and shutting down frequently. Also, randomly I've been unable to use Skype or gchat because my camera and or microphone will be hard frozen and I have had to shut the computer down and start over, which only sometimes works.I've had my old mac book for almost 6 years and it's still working and even now it does not have as many problems as the new macbook air. The apple support team has been helpful but it seems that the quality of mac products is really going down :(Also, you have to keep up with constant updates but then things become incompatible with other people or other machines. I'm usually really excited when I have a new apple product but this one is making me nervous.", "Date": "January 15, 2014"}, {"Title": "Windows Convert", "Author": "Pamela J. Graham", "ReviewID": "R34TRFSR1BWO3A", "Overall": "5.0", "Content": "I am a die hard Windows user and really did not understand all the Apple 'fanatics'...at all!  On a whim, I decided to purchase the MBA 13.3\" screen and although it took me a couple of hours in watching YouTube videos on how to navigate the Mac operating system, I have grown to LOVE this unit.  The build quality is great and like everyone else is saying, it is terribly difficult to drain the battery on this unit.  On my prior Windows laptops (ASUS, Lenovo, Dell, etc.), I would be lucky (LUCKY) to get 4 hours.  With light browsing and watching Netflix/Amazon, this unit has run the full 12 hours!  WOW!  Honestly, I told myself that I would learn to code for ios and thusly justified this purchase but I've done everything but that.  On a side note, I did have to get the Windows Office package since I am familiar wtih it.If you're a Windows user and on the fence of purchasing a MacBook Air, I say go for it!", "Date": "December 12, 2013"}, {"Title": "Leaves little to be desired", "Author": "J. Finkel \"Jack of Trades\"", "ReviewID": "R3QM8SU5NKD5XT", "Overall": "5.0", "Content": "The 2013 Macbook Air updates the 2012 model with an upgrade to the new 4th generation Intel i5-4250u Haswell processor.  This processor is faster, much more efficient and offers a significant boost in graphics performance thanks to the HD 5000 integrated gpu.  While a faster i7 is available for a reasonable upgrade price, for most users there won't be much of a difference.  Coupled with the SSD, everything runs amazingly smooth and snappy.  Also, the i7 has the same HD 5000 gpu, so games won't see much benefit.  While this isn't a gaming computer, most modern games (not new FPS's) run well at low to medium settings at the screen's maximum 1440 x 900 resolution.  There are only 4gb of RAM, but that should be more than enough for the average person (you can upgrade to 8gb, but it is soldered on, so no post-market upgrading).This laptop is easy to fall in love with.  At around 3 lbs and 0.68\" thick, it is extremely portable and comfortable.  Despite the lack of weight and thickness, it feels durable and does not flex easily.  The aluminum body is sleek and luxurious.  The screen is only 1440 x 900, but it looks wonderful (unless it's put directly next to a retina macbook pro) and while it is glossy, reflections  are not a problem.  While I still prefer my mechanical keyboard and mouse on my desktop, the Macbook Air's keyboard and especially the trackpad are easily among the most responsive and comfortable of any laptop.  The wireless always keeps a strong signal from any room in the house and the battery life is exceptional at 10-12 hours.Overall, we have been extremely happy with our new 2013 Macbook Air.  I feel like most other laptops have at least one or two annoying issues (and that's not including the bloatware).  So far, we haven't had any disappointments with this laptop.", "Date": "August 7, 2013"}, {"Title": "Best Laptop Ever!!!!! Worth every penny!!!!", "Author": "R. Maharaj", "ReviewID": "RLDUZAZEEQ33H", "Overall": "5.0", "Content": "Finally converted from PC to MAC. Best decision ever. If you have the cash don't waste money or time on anything else. This thing is worth ever cent you spend. best build quality. Feels well engineered and built to a very high standard. No regrets so far.The best computer I have ever owned......", "Date": "April 24, 2014"}, {"Title": "Love it", "Author": "ckohio", "ReviewID": "R3A7AZR4FURZTN", "Overall": "5.0", "Content": "I use it daily in college. I bought the mini-display->vga adapter and I can use my TV as a screen for the laptop. I love the battery life and I am very happy with my purchase. I haven't needed the CD drive yet, and I have had it since october of 2013. If i need a CD drive in the future, I can buy an external one for $15.", "Date": "February 28, 2014"}, {"Title": "excellent computer", "Author": "superpickle", "ReviewID": "R3MKXF6NC8OYLZ", "Overall": "5.0", "Content": "This small laptop is exactly what I need for my daily activities of emailing, banking, organizing photos and small games.  Love it.", "Date": "January 13, 2014"}, {"Title": "Outstanding", "Author": "Master Chief", "ReviewID": "RCAR3PRFJNLNT", "Overall": "5.0", "Content": "Purchased it for my wife. She wanted something small, lightweight, powerful, with the ability to use MS Office to write, & with a long battery life. It exceeded all criteria & she is enjoying its use.", "Date": "December 15, 2013"}, {"Title": "This thing is AMAZING", "Author": "Nick", "ReviewID": "R42LTAS8BCXFT", "Overall": "5.0", "Content": "I bought this in early July just a few weeks after it was released. I was coming from a budget HP clunker so anything in the Apple realm would be an enormous step up, but I couldn't decide between the MBP with retina, the cheaper \"regular\" MBP or the Air. I am a college student and I bought this with traveling in mind. Almost 6 months after I bought it, I can safely say this is one of the best consumer laptops you can buy, even if the new retina MBP has the same guts as this does.+ Battery lifeObviously one of the biggest selling points of this laptop. The battery is larger in this than in previous generations of the MBA, and with the Haswell processors and newly available Mavericks, my MBA easily surpasses the 12 hour mark under normal usage. I should also note that mine has a core i7, and that hasnt affected the battery life at all.+ SSD (256gb)I'm going even going to try to get technical with this, but this things drive is BLAZING fast. Like, up to 700 mb/sec fast. I transferred my entire 57gb music library from the MBA  to a USB 3.0 external drive in 90 seconds. The SSD is the reason why it boots up in 10 seconds, wakes from a cold start in 1 second, etc.+ Haswell cpu/Intel HD5000 gpuI am very impressed with the performance of this chipset. I haven't done much in the way of heavy gaming but it can handle Borderlands 2 without a hiccup. I have yet to tap the full potential of the i7, the only part of this entire system that causes any sort of lag at all (only when im gaming or filesharing) is the RAM (I would suggest you go with 8gb).+ Keyboard and trackpadThe keyboard on this is absolutely phenomenal. As if the keyboard on the previous MBP wasn't good enough, this one is better. The keys sit a tad lower, they have more give, and are more clackety than before. The backlighting is also brighter.Trackpad is the same sublime unit from previous Airs and MBP's. Nothing is different except the new assortment of gestures that come with Mountain Lion (or Mavericks now that it's released)+ OSXI hear people say all the time that OSX is a horrible OS for programming and gaming. Anytime you to get creative, there is something in the way. I personally have no need to program and I'm not a heavy gamer. But if I were, the Steam online store is there and growing everyday...OSX is powerful and refined, yes, but the best thing about it: seamless integration with other Apple peripherals. iCloud has made the functionality of this thing go through the roof. My ipad and Ipod touch are synced with icloud while my icloud is synced with my google cloud, so my android is integrated too!Aside from the standard complaints that Apple customers are entitled to (quality control and so on), this really one instance with Apple in which you get what you pay for. Mine was around $1500, which sounds like a lot. And it is. But compared to other ultrabooks which wear the same price tags, this is very clearly the most well refined and secure choice you can make. Apple has stuck to the winning formula and improved it year after year. For a traveler, this one is a no brainer.", "Date": "December 1, 2013"}, {"Title": "Almost perfect.", "Author": "Tuffy", "ReviewID": "RS1SDREUSLODH", "Overall": "4.0", "Content": "10 hour legitimate battery life lasts me 2 days.  That was the main selling point of this for me.  Being someone that likes to tinker, build their own computers, overclock, etc. I'm not really a fan of Apple's operating system.  That said, the hardware is magnificent.  This is the best laptop I've ever seen, and like I mentioned, 10 hours of battery life thanks to Intel's Haswell chip.  The flash storage is good, but my storage is half full, and I'm already starting to see signs of slowing.  Really, the only thing that irks me is when I'm watching a video on youtube and the audio will stutter.  This is probably from the 1.8GHz processor, but I really thought the core strength of an i5 would be able to power through that.Overall, this is great.  I love this machine, and I definitely recommend it", "Date": "November 19, 2013"}, {"Title": "My first Mac, Amazing", "Author": "Bryan I. Johnson", "ReviewID": "R2HE8LY5P4XSI7", "Overall": "5.0", "Content": "This is my first Apple Mac product, I love it so far.  The screen is beautiful and the speed of starting the laptop is like nothing I've ever had in the past.  The lighting of the keyboard is really nice, the keyboard is a little cramped for me but I have large hands.  I've only ever used Windows PCs so with the help of a friend, I'm learning Apple's operating system.  It has a learning curve but I can definitely see that it's going to be easier to use than Windows.  I used the Facetime and the clarity and speed was great.  I was really surprised by this, but surfing the internet was way faster on the MacBook than my IPad.  But my iPad is older.  The laptop design is sleek and it's light for the size of the computer.  The mousepad I'm still getting used to but some of the things you can do with it are pretty cool.  The laptop itself came with no instructions which is frustrating if you haven't used a Mac before but luckily I have a friend who knows EVERYTHING about Apple products.I am looking forward to setting up iTunes on the laptop so that I can sink my ipad and my ipod with one central device rather than my old PC.I don't know what else to say other than it's a great, solid feeling, fast laptop.", "Date": "September 10, 2013"}, {"Title": "Great for daily usage, but also for Djing!", "Author": "Erico", "ReviewID": "R257EUVK2THB3H", "Overall": "5.0", "Content": "This computer is just incredible!I bought it to work with some of my personal projects, being one of them djing. I am able to use this laptop with my jig connected through USB for hours. Yesterday I was able to play during 4 hours and still had 3 hours left. I was using a Numark mixer with Traktor consuming some of the battery.Besides that the boot-up is extremely quick due to the ssd as well as the usage of several different software.My advice is to buy the 256 hard drive version. It won't create any problem to you!Beware of the RAM memory usage, though!", "Date": "May 24, 2014"}, {"Title": "Macbook Air is convenient use", "Author": "markham Johnson", "ReviewID": "R1VL27WJKZ3TI2", "Overall": "4.0", "Content": "coming from a macbook pro i have to say that this is most convenient as it is light, thin and easy to carry. I initially bought it for my wife, then for us to share, now i don't want to give it to her. Money well spent. Works just as well for Adobe CS.My only issue is that if you don't have wifi connection it is almost of no use to you. That's my only issue.", "Date": "May 22, 2014"}, {"Title": "Cool Laptop", "Author": "Deepak A", "ReviewID": "RLZ3DLSZFQHZ7", "Overall": "5.0", "Content": "Nothing new to describe about Mac. Pioneer in Market, Just loved the product. The interface is pretty new as I am more of windows user, yet its just awesome.", "Date": "May 17, 2014"}, {"Title": "A brilliant device", "Author": "cfab", "ReviewID": "R1YCZZBNA3GHON", "Overall": "5.0", "Content": "This was for my daughter. She loves it as does her husband who created a great iMovie on it. Brilliant", "Date": "May 16, 2014"}, {"Title": "Very Happy With The Purchase", "Author": "Randy", "ReviewID": "R26PGSQB97BWUJ", "Overall": "5.0", "Content": "My daughter is going into her 5th year of college at OSU and requested that we upgrade her from the MacBook to the MacBook Air.  Physically, it's a very thin computer and has more \"cool\" features than the predecessors.  The bottom line is my daughter is really happy with the purchase and I would recommend it to you.", "Date": "May 13, 2014"}, {"Title": "MACBOOK AIR", "Author": "pat howell", "ReviewID": "R1FC0S3QVQU9CE", "Overall": "5.0", "Content": "I WANTED A MAC OF MY OWN AND A COUSIN CAME TO VISIT US WITH HIS MACBOOK AIR.  I FELL IN LOVE WITH IT RIGHT AWAY.  WE WILL BE TRAVELING A LOT AND THE SIZE AND WEIGHT ARE PERFECT FOR EASY MOBILITY, AND PACKING.  I WOULD RECOMMEND IT TO EVERYONE, IT DOES EVERYTHING I NEED TO DO VERY QUICKLY AND EASILY AND I AM NOT TECH SAVY AT ALL.  YOU LIST THIS AS THE \" OLD VERSION \"....WHAT IS THAT ?  I THOUGHT I WAS ORDERING THE NEWEST MAC AIR.", "Date": "May 13, 2014"}, {"Title": "good", "Author": "Terese Teganlakla", "ReviewID": "RZ2X9HE120RZQ", "Overall": "3.0", "Content": "It was alright not quite what I expected. But it works good for us:) I'd recommend this to someone who would like to be simple and easy.", "Date": "April 16, 2014"}, {"Title": "Everything I expected...", "Author": "Mike Goforth", "ReviewID": "R3QHAJNCXXMO80", "Overall": "5.0", "Content": "This macbook air is everything I expected in a compact sized computer.  Very fast performance and lightweight.  Love the machine.", "Date": "April 10, 2014"}, {"Title": "Excellent product.", "Author": "virginia", "ReviewID": "R1ZQLJUFX4K8U5", "Overall": "5.0", "Content": "Buy a Macbook air 3 weeks ago on the basis of 12 hour potential battery life, thin size and light weight and general trust in Apple products.", "Date": "March 31, 2014"}, {"Title": "love this computer", "Author": "Amy", "ReviewID": "RN13KJZ64Y4CF", "Overall": "5.0", "Content": "I'm in a nursing program right now and this computer serves the purpose due to the Light weight and the speed of the computer", "Date": "March 30, 2014"}, {"Title": "Nice Device", "Author": "D. Villanueva", "ReviewID": "R1C4IV0JOL4N9I", "Overall": "4.0", "Content": "After receiving it the set up went well, updates loaded and had to purchase the Microsoft Suite.  That had to be digitally uploaded as there is not CD on the airbook.  That was a strange part but the upload from Amazon was flawless.  The airbook use of screen minimization so you can move from application to application was a nice feature.  Overall, we are very pleased with it.  Oh, and yes, it is so light it is like holding an iPad.", "Date": "December 30, 2013"}, {"Title": "great!", "Author": "coatzzz", "ReviewID": "R2CQF7J3RCI9IC", "Overall": "5.0", "Content": "love this after switching from a pc. long overdue. so easy and lightweight and the shipping for this purchase was on time. I'm using it to write this review right now and so far iv never had any problems with it. one of the best decisions iv made so far!", "Date": "December 29, 2013"}, {"Title": "Nice laptop for college", "Author": "megan mcginnis", "ReviewID": "ROY65N7ZVY1NL", "Overall": "5.0", "Content": "i love it bc its light and awesome because it a mac from apple and they never fail at their products.", "Date": "December 24, 2013"}, {"Title": "awesome", "Author": "Land", "ReviewID": "R35DRT9ZVSAJHX", "Overall": "5.0", "Content": "Glad I made the switch. The fit and finish is nice and its a very powerful little laptop. love it", "Date": "December 23, 2013"}, {"Title": "If you can afford it - buy it", "Author": "alejandrolevy", "ReviewID": "R2MKRSKC4DD9CS", "Overall": "5.0", "Content": "The size the speed the quality the weight everything about this computer Iis amazing!  If you can afford it. Buy it!", "Date": "December 21, 2013"}, {"Title": "Fast long life battery BEAST!", "Author": "Zakatronics", "ReviewID": "R2D5MZDGI29QOD", "Overall": "5.0", "Content": "This is by far the lightest and fastest laptop I've used to date. I underestimated how long the battery life is as well. Apple really have outdone themselves with the Macbook AIr. I've put it to the test and have multitasked like a maniac, doesn't even bog down a bit.", "Date": "November 4, 2013"}, {"Title": "What you expect from apple", "Author": "Matthew T Olson", "ReviewID": "R4DKEC1CFNAV5", "Overall": "5.0", "Content": "Works out of the box. It's a lot lighter but feels sturdy.Not a computational power house - its good for basic computer uses.", "Date": "November 1, 2013"}, {"Title": "Road Warrior Heaven", "Author": "James Turley", "ReviewID": "R1SHITYQ15HZ09", "Overall": "5.0", "Content": "Immense battery life. SFO to BKK without a chargeSleek, small, thin, fast, elegant, smoothBeautiful displayBeyond LovelyWatch out! Everyone will want to take it", "Date": "November 1, 2013"}, {"Title": "The best Mac laptop for heavy travelers", "Author": "Miguel Danielson", "ReviewID": "RVBX7QAHDQYQC", "Overall": "5.0", "Content": "If you like to bring your laptop with you when you travel, or to meetings, etc., there simply is no better Mac than the Macbook Air.  It is by far the lightest laptop in the Mac lineup and it has significant amounts of processing power, graphics capabilities, and perhaps most importantly, battery life.  About the only reason I might go with a different Apple laptop would be if I needed greater processing power for video editing, gaming, or similar applications.  However, for virtually every other application, the Macbook Air is by far the best offering in terms of portability, ruggedness, and battery life.Would not hesitate to buy the next update of the MBA once it comes out.  Hopefully Apple will be adding Retina displays to these things soon, but until then, there's simply nothing better out there.", "Date": "October 30, 2013"}, {"Title": "wow", "Author": "Kyle Shell", "ReviewID": "R2IKFX3LGRWXUE", "Overall": "5.0", "Content": "My wife Loves it.  I have to admit that I am a little jealous, and would almost trade my nice MCP retina 15'' for it but she wouldn't ... thin, light, fast, .... I have to say now that the \"new\" 13\" MBP-r are out I would but them instead but I don't mind this .... for a great travel / coffee shop machine it is one of the BEST!", "Date": "October 25, 2013"}, {"Title": "The best around", "Author": "Auston LeRoy", "ReviewID": "R3V23THAT4DKG0", "Overall": "5.0", "Content": "Over the past year, I have been searching for the ultimate mobile computing powerhouse.  I have cycled through the Lenovo Yoga 13, the Microsoft Surface, the Lenovo Twist 11.5, and a Chromebook. Then I bought this MacBook Air, and nothing compares.  It is lighter, faster, more powerful.I now see why Apple is the most valuable brand, they don't disappoint.", "Date": "August 24, 2013"}, {"Title": "Another wonderful MacBook Air to the family collection", "Author": "dennys bisogno", "ReviewID": "R3CO74KVA9M3SK", "Overall": "5.0", "Content": "This is the third MacBook Air and being the mid-2013 version - The battery life is amazing, I no longer carry the power supply with me while I am around town", "Date": "August 24, 2013"}, {"Title": "Best Laptop in the World!", "Author": "Bobby S.", "ReviewID": "R1F0LWLYQBLNS8", "Overall": "5.0", "Content": "I love everything about it. It's quick... very quick. Use it mostly for work. I use a Mac Mini at home to edit my photos. I needed a laptop for work and I just could not bring myself to buy a PC. Beware.... Once you go \"Mac\".... You Never go back!", "Date": "August 23, 2013"}, {"Title": "Fast and light in weight", "Author": "J. Otlowski", "ReviewID": "R1B57CZ9A1JMQJ", "Overall": "5.0", "Content": "We have been using our new MacBook Air for a month now. It is so light weight. The battery carries a charge that lasts all day.", "Date": "August 22, 2013"}, {"Title": "Compliments form a Windows fan", "Author": "Roger Kitzmiller", "ReviewID": "R35YAUA1HAJ860", "Overall": "5.0", "Content": "I am a long-time PC user who also does Windows development, so I can't switch to Mac personally.  But, I bought this MacBook for my daughter, who is going into 10th grade.  This means, of course, that I get to play with it every now-and-then. I have to say that it's pretty awesome. If you don't need to be on Windows and don't mind spending the extra bucks, go for it.", "Date": "August 21, 2013"}, {"Title": "Not quite a mac... yet - was a PC", "Author": "Denise Vyse", "ReviewID": "R3666LQJZ8N2ZT", "Overall": "5.0", "Content": "So, I'm not quite a mac, yet - but I'm loving everything about this MacBook Air. It is taking me a while to get used to everything being reverse compared to my Sony vaio. I am forever scrolling in the wrong direction. There are still some simple tasks that I'm trying to figure out and I'm doing research on the best apps, so hopefully I'll \"be a mac\" soon.Things I adore compared to my other notebook: starts up and shuts down SUPER FAST. Is very lightweight! Syncing everything up with my iPhone and iPad. The battery life is phenomenal.", "Date": "August 20, 2013"}, {"Title": "has to be tried first", "Author": "Lady Serra", "ReviewID": "R2UF4B84U6FBQB", "Overall": "4.0", "Content": "but wonderful weight and practicalities for traveling!What a progress with the old Mac!we still have to play with it a little more.....", "Date": "August 19, 2013"}, {"Title": "macbook", "Author": "Joanne", "ReviewID": "R2YK4HWF943Z4P", "Overall": "5.0", "Content": "Amazing computer! I love it, I use this computer everyday, very good one battery life, and very portable, rarely ever overheats, definitely recommend the macbook air", "Date": "August 18, 2013"}, {"Title": "Love it!", "Author": "SacEagle", "ReviewID": "R2UKDQBRCRNCGU", "Overall": "5.0", "Content": "I moved from Windows to Mac because I did not like Windows 8.  It was such a right decision.  Mac Air is breeze to use and so light.  The touchpad is class apart and so is all other hardware.  I feel that it will last me 3 times longer than any Windows laptop without any issues.  I ordered it the day it was released and that one had wifi and volume issues and so I returned it back to Apple.  But Apple has fixed the issue with new software.  I bought this one in July 2013 at Bestbuy and no issues at all.  Wifi has never disconnected, it is super fast, and laptop is so easy to use.  Highly recommended!", "Date": "August 17, 2013"}, {"Title": "Exactly what I was looking for!", "Author": "Hassaan Shakeel", "ReviewID": "R36GMJ3UBVSO62", "Overall": "5.0", "Content": "I had been very excited for the new 4th gen Haswell processors, and I was ecstatic when the Macbook Air finally came out, with the new haswell. What surprised me the most was how this completely changed the battery life! The battery life is Amazing! first time I used it, i was literally only using it to see when it will finally die. The battery was decreasing so slowly I was amazed. I did not unpack the charger until the fourth day of using the laptop. (~12+ hours, on low settings)Overall, I love it. I have dual-booted it with windows, (256GB and 8GB RAM) and it works perfectly fine. I am very impressed. Any questions on bootcamp, holler.", "Date": "August 5, 2013"}, {"Title": "Air book", "Author": "Bart Howard", "ReviewID": "R3IZLVNT96158R", "Overall": "5.0", "Content": "We upgraded to the new Air Book so we were already sold on the Brand and device before we ordered. Prior to this we had tried out the Asus and Samsung Ultra books before returning them. Compared to them them Air book is far superior. Both of thos models had really bad touch pad problems and were almost impossible to use. Great service, Swift shipping and great customer service.  Can't be faulted.", "Date": "January 28, 2014"}, {"Title": "Apple is apple", "Author": "Maxim Podolskiy", "ReviewID": "R2KPVWOMQHTGKA", "Overall": "5.0", "Content": "I rate this as 5 star cause... i really don't know what to say, everything in this notebook placed where it should be, everything is needed and usable! Love it!", "Date": "January 22, 2014"}, {"Title": "MacBook Air with flash drive in 13 inch model", "Author": "Malcolm L. Mac Leod", "ReviewID": "RB79FBV7MBMRZ", "Overall": "5.0", "Content": "This puppy has flash drive instead of hard drive and is a complete joy in every way.It's a wise purchase.", "Date": "December 30, 2013"}, {"Title": "Excellent", "Author": "Lynne Noble-Danischevsky", "ReviewID": "R1ZDUBU5NHW3FJ", "Overall": "5.0", "Content": "Have used a MacBook Air for some years now and this is lovely being smaller and lighter, as we travel a lot a lighter version is ideal. Absolutely love it and would thoroughly recommend it to everyone....", "Date": "December 17, 2013"}, {"Title": "Nice Ultrabook", "Author": "Doc Ott", "ReviewID": "R1CC88B6NDTUIX", "Overall": "4.0", "Content": "Nice compact ultra book.  Design is awesome.  Battery life is awesome.  Love the SSD drive.  Love the fact that alot of the games I purchased through Steam give me a Mac copy also.  Don't plan on playing any 3D games on this at a good frame rate but 2d stuff plays great. Good to take on the road. Price is a little high for what you get, but this is an Apple product. Overall happy with my purchase.  This is my first Mac and it did not convert me over. But still enjoying it.", "Date": "December 16, 2013"}, {"Title": "So good", "Author": "denis_25", "ReviewID": "R6LC95GBRWF9X", "Overall": "5.0", "Content": "Amazing laptop !! Till now, no complains. All work well. The most important, it's very beautiful and easy to carry. I love it !", "Date": "November 24, 2013"}, {"Title": "Sierra Burtons Review", "Author": "sierra", "ReviewID": "RSTW0FH5H1VA2", "Overall": "5.0", "Content": "All apple products are usually amazing products they make many different things. Phones, Lap Tops, Computers, iPads, and iPods Even with a few glitches at times here and their all Apples products are reliable and durable.One amazing about the Mac is the light weight it has. Being a college student and always needing my lap top attached to my hip, I don not want a heavy 10 pound laptop. I want something durable and light that I can just throw into my backpack or purse and not notice the weight difference. With the light weight I can take is any where and everywhere and it barley takes up any space either.But one thing I love the most is the 12 hour battery life. I am able to do work all day long on the go and I don't have to worry about my battery life and loosing all my work I worked on. Being on the go and not always near a power source is hard when it comes to keeping things charged.A add on though for the Mac is the 2 usb sources instead of 1. Having 2 usb ports is such a life save when it comes to a college student or even just a person always on the go. I can charge my phone 24/7 while I put in a a usb to save and transfer all my school work.Having a Mac book pro is one of the most amazing things for being a college. I love having it with me to be able to always look things up. I can carry around a lap top with no problem at all. The mac is one of the most reliable lap tops yet, i would never ever trade it for anything else. My life is my lap top it is my savior at times. Apple is the way to go no doubt about it. It compares to nothing else what so ever.", "Date": "October 21, 2013"}, {"Title": "In general its GREAT!", "Author": "Jessica Mateus", "ReviewID": "R3MTLYFOFTO4XV", "Overall": "5.0", "Content": "Its perfect! I love tha fact that is not heavy at all! you could travel or take it to work and never notice it in you purse.The keyboard is great, the screen is nice, it's fast, impecable and with long durable battery charge, I have used it 3 days in a row for approximately 3-4 hours before charging it up.The only issue I have is that o bought the 128 GB hard drive and I had to buy a portable external one of 2 tb because when I'm getting close to the maximun mac storage my computer gets slow and even frezzes up.But in general is the best computer I have ever had! I love every single detail, And definately consider myself an apple fan! I would only change it for one macbook air with more storage capacity.", "Date": "October 13, 2013"}, {"Title": "First Mac", "Author": "ACS", "ReviewID": "R1WHZ6WDOT1FOH", "Overall": "5.0", "Content": "This is my first Mac and it's great.  I only wish that it had more storage and that the card read was deep enough to keep the a SD card from sticking out almost half way out.  I like to keep my SD card plugged in.", "Date": "October 10, 2013"}, {"Title": "YES", "Author": "Bnunn08", "ReviewID": "R3PB9MDWQQ3N7F", "Overall": "5.0", "Content": "I LOVE MY COMPUTER!! I saved $50 ordering it from Amazon, even though it was brand new and still comes with all the perks that buying through Apple does. The computer is super fast, ultra responsive, and while I though that 128GB wouldn't be enough, the innovative flash storage proved me wrong. I love the size, I have a 13.3\" pro and it's MASSIVE compared to my air. It's just super convenient.", "Date": "October 5, 2013"}, {"Title": "Near Perfect!", "Author": "Sean Raidley", "ReviewID": "R1KGERC90Z9Z36", "Overall": "5.0", "Content": "I say \"near perfect\" in my header only because I wish it had a Retina display. However, everything else is amazing! Plus, the screen isn't bad either--it's just not Retina. The battery is incredible. It's better than my iPhone's battery by far. I got the 11\" 128GB version and it's seriously perfect. I'm not  pack rat so I have 100GB left still. I have some pics and some stuff for school on here. Also iWork and Xcode. At the store I thought the 11\" was noticeable smaller and would take getting used to. But once you get used to it the screen doesn't feel small at all. It feels perfect. Not too big, not too small. Apple is amazing.", "Date": "September 26, 2013"}, {"Title": "You can never go wrong with Apple", "Author": "Naif", "ReviewID": "RELNFODPY5IVY", "Overall": "5.0", "Content": "I'm not a big fan of Apple's Mac OS. However, I love the hardware Apple produces. That is why I decided to buy this laptop and install Windows 8 on it. It's perfectly compatible and fairly simple to instal.", "Date": "September 24, 2013"}, {"Title": "Solid notebook, could have better screen", "Author": "Alberto Pena", "ReviewID": "RR6OY8UGCBT0X", "Overall": "5.0", "Content": "We bought this MBA because we needed to replace my wife's windows computer.  This is a little bit of a Windows rant but I figure it might be useful for people looking into a new PC/Laptop.The main reasons are as follows:1) I need full disk encryption.  I want to protect personal data in case the computer falls into the wrong hands . I believe this is something every laptop should have, possibly every desktop.  Otherwise if I lose my laptop, anyone can get all my family pictures, bank statements etc.  To have this feature with the previous (relatively new) computer I needed Windows 7 Ultimate or Windows 7 Professional. W7-Pro does not have it.  I had Windows 7 Pro.  So I upgraded to W8 Pro via employer provided license.  What a huge mistake.  Windows 8 is the worst operating system I have seen in many years.  Even early Linux was friendlier.  Ugly design, confusing , settings all over the place, split personality, etc.  Then I thought, well , my wife is really used to Windows, so I considered getting a Windows 7 Ultimate license.  Then I found that in order to have full disk encryption you need TPM module in your computer, or you need to boot from USB drive every time.  Mine doesn't have it.  I considered Tru-Crypt, but I will not install a software that I have no idea who writes it and very few smart people in the world are able to build from source.2) I want easy back-ups.  Time machine is really hard to beat in ease of use.  Plug in a USB drive, you're done.For some people the two above reasons might not be relevant, but for me they are.Back to the MBA 11\".What I like:-Solid build.  Aluminum.-Magsafe power connector.  Very easy to plug , unplug. Compact. \"Looks\" safe.  Haven't tried pulling it, but the MBA will probably fly .-USB3, but you can get this on most new laptops.-Thunderbolt is there, even though I use it as mini display port.-Camera is pretty good for what I use it (Skype etc)-It's very light and easy to carry.-I love the size.  Compared to my Macbook Pro 13\", it's much lighter and easier to carry.  If we are going to do serious work we need a bigger screen anyway, so no need to carry a 13\" around (more on the screen below)-Battery life is excellent.-Runs pretty cool, so far.-Mac OS has a consistent user interface (on par with W7, but much better than W8)-Airport Mirroring.  Mirror almost anything to the AppleTV if you have one.-Full easy-to-use full disk encryption (FileVault 2)-Instant on as you open the lid.-Time machine painless backups (and encrypted as well).-Bundled software (iPhoto, iMovie etc)-Cheap upgrades (OS X)-Backlit keyboard-Very secure OS.  Don't even need an antivirus if you use common sense.-No bloatware. Default install is clean, no propaganda slowing down or confusing you.-You can choose the language.-Only one OS.  No Starter vs Pro vs Ultimate nonsense.What I don't like:- The screen is OK but I think Apple could fit a slightly larger screen in the same space.  The metal frame around the screen is pretty thick.- Not a fan of shiny screens, prefer matte.- Kind of expensive.  For this price it could have at least longer warranty.Overall a great notebook.  I would give it a 4 1/2 but I can't , so I give it a 5", "Date": "August 25, 2013"}, {"Title": "Excellent product. I'm really happy.", "Author": "Luis", "ReviewID": "R106SXMAE7HQ72", "Overall": "5.0", "Content": "A product of excellent quality. I'm really fascinated by my new MacBook Air.Packaging excellent and easy.I recommend it.", "Date": "August 2, 2013"}, {"Title": "Fast, sleek, and powerful!", "Author": "Justin Glisan", "ReviewID": "R1FFCQLSUZK85N", "Overall": "5.0", "Content": "I've been looking to upgrade my old MacBook Pro and when the new MacBook Air came out, I purchased it as soon as possible! It's a great investment; fast, sleek, and very powerful. Not only is Apple known for their great design process, but also the quality of the materials used. Even though the MacBook Air is extremely light and has a thin profile, you can feel the heft and quality of workmanship. I can't imagine going back to the MacBook Pro!", "Date": "August 2, 2013"}, {"Title": "Such a beautiful piece of technology", "Author": "Nicholas Leung", "ReviewID": "R1A1I7PTUV7OLJ", "Overall": "5.0", "Content": "This is coming from a previous 2008 Macbook pro user. This macbook air is a work of art. Flawless design. The battery life is so good that it scares me. I have been using it for more than 12 hours and i still have 1.5 hours to go! I used time machine to reinstall my data and it was a breeze. Fantastic technology. Very portable and great battery life!", "Date": "July 31, 2013"}, {"Title": "New Apple MacBook Air", "Author": "Judy Hundley", "ReviewID": "R384B2VTBN5RHM", "Overall": "5.0", "Content": "Worried about leaving my PC but the Apple MacBook Air exceeds my expectations.It is close to my I-Phone in use so easy to learn.", "Date": "July 30, 2013"}, {"Title": "Perfect!!", "Author": "Weidong Jiang CEJAJ", "ReviewID": "R3IMWBM8QRLGZ0", "Overall": "5.0", "Content": "The laptop runs very quickly, and it is never very hot. It looks really nice. It is light enough and thin enough. The screen looks really amazing. The buttery is awesome, too!!All in all, I love this laptop, I love Apple.", "Date": "July 26, 2013"}, {"Title": "Love it!", "Author": "New Mac User", "ReviewID": "R12RPN48XPM3Y2", "Overall": "5.0", "Content": "I am a completely non-techie former PC user and never thought I would want a Mac. I thought the new system would be too hard of an adjustment. I tried buying 2 laptops that ran Windows 8- now that is hard to get used to! Returned both of those, got the Mac, learning what I can by trial and error and Googling the rest. Love it! Easy to use, beautiful, light and responsive. Only thing is- I am not getting nearly 12 hours of regular use (not streaming) and at half dim screen. I found a way to reset the battery online; will have to try that out. If the battery issue gets resolved, this laptop will be perfect for me.", "Date": "July 24, 2013"}, {"Title": "Love it!", "Author": "Reem Kharbat", "ReviewID": "RMQ1WR7NX8A49", "Overall": "5.0", "Content": "Simply loving it.. i received it in one day :) How cool is that! This laptop is just great, light, fast, simply apple :)", "Date": "July 24, 2013"}, {"Title": "never can go wrong with an apple product", "Author": "Mike Spears", "ReviewID": "R12GBG8MPBNE5V", "Overall": "5.0", "Content": "Bought this for our soon to be college bound son, and he loves it.He's gone through multiple dell and Toshiba laptops - but I doubt he'll outgrow this one.I love how you don't get viruses or bugs like MS products.", "Date": "January 10, 2014"}, {"Title": "Great buy.", "Author": "T. Liu \"1st time GPS\"", "ReviewID": "R2NZIBPAV1Z0R3", "Overall": "5.0", "Content": "It's small, light, and starts up quickly. Everything works and apple provides all the software upgrades for free. So no complaints here.", "Date": "December 6, 2013"}, {"Title": "Great Macbook Air!", "Author": "Tyler L.", "ReviewID": "R5VR3R66H8GDI", "Overall": "5.0", "Content": "This laptop is amazing for what you get. The computer itself is very quick and responsive and battery life can get up to 16 hours. Definitely recommend purchasing this!", "Date": "August 5, 2013"}, {"Title": "All as promised:)", "Author": "Sergey Buzhinsky", "ReviewID": "R3AUPHTQAB6B9S", "Overall": "4.0", "Content": "I bought this computer for working on-the-go. And it fits this purpose very well - very light and fast, with a great battery life. The only minus is that it's my first Mac, and it feels a kind of odd after Windows. I have to learn many basic things all over again.I definitely like how it loads in about 10 seconds. In addition, it looks and feels great - admiringly light and sleek.Overall impression is very good. It's is light, fast, beautiful and... slightly uncomfortable - like new classy shoes. And, alas, I'll have to install a copy of Windows to run software I need for work.", "Date": "August 4, 2013"}, {"Title": "Really nice battery life and graphics performance", "Author": "Ludwig", "ReviewID": "R3PT9XXAAC12F6", "Overall": "5.0", "Content": "I've been a mac user for a few years and constantly upgrade my macs, this macbook air compare with the previous version feels about the same regarding speed, but when i play games that required decants graphics i can see the difference since this model has a newer and better intel hd500 integrated graphics.Regarding BATTERY LIFE its the BEST than any other computer i tried, so if would compare this mac to my previous Macbook air or my previous  retina macbook pro 13 , i would rather choose this Macbook air.", "Date": "July 23, 2013"}, {"Title": "friend has this", "Author": "ruth handel", "ReviewID": "R28ZJXQZSYV554", "Overall": "5.0", "Content": "My friend has this mac and I always compare it to my chromebook and see who's is faster, since they don't really operate the same in the computer world we always end up in a fight.", "Date": "May 25, 2014"}, {"Title": "mac or windows", "Author": "Chin Kim", "ReviewID": "R1GSYEQT1M8711", "Overall": "3.0", "Content": "i like it but i had to get use to mac way and annoyed that i waited for the price to go down and of course it didn't ubtil after i purchased it", "Date": "May 23, 2014"}, {"Title": "Getting to know Apple", "Author": "Lasma", "ReviewID": "RXO8L61EQA6ZO", "Overall": "5.0", "Content": "This is my first Apple product and I am very pleased with it. Apple MacBook Air is fast, powerful and, not less important for a girl, it’s also well designed. I like it because it's light and makes my travelling easy.", "Date": "April 25, 2014"}, {"Title": "On time delivery", "Author": "Gerard J. Hughes", "ReviewID": "R3KUF3MJFK2NK5", "Overall": "5.0", "Content": "Was quite happy,item arrived right on schedule and in perfect condition.i would definitely recommend this to everyone  . Keep up the hood work.", "Date": "April 11, 2014"}, {"Title": "Would never ever go back to a pc!", "Author": "Megan Gutke", "ReviewID": "R75X833DAH1BF", "Overall": "5.0", "Content": "I absolutely love it!!!  I don't think you could pay me to go back to my other laptop!  Never ever!", "Date": "March 18, 2014"}, {"Title": "MacBook Air", "Author": "Olumighty", "ReviewID": "R3NOVDZBG7X42Z", "Overall": "4.0", "Content": "I found it to be exactly what I expected. Delivered safely, intact, & on time. I will not hesitate to recommend this product as well as the seller to any who might be interested", "Date": "August 5, 2013"}, {"Title": "MacBook Air gets it done", "Author": "William T. Morse", "ReviewID": "R17NPRF7FO1YKA", "Overall": "5.0", "Content": "This is what a laptop should be! Starts up super fast like an iPad but works and performs like a high performance laptop. It has an amazing long lasting battery...an all day working battery. I rarely turn the machine off because I can just shut the lid and when I need it, it is up and running before I can get the lid all the way open. My old Windows laptop had to be shutdown when not in use and it took foreeeeeever to startup. And all my other Apple products work together perfectly like one big happy, connected family. Do yourself a favor and buy this MacBook Air!", "Date": "July 31, 2013"}, {"Title": "very fast", "Author": "Tao", "ReviewID": "R186WJTB5DVI9P", "Overall": "5.0", "Content": "never imagine macbook air can be so fast, the wake up time is almost zero. the battery life is amazing. 256G Version should be 100 cheaper...", "Date": "July 1, 2013"}, {"Title": "Beware", "Author": "RMonst3r", "ReviewID": "R81VGN2P5EZHV", "Overall": "1.0", "Content": "There's a bug in Mavericks that causes the Macbook Air to freeze after the display times out.Apple is not acknowledging the problem.Search \"macbook air black screen\" to see what i'm talking about.Most likely this will happen to yours as well.I purchased this laptop from Amazon for my girlfriend and she is constantly experiencing the problem, very frustrating and totally unprofessional for Apple to not even acknowledge such a big problem.", "Date": "January 6, 2014"}, {"Title": "Very Poor Battery Life after just 2 months", "Author": "w.w", "ReviewID": "R1BOJ453QVFMJP", "Overall": "1.0", "Content": "This machine has been amazing except for the rapidly declining battery life.  When first purchased it was getting 11 hours of battery life and now, just a few months later, I can BARELY get 5-6 hours out of it.I understand the various factors that reduce battery life, including your usage, screen brightness, etc -- but to have my battery life cut in half is completely ridiculous.  I did a bit of searching online and it seems like this is a VERY common issue with this model.  There are posts all over the Apple forums but Apple refuses to acknowledge the issue.I would save my money until they come out with a fix.  There is no sense paying this much when you get half the battery they claim.", "Date": "February 11, 2014"}, {"Title": "Keeps on breaking", "Author": "Sean Thomas", "ReviewID": "R10V07VIKDYMYH", "Overall": "1.0", "Content": "Whatever you do, DO NOT BUY FROM HERE. I bought this Apple MacBook Air for my sweet wife, and it has broken 3 times already. First the logic board in the first week. A month later, a chip had gone corrupt.  Save your money, go to the apple store directly. Pay a few bucks more and get something from apple directly.  We had the option of returning it, but we decided to bring it to the apple store and try fixing it.  We just got our fixed mac book laptop from them again tonight, the chip has gone corrupt again.  What do the technicians say? Oh, always make sure to buy their apple care.  We've had the computer 2 months.", "Date": "April 25, 2014"}, {"Title": "My Mac air keeps freezing", "Author": "Nosa L Nwaonumah", "ReviewID": "R1W45TY6OLHA0M", "Overall": "1.0", "Content": "My mac air has been freezing for the past one month since I got this product. I really do not know why the heck it happens. Please help!", "Date": "April 14, 2014"}, {"Title": "I like it but.....", "Author": "DKB \"D.K.B.\"", "ReviewID": "RO0U5BLOSGWCI", "Overall": "3.0", "Content": "I am new to Mac and don't  have a lot of experience with them other then an Ipad2.  I am learning and I really like the ease of operation but I have one major complaint.  It drops internet connection constantly.  It doesn't seem to be the network as I have two other window based pc's and an iPad that doesn't lose connection, just this Macbook Air.  Multiple calls to Apple still hasn't corrected the problem.  A quick search of google will let you know that this problem has been ongoing for some time with a multitude of user suggestions that just don't work.  It is not a stable platform if you need a constant connection.", "Date": "March 25, 2014"}, {"Title": "Pretty solid so far.", "Author": "mark smith", "ReviewID": "RATG7YCHYDK4I", "Overall": "5.0", "Content": "This is truly a great machine with a beautiful sturdy design. This is my first Mac. I have owned it for more than 4 months now. It doesn't feel plastic like a PC. It's also much faster and more reliable than any PC I have ever used or owned. Battery life is incredibly long too. Price is high but definitely worth it. If you don't care much about a few extra pixels with the same base specs (4gb ram, 128gb flash memory) as this base MBA that will cost you $200 dollars more on the MBP Retina late 2013, than go with this MBA. The only problem I have encountered was this one time after waking it up from sleep it gave me a black screen in which I had to force a shut down to make it restart and go back to normal again. I hope Apple fixes this problem. Other than that this MBA is perfect for a college student like me.", "Date": "January 11, 2014"}, {"Title": "Macbook was fantastic", "Author": "Luis A.", "ReviewID": "RHT9AZ657SEAX", "Overall": "5.0", "Content": "I chose this rating because it boots fast, the OS environment is fast and seamless and even with 4GB of RAM it handles multi-tasking with ease. I love the portability and the keyboard which provides typing with ease.", "Date": "December 5, 2013"}, {"Title": "Hardware defect - audio input/output device broke 3 times", "Author": "EG", "ReviewID": "RMNVRZ73CIEZ", "Overall": "1.0", "Content": "Same hardware defect happened for 3 new laptops - audio input/output device no longer detected.- After 30 days, the audio broke.  Apple shipped me a new one.- After 7 days, the audio broke.  Apple shipped me a second new one.- After 1 hour, the audio broke.  With Apple support now - probably returning this.Root cause: I believe it is a hardware design problem.  My speakers (Arctic S111) are powered via USB.  Seems the speaker drains the voltage causing the nearby audio card to break.  That's my running theory.I DON'T recommend buying this laptop - unless you like to waste your time with support and geniuses who spend 5 seconds to verify it is a defect.", "Date": "July 31, 2013"}, {"Title": "DEFECTIVE", "Author": "Sarah Westby", "ReviewID": "R179ELSO0D9W9H", "Overall": "1.0", "Content": "I purchased the Macbook Air 11.6\" in July of 2013 and was very excited about it.  I was converting from a PC and loved the machine, at first.  About 7 months after I purchased the laptop the charger stopped working.  I took it inot the ApplE store at Grand Central in NYC, and they informed me that there was extensive corrosive damage to the logic board.  There was no cause for this to happen, and this extent of damage is iexplicable.  Apple informed me that I would have to pay over $750 to fix the machine, despite being covered under warranty.  I am very displeased with this product and considering switching back to a PC.SarahNew York, NY", "Date": "April 11, 2014"}, {"Title": "Disappointed", "Author": "M. Bast", "ReviewID": "R3VH9TXD6K996J", "Overall": "2.0", "Content": "I had a Macbook Pro and when I needed a new laptop, decided to switch to the Air. At first I loved it. It is a lot lighter and easier to store. But then reality struck. It is a wireless only laptop (meaning if wifi is down, you can't hook it up). It has no CD drive. I didn't think this would bother me because I don't use CD's BUT a lot of technology comes with CD's to install on your computer. It over heats A LOT quicker and A LOT hotter than the Pro. I am regretting not getting another Macbook Pro.", "Date": "April 23, 2014"}, {"Title": "I like the new MBA but…..", "Author": "Mickey", "ReviewID": "R3EUHAKLLGRX8C", "Overall": "3.0", "Content": "This is my second MBA, the first one I bought was in late 2010, but I still have one problem or expectation that this laptop haven't met yet, battery power, I couldn't get the promised 12 hours battery time, do I need to return it back, or should I consult Apple forums or do I have to do some kind of calibration ?please help :)", "Date": "December 17, 2013"}, {"Title": "Love this MacBook Air", "Author": "Gregory Y. Mishima \"Greg M\"", "ReviewID": "R2Z6DMIGMNXN7Y", "Overall": "5.0", "Content": "I took a chance and got this for my wife, she love's it! She said it has a long battery life.", "Date": "December 9, 2013"}, {"Title": "it's worth every 1$", "Author": "yousef", "ReviewID": "R1TJP5VCD0EFN6", "Overall": "5.0", "Content": "This laptop is a beast it's worth every 1$ i paid on , every 6 month to 9 months i by the newer vision and it's always surprising me with the factions ,,,,,,", "Date": "December 4, 2013"}, {"Title": "So happy!", "Author": "Oceans1419", "ReviewID": "R1ZF7PDTVLPBZL", "Overall": "5.0", "Content": "Had an old MacBook Air and after about 8 years, wine spillage and it being dropped multiple times, it gave out on me.  Bought this new 11in version and I am stoked.  Love the size and all new features.  You can't beat a MAC!", "Date": "August 13, 2013"}, {"Title": "It's great", "Author": "Xuan Qiu", "ReviewID": "RTVG0R9JJXC6O", "Overall": "5.0", "Content": "I love this Macbook Air MD760LL/A 13.3-inch laptop. It has excellent operation system. Moreover, the battery in this laptop is able to keep this laptop working for nearly twelve hours.", "Date": "August 10, 2013"}, {"Title": "envy since I use a pc", "Author": "William B. Lawsonj", "ReviewID": "R12CIIE7B36A66", "Overall": "5.0", "Content": "My wife loves it and she is a technophobe i started with apple products then shifted to PC;s because of my work.", "Date": "August 5, 2013"}, {"Title": "Not actually the newest version.", "Author": "Adrian Alejos", "ReviewID": "R2H04GSZ5TBP5H", "Overall": "1.0", "Content": "Wasn't the Newest version. Not sure if this was amazons fault or the company who actually had the product. Should be fixed for future buyers.", "Date": "January 2, 2014"}, {"Title": "Be cautious to buy laptops at Amazon!", "Author": "angel dolphin \"peptidepeptoid\"", "ReviewID": "R3NDR11ZUYQ2JK", "Overall": "2.0", "Content": "Amazon doesn't provide price match on Laptops.One and a half month after I bought this laptop at 1050, Bestbuy is selling it for 750!!As the return window expired a little bit, if I return the laptop, I have to pay 20% restocking fee and shipping.", "Date": "May 2, 2014"}, {"Title": "Wifi Kept dropping out", "Author": "J. West", "ReviewID": "R1HDFGT3PA3QTV", "Overall": "1.0", "Content": "Wanted to love it, but the WiFi kept dropping out.  I updated all the software, but no luck.  I returned it and opted for a different brand to avoid any further issues.", "Date": "November 27, 2013"}, {"Title": "Quality Control Issues: Lopsided Screen; Edited 7/13 w/ 2nd Update", "Author": "JP", "ReviewID": "R25MYAYBZJHW12", "Overall": "1.0", "Content": "My first Air (this exact machine) was purchased at an Apple store and replaced at an Apple store. The third was purchased from Amazon. I got three bad apples, and I think that about sums it up. I will try purchasing this machine in the next couple of years in hopes that I don't strike out again (I'm a sucker for a good product and I believe that Apple still can provide that).I imagine the issue I originally encountered, that I gave this product 1 star for, was simply a defect in manufacturing. I own an early 2011 MacBook Pro that I love. I am (was?) an avid Apple fan and I purchased the newest Air recently. I opened it up only to find that the screen was lopsided. The case seems to close with the left side coming down every so slightly sooner than the right, which makes the whole body of the computer lopsided. When the laptop is closed, you can see that one side is a fraction of a millimeter tighter than the other.As an academic and type-A person who spends a great deal of time on her machine, this is unacceptable. When I drop a grand on a piece of equipment, it had better be perfect. I didn't think Apple could disappoint, but it did. I (exchanged) this first computer and (opened) the next one in the store before leaving. Hopefully no one else encounters this problem and Amazon will allow your return if you do.Edit 6/25: The tech at the Apple store was incredulous at first, but when he saw the gap difference he willingly replaced it. My understanding is that I am not the only individual who encountered this. The replacement does not have the same issue; I now have an excellent computer to use for work and school and am pleased so far with how things are working. I'm not incredibly computer savvy, and this is the first Air I have owned, but for someone who needed something light, small, and fast, this fits the bill. Still annoyed (and very surprised) that the first go was a bust.Edit 7/13: The second computer, after a couple days of use, began to randomly go black. Nothing would be lost, nothing to indicate why this was happening. The screen would just go dark and I would have to wait five to ten seconds for it to turn back on and all would be like it was just before the screen went dark. Kind of like an old person nodding off while watching TV and then suddenly waking up. I did trouble shoot with Apple. No hot spots on, nothing amiss. I took it back to the store; they offered to replace it. Instead, I washed my hands of the new toy and decided to wait a while to see if this issue got resolved. I was so disappointed.Then, I saw the computer go on sale at amazon for the student discount price at apple, without tax, on the 10th of July. It felt too soon, but that was a great price. I had a nice chunk of change in points and gift cards with Amazon and thought- what the heck. I bought it again, thinking there was absolutely NO possible way I could experience an issue a THIRD time.Of course, the screen on this computer was lopsided as well, like the first one. Not as severe as the first computer, but bad enough that I sent it back to Amazon today.I give up, Apple. I want to love your newer products. I really, really do. But it seems like there are some serious quality control issues and bugs that need to be resolved, and I don't want to cope with those, despite my desire for a new computer (fortunately I don't necessarily need a new one right now). I hope my old pro will last me a couple more years. When it comes time to replace my pro, I'm not sure if I will look at Apple's products to replace it.", "Date": "June 24, 2013"}, {"Title": "Good", "Author": "ningda sun", "ReviewID": "R351XEFOCK6KUZ", "Overall": "5.0", "Content": "It is new and in perfect condition. But I don't like the screen of mac air. However,  it is not the seller's fault.Thank you for delivery so fast.", "Date": "November 17, 2013"}, {"Title": "WIFI to slow", "Author": "Dennis McPadden", "ReviewID": "R1QCKAGKA8J7TV", "Overall": "2.0", "Content": "WIFIThe internet browser is tooooooooooo slooooooowwwwwwwwwwww!!!! Tried to find a fix and Apple doesn't offer one. My ipad seems fine its just the MAC.", "Date": "November 5, 2013"}, {"Title": "Apple removed this post from their support boards", "Author": "CLS1970", "ReviewID": "R2N84AN2IDSW6Z", "Overall": "1.0", "Content": "Thanks for participating in Apple Support Communities.We removed your post Re: what is the normal battery life on the macbook air? because it contained rants or complaints that weren't constructive. We understand wanting to share experiences, but these forums are meant for technical questions that can be answered by the community.Here is my post which Apple doesn't appreciate because spreading the truth can hurt their sales.12 hours battery life for the Macbook Air? I'm lucky to get 3 hours with the brightness turned down to 4 out of 16 blocks, and running only one app - Pages.  Anyone who spends this kind of money expecting the long battery life that Apple promises is going to be disappointed. Apple won't replace my lemon with a new Air. They want me to ship it to an Apple store so the techs can scratch it all up and then return it to me with, more than likely, the same problem still existing.No more Apple products for me. Bought two of the original iPads in 2011 that Apple now refuses to support (no more updates for the older iPads so we now get crashes that cannot be avoided, not to mention software we want that requires the iPad 2 or later). How long is Apple going to last by ripping off customers? Do they really think the average person can afford to spend $500 to $800 on a new iPad every two years?I bought a new iMac the same time I bought the Air. How long will it last? My Dell PC lasted from January 2003 to March 2013 - TEN YEARS with no problems whatsoever. I don't expect my iMac to last even half that amount of time. My brother warned me not to buy Crapples. Now I'm paying for it.No wonder the Macbook Air is now $200 cheaper than what I paid for it. Plus now they're giving their software away to help boost sales - Pages, Numbers and Keynote - all of which I had to buy separately right before this updated version came out.January 31, 2014 at 6:18 PM EST: Apple deleted another one of my posts which only asked people how long their battery life is on a full charge on the Macbook Air.  Here's the email they sent me:Thanks for participating in Apple Support Communities.We removed your post Re: RE: battery life because it was nontechnical or off-topic. We understand wanting to share experiences, but these forums are meant for technical questions that can be answered by the community.Just found my deleted post.  Here it is:Re: My MacBook Air 2013: only 7 hours on batteryJan 31, 2014 11:53 AM (in response to SMfmDXB)\"7 hours - wow, you're lucky.  I get about 3 hours running only one program - Pages - with the brightness turned down to 4 bars out of 16. Can you please tell me what I can do to get 7 hours out of my battery on my new Macbook Air?\"", "Date": "January 31, 2014"}, {"Title": "Beware PC to Mac users", "Author": "Michael O", "ReviewID": "R3C7FXZC0AP3QZ", "Overall": "1.0", "Content": "A warning to those migrating from PC to Mac.  You're in for a ride.  First Mac Air had a faulty track pad.  Second one would not sync with printer in wifi.  Apple says we \"don't support wifi printing\"  Wish I'd known that.  Meanwhile, can't for the life of me figure out how to use pages or numbers.  In either, a small page shows a menu of all the apps on the machine.  Huh?  Tutorial buttons lead to an ad for the Mac 50th anniversary.  When I do find them, they are pablum and more propaganda for the saintly mac.  Not helpful.  'How to use applications' doesn't include either numbers or pages--who'd want to know about the word processor and the spreadsheet program?  The finder doesn't find templates-- or anything else I looked for-- although I saw them somewhere at some point. No idea how to get back there.  No delete key. I felt like I was in a netherland where my job was to figure out the mystery. Some people like that.  I was trying to write and print a doc.  I wouldn't dare transfer my data to such a system.  Customer service apologized--twice--and the store staff couldn't care less why I returned it or what was wrong.  Worst is I feel really stupid on about a dozen levels.  Because it's the highest rated laptop and everybody loves their Mac!", "Date": "January 25, 2014"}, {"Title": "complaint", "Author": "lucila", "ReviewID": "R3D4N6BD4D6L", "Overall": "1.0", "Content": "I have a lots of problems with this computer, it gets very warm and i have to put it off, because when this happens does not works.I am not able to go to a mac store because i am in Johnson vermont. I want to know what  can i do.Thank you", "Date": "November 27, 2013"}, {"Title": "OK, with some flaws.", "Author": "Amazon Customer", "ReviewID": "R3BIYHRKU3QM84", "Overall": "4.0", "Content": "I bought this for may wife.  Very nice laptop, but suffers from Apple's clunky operating system.  Other than that, great!", "Date": "August 27, 2013"}, {"Title": "A decent toy for checking email, not much more", "Author": "Kevin Grandon", "ReviewID": "RSPYC3L0I2RWY", "Overall": "2.0", "Content": "A nice and lightweight laptop for checking email on the couch, but unfortunately not much more than that.My biggest gripe with this is that there's two USB ports, but they both go to the same internal USB host controller. This means you can probably ever only hook up a single high-bandwidth device at any one time - as you're really getting one usb port with a hub instead of two ports.It's extremely disappointing and deceptive that they would do this, as almost any laptop I've seen with two USB ports has two USB host controllers. Also it seems no one at the apple store knows the details of these systems, and they don't have specs for these in-store.", "Date": "June 25, 2013"}, {"Title": "Apple macbook air", "Author": "R.L. Fuller", "ReviewID": "RR2ZFAM4ROVD4", "Overall": "3.0", "Content": "I ordered this computer for my wife to replace an old computer she has been using to read and send her e mails.She found the print to be too small to read comfortably and the measures necessary to enlarge quite inconvenient.We have returned the computer with the intention to order another from Amazon which will be easier for her to change fontsto a larger version.", "Date": "August 16, 2013"}, {"Title": "Apple's famed customer service, like their innovation, is a thing of the past.", "Author": "Kevin C.", "ReviewID": "R118NITQR16UM3", "Overall": "2.0", "Content": "The air book is a light weight fast and efficient computer.  It is very expensive and has not drastically changed in the past few years.  However,  all our other home computers are Apple.  Thus, in looking for a new one we felt this was the way to go.  Our initial reason for buying an Apple over a PC was the dreadful experiences we had with on line support for our PCs as opposed to the pleasant service we got dealing with a damaged iPod that belonged to our daughter.  The prices are the same on line or at the Apple store so we chose to purchase at the Apple store.  We have heard friends in the past few years complain that the Apple service had gone downhill, but had not experienced it.  Thus, for these reasons we decided to purchase the product.  This product Was supposed to come with a gift card, which the cashier was supposed to activate.  The only way that we found this out was when we went online to use it.  After speaking with both online support and the store, there was no dispute that the card was supposed to be activated.  Apple's high-tech solution: take the time from your day to travel to the store to have them do what they should have done in the first place.  This is hardly the old type of apple service.  Rather, it reflects a company that continues to live on its past reputation.  Thus, when considering a lightweight computer in the future, I'm going to consider products from Samsung and others that are trying to accomplish what apple is squandering.  I would suggest others do so also.", "Date": "September 15, 2013"}, {"Title": "turky leg", "Author": "Eddie ferger", "ReviewID": "R38ZUT7BKM3LM8", "Overall": "5.0", "Content": "i love all the gravy it gave me on cold nights with no heat for me to hit  in my arm pit", "Date": "August 11, 2013"}, {"Title": "WARNING - READ THIS BEFORE YOU BUY APPLE", "Author": "Frank Erfurth", "ReviewID": "R20GKR4BNP6D4J", "Overall": "2.0", "Content": "If you are purchasing an Apple computer for ease of use and a super user-friendly GUI, go ahead and push \"BUY IT NOW\".  But if you are migrating over to Apple to take advantage of the apparent bargains to be found in the professional software arena (Music Production, Video Production, Graphic Arts, etc.) I am issuing a warning that Apple is lying to you.  Apple has implemented an aberrant pricing policy that varies widely from the industry standard pricing policy for professional software.  Apple, in true corporate fashion, has made this change without warning or notice.  The new policy is NO PATH TO UPGRADE.  You heard me right.  If you pay professional software prices for a piece of Apple software, and two months later they release the new and improved package, you will be stuck paying full price for the upgrade.  Do you feel like you got a deal now?  You have now paid more for your software than if you had gone with the industry leading software package (PreSONUS, Adobe Premiere, CorelDraw, etc.) and next update, you will be well behind the pricing curve.  I do not have a problem with Apple software, but rather the sneaky way in which they implemented the pricing policy.  If you are buying Apple to take advantage of these apparent deals...save your money and stick with a PC.  You will pay more initially for your software, but within a year you will be saving money.", "Date": "September 5, 2013"}, {"Title": "Device is perfect but hard to resell.", "Author": "Alexander", "ReviewID": "R3TZKIWYSA1EFH", "Overall": "2.0", "Content": "Purchased the device for reselling. Bad idea! The design and the device itself are obsolete. I should have purchased new MBP Retinas.", "Date": "January 10, 2014"}, {"Title": "Useless over priced junk.", "Author": "Starbuck88", "ReviewID": "R2DDQ9HGKGUBLY", "Overall": "1.0", "Content": "Save your money, buy a better quality operating system from another brand, and get an OS that actually does something, unlike mac os, that is just good for itunes.", "Date": "December 17, 2013"}, {"Title": "Save yourself the $$ and buy a chromebook!!", "Author": "CameraGuy", "ReviewID": "R31E6GIUOIXAG6", "Overall": "2.0", "Content": "Don't waste your $$ on this macbook! I ended up sending mine back and getting the Acer chromebook!The chromebook is great for school, watching videos, playing games and surfing the web, what else do you need?", "Date": "January 31, 2014"}, {"Title": "refund", "Author": "david friedman", "ReviewID": "R2QQED8ZOL99LH", "Overall": "1.0", "Content": "Did not like this computer to all.  That's why I sent it back for a refund.  Was very much a disappointment for that kind of money!", "Date": "February 1, 2014"}, {"Title": "Underpowered DEFINITELY", "Author": "Skacoolio", "ReviewID": "RB9CN9V6P0139", "Overall": "2.0", "Content": "I have owned this MacBook Air since the day it had came out and to my surprise....it was just not powerful enough! Simple tasks such as copying files to the SSD would take 15 minutes on a 10gb file. That is clearly unacceptable. It does have great battery life though and an okay screen. It looks elegant and sleek. I just wish it would push my files and around faster. I think I am going to just stick with my Samsung Series 9 15 inch ultrabook because that is VERY fast compared to this. The Samsung with a 1.9ghz i7 compared to Apple's 1.7ghz i7 for some reason is so much faster. I would not really recommend this unless you are an extremely basic user. Well back to Apple it goes =/", "Date": "June 17, 2013"}, {"Title": "Purchased as a gift.", "Author": "Joe P", "ReviewID": "R25UCN58UDAYM3", "Overall": "3.0", "Content": "Purchased as a gift to be given at Christmas. Will provide more details after the holidays. I am very optimistic.", "Date": "November 13, 2013"}], "ProductInfo": {"Price": "$1,199.00", "Features": "Up to 9 Hours of Battery Life, OS X Mountain Lion\n1.3 GHz Dual-Core 4th-Gen Intel Core i5 Processor (Turbo Boost up to 2.6 GHz )\n11-Inch LED-backlit Display; 1366x768 Resolution; Intel HD Graphics 5000\n802.11ac Wi-Fi\n256 GB Flash Storage, 4 GB 1600 MHz LPDDR3 Memory", "Name": "Apple MacBook Air MD712LL/A 11.6-Inch Laptop (OLD VERSION)", "ImgURL": "http://ecx.images-amazon.com/images/I/51ZgUeZXkrL._SX300_.jpg", "ProductID": "B00746YMHA"}}