{"Reviews": [{"Title": "Wow this thing is amazing", "Author": "Ekallas", "ReviewID": "R15CZ4DOGICXE3", "Overall": "5.0", "Content": "So first I will say I am coming from a MacBook air 11' mid 2011 with 2GB ram and 64GB harddrive. This one I got has 4GB of ram and 128GB harddrive. I use this laptop mainly for browsing the internet and some programming. Now that you have a little background Ill give a quick review.From the get go this laptop is MUCH faster then my previous Macbook air. When you open the lid you are ready to go that second. On the old one I would have to wait a little for it to load and if I left chrome up and clicked on it right away then I would get the loading wheel. I havent seen this do it once. That could be because of the harddrive being so much faster.When I opened the box the laptop was already charged to 91% so im trying to kill it. Well I was on it ALL NIGHT last night and now its the morning and its only at 60%. That battery life is amazing and let me honest thats what we ask for in a laptop.If you are up in the air about this laptop(no pun intended). I would say give it a go. You could even buy it from the Apple store and if you dont like it just return it.If you are replacing an older Macbook air and have one thats because the mid 2012 then I would say get it but if you have the mid 2012 I dont know if I would suggest spending the money unless you really want battery. I hope this helps anyone trying to purchase this laptop.I am not an Apple fan boy. My desktop is a custom build Window machine so I know both worlds. Please if you have any questions just comment and I will be happy to try things for you or just answer questions.I am a Computer Engineer so im use to testing things so feel free to ask.(This is my first review)", "Date": "June 19, 2013"}, {"Title": "MBA Will Be Perfect Once It Gets Retina Display", "Author": "Mike B", "ReviewID": "R434HN9G6BT0B", "Overall": "5.0", "Content": "This might look like just a minor spec bump from last years model. However, the new MBA boasts all day battery life: 11 inch (9 hours) and 13 inch (12 hours). This is a big step up from the previous generation. This is due to a larger battery and more efficient processor. The upcoming OS X Mavericks is supposed to be even more energy efficient than Mountain Lion. The MBA is also faster due to the new processor and has a faster wifi connection. The solid state drive in this computer makes it much faster than a regular hard drive computer.This is a great computer overall. The screen is not as nice as the retina Macbook Pro, however it is not a deal breaker. The MBA is a lightweight, portable computer and the Retina screen is thicker, heavier, and more expensive. Once they manage to make a thin, lightweight Retina Display this computer might be perfect. You will probably not miss the disc drive on this computer because it is a featherweight without it and you can use an external disc drive if you have to or remotely access another computer with a disc drive.If you are debating between the 11 and 13 inch models, it depends on what you want to use it for. The extra screen space, SD card slot, and longer battery life for $100 more makes the 13 inch a worthy choice. However, some want a truly portable machine that can fit easily in a large purse or briefcase.If you are debating between this computer and an iPad with a bluetooth keyboard, consider the ease of use and functionality of the computer versus the portability and cost of an iPad. For students, it is nice to have a real keyboard and be able to easily create documents, spreadsheets, and powerpoints on an actual computer, but I see more and more students with iPads and a keyboard case getting by just fine.If you are debating between 128GB and 256GB (or custom order 512GB from Apple), consider cloud storage. Flickr now has 1 TB free photo storage with no size restrictions. Google Drive and Evernote are great for documents and you can always store your iTunes library on an external hard drive if you have a massive library.If you are debating between this and a Windows Ultrabook/ Google Chromebook, consider the operating system, reliability, customer service, and resale value. People love Apple products and you can resell the computer if you want to eventually upgrade. They hold their value pretty well. The operating system takes a little getting used to but it is a lot smoother than Windows and you will probably never want to switch back to the dark side. If you really need a Windows Program, you can run Windows on a Mac.", "Date": "June 12, 2013"}, {"Title": "Simply the awesomest one out there", "Author": "Jonathan Arnoux", "ReviewID": "R1NSENQ6BRBUR3", "Overall": "5.0", "Content": "I was shopping for a laptop for college and I was initially not considering buying a Mac by principle (anti-Apple-ism, price,...). However, I received many good arguments to buy the Macbook Air and was finally convinced because all the other laptops working under windows I was considering had problems of some sorts, as reviewed by many users. Therefore, I bought the Macbook Air with a 14-day trial. I thought I would bring it back but I never did and ever since it's been a love story.Even though you've probably already heard it all, here are overall the best things about the Macbook Air that makes it the best laptop out there (even with the new Macbook Pro):-Battery life is excellent and recovery is fast. There are several ways to make the battery last longer and some options in your settings.-It's SUPER light, which is a major plus for a college student if you need to bring it to class and around. After a few weeks working with it I was surprised how big and heavy other laptops seemed to me, you have no idea.-The design is very nice, but that's a somewhat subjective notion.-It really doesn't take long to get the hang of all the commands and you might discover some cool \"shortcuts\" by accident, like I did. The experience is just wonderful and if you need any help, there are just so many websites and blogs that can help you and have tutorials or problem solving for new-to-Mac users like me.-The operating system upgrades are free, unlike Windows'. The new OS X Mavericks is just amazing, it's slick, stylish, colourful and just so much adapted to a student's needs!-You can work on many screens, so multitasking is made easy.-If you're Windows-nostalgic, you have the possibility to install a parallel. Plus, the Office for Mac is mainly the same as the Windows one except there are maybe more templates and the designs are more aesthetically appealing. You can also install Google Chrome, Mozilla and other browsers, as you wish.-Internet-browsing is fast and you can zoom/unzoom pics just with your fingers and the trackpad.-The trackpad is life itself in the form of a technologic device: it just feels so smooth and you almost feel like you're the one moving the page like you would with a book or magazine.-The new OS X Mavericks gives you iBooks for free, and iMaps and you can add a map or directions to your events on iCalendar.-If you have an iPhone or iPad, you can sync them with your Macbook and you just have an infinity of possibilities and uses.I hope this was useful and that it helped you in your decision-making process.", "Date": "November 1, 2013"}, {"Title": "Amazing, am shocked how it far outperforms my older Macbook Air", "Author": "VeritasluxMea \"Neoplatonic Platonist\"", "ReviewID": "R1RAKRYX5GWI32", "Overall": "5.0", "Content": "Working off formerly a 13\" macbook air mid 2011, I just bought this new 2013 model with the Haswell CPU and low power consumption infrastructure.Off a full charge, I disconnected 3 hours 40 mins and had an external drive connected the entire time, restarted 4 times, and did NONSTOP heavy application installs (Office suite, Photoshop etc.), a total of 23 applications, and ran youtube vids in the background the entire time, and after all of that nonstop heavy loading, I had 76% on my battery, of which id have around 35% on my older Macbook Air.Further still, the entire unit has run UTTERLY COOL during this EXTREMELY heavy loading, installing and heavy 1080P video graphics play. My other Macbook Air would be almost too hot to touch underneath near back under same conditions.Even without 802ac (new Wifi connection thru the new Air), I notice roughly 25% faster throughput on likewise file downloads using my new Macbook Air than that of my older version Macbook Air.This new Macbook Air contains PCIe-Based Flash Storage Approaches 800 MB/s Read and Write. I notice BLAZING fast write speed on my 1.1 Gig Photoshop app, and seemed about 40% faster than my previous generation Macbook Air. Also, this new Air model contains PCIe-based SSD modules made by Samsung and is smaller than the previous Air model SSD made by Toshiba.These new Airs also sport batteries with increased capacity driven by higher voltages: increasing from a 7.3 V, 6700 mAh power battery to a 7.6 V 7150 mAh power battery. Other changes include a redesigned expanded heat sink covering both the CPU and GPU, which must be why this unit runs SO COOL even maxed out.ALL my apps run perfect on this new Air, including Office suite, and the entire Adobe suite and the rest of my apps, ....which it should, its still running Mountain Lion OS.I really have to say again, that write speeds on HUGE app instals is just faster than you dare hope for; its just blazing faster than my previous gen. Air.My Macbook Air has been without a question my most treasured gem of \"go-to\" Mac product hands down, I own all of them (2 Airs, Macbook Pro, MacMini etc),...I was skeptical when I shelled out $1099 today for the new Haswell Air and its presumed prognosticated \"crazy long\" battery life and improved speeds overall; but the hype isn't hype, its real and amazing. The mere NOTION that I can overload this Air with App installs, and have a 2.5\" HD attached for nearly 4 hours, run 1080P Youtube vids,...and still be at 76% Batt life is just, well, its stunning.Tested out the NEW dual (stereo) mic and it IS much nicer in record, additionally the camera/vid is much sharper and  crisper than my other Mac Air.  Considering the price point is lower on these new Airs than the older ones,  I give the new Macbook Airs a \"110%\". Having repaired laptops (non mac) in the past, and owned at least 20X more laptops than most consumers, I don't lightly conclude this is the cornerstone workhorse for everything I dare consider doing, fast got faster, and battery life now is enough to make a crusty \"hates everything\" person like myself nearly cry with joy. Congrats Apple! Homerun on this lovely gem.I didnt get this delivered in one day, I picked it up from my local Mac store, I got my buddy to sell it to me 1 day before they officially \"have\" them which is today 6/12. As for the questions about using this new Air with Photoshop and it lagging on heavy filtering and photo editing, Ive tested that fully and this IS the machine you want for ultimate portability, it works fantastic.Also of great importance is that this version of Mac Air is supposed to have \"nearly double\" fast write speeds as the Macbook Pro Retina. And the new Hard storage on this Air has \"up to 6X faster than a 5400RPM disk drive\" as found in current Macbook Pro which contain 5400RPM Toshiba Hard drives (made by Hitachi for Toshiba actually). In short, YES, this is a perfect \"must own\" book in the field or travel use for photoshop work, with just blazing fast write speeds, and crazy long battery life.This new Macbook Air brings TRUE definition to being \"disconnected\" and \"portable\" to those who want to do a LOT of work free of the power socket! Genuine portable is finally here, ...no more staring at the battery % to rush to shut down!", "Date": "June 11, 2013"}, {"Title": "Macbook Pro 13 Retina vs. new Air 11", "Author": "A Customer", "ReviewID": "R1EG9KS4GK7MDJ", "Overall": "4.0", "Content": "These reviews really helped me when I was figuring out what to buy, so here are my two cents. I couldn't figure out if I wanted the Pro Retina or the Air, and I wasn't sure if I wanted 13 in. or 11 in. Now, I actually own both the Macbook Pro 13\" Retina and the new Macbook Air 11 inch, and I understand most people won't want to buy both but these are my thoughts. I first got the 13\" Retina, because I loved the screen, esp. the way text looked because I read a lot and it made such a difference. I have the i7 version, plus the 8 GB RAM, and 256 hard drive. I love that thing. It's gorgeous and fast, a pleasure to work on. BUT. The only problem with it for me is the weight. I know it's lighter than it used to be but I'm petite and when I'm traveling and need to give presentations, this thing is in my bag the entire day, and I find it heavy. Many people may well be stronger than I am but I personally find it a pain to drag around when I'm on the road. Also, the battery life is good but not brilliant, so if I use it all morning and a part of the afternoon unplugged, it's dead.So I recently bought the 11 inch Macbook Air as well, the new version, also maxed out, i7, 8 GB, etc. It is so light, it's amazing. It' lightning fast and the battery life is incredible. I can use it and use it and the battery won't budge. However. The screen is so much less good than my Retina Pro. I'm not a picky person and before I got used to the Retina screen, I didn't mind but now, it's a huge difference. The text is pixelated and very small, the whole thing looks much less good.Basically, I think that if you're going to be mainly stationary when using the laptop, I would definitely go for the Retina Pro 13 inch. At home, it's all I use nowadays. It's a joy to use and looks amazing. However, if you travel a lot and will mainly be using it on the go, I think the new Air is fantastic.  I hardly notice it in my bag and the screen is fine, just not as beautiful as the Retina, plus the performance and battery life are incredible. If the weight of the Retina doesn't bother you, that would be the clear choice.", "Date": "August 29, 2013"}, {"Title": "A battery that does what a laptop needs / Volume Fluctuation Issue", "Author": "Publicagent \"Publicagent\"", "ReviewID": "R1Q0F7VTF30P2S", "Overall": "4.0", "Content": "I have been using the new Macbook Air for almost a week now. I actually started with the 11 inch because I wanted the lightest possibly laptop, and I used to have a smaller screen, but I guess it was just too small. I was noticing things like a shaking screen and I had been using a 15 inch Macbook Pro with the aluminum keyboard for the last five years. When I got the 13 inch, everything looked and felt just right.In my opinion, a laptop battery has one major task. It should allow users to do everything they want on their laptop without having to plug it back in. I used it for about 1.5 to 2 hours two evenings in a row doing internet surfing, minimal video watching, and some word processing. The next day I used it for close to 8 hours of word processing and internet surfing. You know you have an amazing battery when the bar goes red, and you check to see that you still have two and a half hours remaining. I did not check exact times, but I think I got over 11 hours before charging it back up (including 3 days of sleeping). I was also surprised to see that it had recharged before I went to bed!In this day and age, laptop users should understand that you never get the same amount of battery life watching non-stop high quality videos as you would using basic software and the internet. I use a laptop fairly frequently for projects/entertainment, but can not think of one instance in which I would need over 12 hours of battery life. More than 8 hours and my eyes start to blur. The bottom line is that Apple's initial estimate of 12 hours is not off, and I am happy to say that I will not be taking my charger with me anytime I plan to return to my house to sleep later that evening. I don't have to worry about battery life for the first time.One small quirk is that the time estimates of the battery are sometimes off. For instance, I have checked my battery status and seen an estimate of 17 plus hours remaining. I admittedly got overexcited before it quickly went back down to over 12. The percentage is always accurate, however, and it's intriguing to see how long you can last with 100% battery life remaining.As for the rest of the computer, the keyboard is great, the screen is nice, but not stellar, and there is a slight glare when I work in direct sunlight though it's nothing objectionable. I think that Apple has set a new standard with this laptop because it's obviously light, but the battery is truly amazing. It's also picking up the internet feed in my house as good if not better than my other devices.IMPORTANT UPDATE: I have noticed an issue with volume fluctuation when watching movies on Netflix and sports on ESPN. The issue persists on Safari and Firefox. Unfortunately, other are having this issue and no one that I could find as of yet reports it as being resolved. This is a shame. This laptop is so good otherwise I am still giving it 4 stars, but this is a major issue. I have downgraded to 3 stars until this gets resolved.UPDATE REVISED: The volume fluctuation issue appears to have been fixed with an update. Loving the laptop again. Battery still going pretty strong.", "Date": "June 17, 2013"}, {"Title": "Mac-Brick Air", "Author": "grh2011", "ReviewID": "R5FSSO00RCQ3J", "Overall": "2.0", "Content": "Bought a mid 2013 Haswell Macbook air 3 weeks ago on the basis of 12 hour potential battery life, thin size and light weight and general trust in Apple products. We have an older 17\" Macbook Pro that has been through the war and still functions perfectly. Since day 1 this MBA has dropped wi-fi connections everywhere continuously, and despite doing everything by the book-phone support and software upgrades, genius bar appointments, higher level support,etc, and 3 swap outs for other machines it still drops wi-fi. This is a widely known issue worldwide, yet Apple still has no fix for it. They continue to sell it and then ignore you or make you jump through senseless hoops for no reason-there is no fix. Was contacted by an Apple engineer who made me run a diagnostic and send it to him. He said he would help me-never heard from him again.After my last genius bar appointment, after running a diagnostic that proved the drop, the best they could offer was for me to upgrade to a retina-pro-at my expense. I really like the machine otherwise, but Apple has really dropped the ball here and in my opinion is committing fraud. There is much speculation on the forums as to why and how, but as consumers its really not our problem to diagnose or fix.They know its broken-its a widely known issue world wide, there is no fix, yet they continue to sell it. The official Apple Macbook support forum has probably 200,000 views on the wi-fi issue posts and 1100+ replies....more than any other post. Wake up Apple!-fix this issue. We have all been more than patient!. DO NOT BUY ONE TILL THIS IS FIXED!-YOU WILL BE SORRY!.", "Date": "August 18, 2013"}, {"Title": "I chose this over 13 ''Macbook Pro Retinal Display", "Author": "Sam", "ReviewID": "R16MNCYIMJR1D2", "Overall": "5.0", "Content": "Pros1. Portability is a very underrated advantage.  Great to use at bedside. Easy to carry around the house or in an office setting. So light, you can pick it up with one hand and lay it down on the floor while in bed without moving.2. Doesn't get Hot and you don't need a lap desk - MacBook Pro models don't get hot relative to PC's but are more hot compared to the 'Air3. Battery lasts a very long time. Lasts longer than MacBook Pro models especially retinal display4. Very Fast - solid state hard drive not a disc so very quick loadingCons1. Display isn't as nice as the MacBook Pros particularly the retinal display.2. Only two USB ports and thunderbolt  port. No SD port. No Ethernet port3. No Disc Drive \"Optical Drive\" but none of the new Mac lap tops (MacBook Air or MacBook Pro models) have this. Also it wouldn't be a MacBook Air if it had the disc drive(would weigh more) so it's a moot criticism. I already owned a separate disc drive than I can easy attach through a USB port and I never need to use it anyway since everyone can be downloaded online. Only time I need it is to watch DVD'sWhy Mac over PC1. No Spam - search the internet in peace without multiple pop-ups and adware slowing your computer down. No viruses2. Not Windows! - I recently experienced Windows 8 on another laptop and it is atrocious. I'm so glad I don't have to deal with Microsoft products and Windows. I can't believe they found a way to make WIndows more cumbersome3. Intuitive - Macs are designed with human intuition in mind. Everything is designed to be simple and easy to use. You don't need experience with Macs to use this. Since 2007 when Macs began to use Intel chips, the Macs took the best Windows had to offer and improved upon it. You can even buy Microsoft Office for Mac (which I have) so you lose nothing.  So if you are scared to use a Mac, you will find these new Macs are very easy to use.4. Great Service in Apple Store - if something breaks down, Apple is great about replacing parts, computers and honoring warranty.5. Reliable and Durable - My Macbook Pro from 2009 still works like it is out of the box. I just wanted a lighter smaller computer and keep my Macbook at home.", "Date": "September 19, 2013"}, {"Title": "I'm a believer", "Author": "Jpeppard", "ReviewID": "RLT1NYZMRA7XG", "Overall": "5.0", "Content": "Let me start by saying that thus far in my career of Windows PC building, operating, and maintaining, I have never before used a device that could be seriously described as elegant.PROS:The form factor is astounding, I find myself picking the unit up just to look at it and consider it from different angles. The all aluminum chassis has a pleasing texture, it is lighter yet feels far more solid than any other ultrabook I have encountered. The hinges have no undue give, yet there is little effort needed to engage them.The trackpad is a marvel. After only a few days I am amazed I ever used a Windows laptop without proper OS trackpad integration. Every flick and swipe is picked up and acted upon without hesitation, it is a shame this responsiveness is so alien when coming from Windows.OSX is very polished, lightning fast on this SSD. I find myself much preferring it for every activity I use my PC for besides gaming. Swiping between fullscreen pages is intuitive, trackpad gestures are tight and do much to streamline navigation. I feel more compelled to recommend it to clients, no more ad-ware, no flavor of the week virus infections. No embarrassingly mid-life crisis 'reinventions' to fight with as in Windows 8. One OS for desktops and laptops, separate OS for touch-enabled devices.802.11AC Wifi! I can finally use my lonely 5GHz band! I have not experienced any wireless dropouts or hiccups as others have described.Haswell architecture has enabled an unheard of real-world 10-12 hour wireless browsing battery life while packing a fully featured quad core i5 chip with HD5000 graphics. Unprecedented for this size and weight. HD5000 tackles Skyrim at comfortable mid-level graphics and playable frames, at the expense of extreme system heat.Built in bootcamp allows easy Windows 7 dual booting for those OS specific applications, still eeking out 6-10 hours depending on usage, providing a better Windows experience than Microsoft themselves.CONS:Maybe HDD space? All my music is stored with Google, photos and documents on Dropbox and Skydrive. Install Office and Photoshop and still have 90GB left.This is not really a con, just a function of nature. Packing this chip in this form factor means heat! Working in OSX is fine, doesn't break a sweat. Once you bootcamp Windows 7 and try on your gaming pants however, expect this thing to live at 99 degrees celsius with fans full tilt.I used to argue against Macs purely from a price point perspective, but for $999 (bought at Best Buy) I feel this machine is a steal. I can see myself using this system for the next three years easily. With no mechanical hard drive and sturdy construction it will take quite a drop or impact to take this thing out.In closing, the Macbook Air shows that a carefully controlled eco-system can work in the right hands. As opposed to leaving manufacturers to their own devices and quality control standards, Apple has examined every facet of their platform and made purposeful design choices, polished them over several generations and realized them with very strict hardware standards.I have experienced the Windows 8 bombshell from ground zero. Poorly implemented and designed manufacturer software, random black screen freeze ups and hundreds of other software bugs, 5 different operating system recovery methods for 5 different manufacturers, it no longer makes sense to me.I have been assimilated into the cult of simple OS interface and reliable, controlled hardware platforms.", "Date": "August 6, 2013"}, {"Title": "It's small, light & the battery lasts FOREVER.", "Author": "Jonathan Edwards", "ReviewID": "R2CS3FXYZFYE3I", "Overall": "5.0", "Content": "I sat at the store debating on the 11\" MacBook Air or the 13\" MacBook Air for about an hour the day I bought this laptop. I had been using a 2007 MacBook Pro for 6 years and was ready for something new and wanted my next computer to be ultra-portable but have a great battery life as well.Needless to say I got the 11\" and haven't looked back.The battery lasts longer than my iPhone 5s, seriously. For the first time in my life I can go an entire day without being even slightly worried about the battery life. It's incredible. It's a laptop you can go on a weekend road trip with... and leave the charger at home!I purchased the base model for $999 and it has all the power I could have hoped for. It turns on in an instant. It ALWAYS wakes up from sleep in what seems like no time at all (half a second maybe?) and the thing hasn't once crashed, froze, stalled or overheated.I had my MacBook Pro for 6 years, from the looks of things I'll have this one even longer. Everyone I know comments on how small & fast it is. It's like driving a Ferrari, everyone stops to check it out.I can't recommend this laptop enough. I regret absolutely nothing about this purchase.", "Date": "October 30, 2013"}, {"Title": "Just the Right Size", "Author": "WEC", "ReviewID": "R115SAT2MDF2HU", "Overall": "5.0", "Content": "A lot has been written about how great the Macbook Air is. I agree, this is a truly fine thing. Forget the \"feeds and speeds\" metrics so many people seize on (although the performance is pretty good on this for what most people do), I just feel that this thing is in total harmony with me. It is powerful yet light and agile. I have a 13\" Macbook Pro and it is great but a bit heavy. The Macbook Air is insanely light and yet very sturdy.The one thing I really stressed over was whether to get the 11.6 inch model or the 13 inch model. Years ago I had an early netbook. It was nice as a novelty but it was really underpowered. It turned out the 10 inch screen was just too small. The size of the screen on the netbook was just too much of a compromise (my eyesight isn't what it used to be!). I was concerned that the 11.6 inch Macbook Air screen might be too small also. I really wanted to get it instead of the 13 inch screen because to me, getting a larger Macbook Air just seemed to defeat the purpose of getting a small, light computer in the first place. I really wanted the 11.6 inch model to work out. The price difference really wasn't an issue, I just wanted to have the perfect size for me. I saw a few 11.6 and 13 inch models and I thought the 11.6 inch would be okay but I had the nagging feeling that when I started using it, I would regret getting the smaller version. You know how that goes, your first look at something is brief and you don't really get a feel for how you will use it in the real world. Sometimes your initial conclusions turn out wrong and you regret your choice. Well, I took a chance on the 11.6 inch version and after using it for a while, I am really happy with the choice. It is the perfect size for me for a portable computer. If you are struggling with the same decision, I hope this helps.", "Date": "September 20, 2013"}, {"Title": "I dindn't think it was worth it until i used it", "Author": "Jp", "ReviewID": "R2BRR9DI2ELE4G", "Overall": "5.0", "Content": "I have always thought most apple products were overpriced, with a few exception. I thought no different of this mac book air, until i used it. I was in the market for a computer that was light, worked flawlessly, with a long battery life. I searched for the right computer but was never able to find the right computer. When i decided to try this computer i was hooked. Here are some of the reasons why:Most of the computers i encountered did the not have such a good battery life, or you needed to get a bigger battery (which adds weight) or a battery sheet (which adds costs). THis computer easily gets 8 hours of heavy duty use, but has gone as high as 15 for me depending on how you use it.Another reason is that comparatively , it is not that expensive. To get a similar thin, lightweight computer would be expensive even if you bough a windows based one. The mac just looks and feels like a quality computer.It is so easy to use. I thought it would take a while to get use to but after a day i was already using it it like had been for years. Right out of the box everything just seems to work. NO wifi problems, no freezing, no anything. It just works. If you value your time then this is the computer to get.THe keyboard feels great when typing. I always wanted to have a similar keyboard for my windows computer at home. I just love the way the keyboard apple feels.I love the gestures. It makes multitasking and browsing a breeze.I truly suggest you go to a store and try this product. I would rather spend the money for a quality product that will last me years instead instead of saving a hundred dollars for a mediocre product. I really was not an apple fan, but i give credit where is due and they have done an amazing job with this computer.", "Date": "July 23, 2013"}, {"Title": "Love/Hate", "Author": "Mr. K", "ReviewID": "RFPIBL0MKPFZP", "Overall": "3.0", "Content": "I replaced an early 2008 Macbook with this base-model Macbook Air.  The speed difference is astounding, and the battery life has me frequently forgetting my charger - and only realizing I forgot it when I see it laying on my desk when I get home.  Getting used to the smaller hard drive is a work in progress. I think that is mostly because it's nice to have all my movies, music, and pictures available on a whim, but in reality, I rarely access my movies and pictures, so they have made their way onto an external drive until I set up iTunes Match.I have had some pretty significant issues, though.Firstly, I am unable to connect my 1st gen iPad via USB cable. While I don't expect to be able to charge from the MBA, the inability to even set up wireless sync with iTunes, which requires a USB connection to set up, makes this habitual backer-upper very nervous.Secondly, connecting the 2007 Apple bluetooth keyboard and the 2009 Magic Trackpad interferes with WiFi, causing low speeds and intermittent connections.  These issues are experienced when one or both devices are connected, unless I am standing right next to the router.  Even adding a repeater does not boost the signal enough to solve the issue.  The suggestion thus far from Apple is to switch to a 5GHz router or to test all the channels on the 2.4GHz band. At this point, I am unable to practically use bluetooth devices with my brand new computer.I have been in contact with Apple Support, replaced the MBA, duplicated the issues on a fresh install (and after running software updates) and been back in touch with Apple support with the same issues.  It is frustrating because everything works with my older Macbook under the same conditions.  The issues are currently escalated and awaiting resolution.I am willing to settle for these issues for now with the hopes that they will be resolved soon by Apple with software updates.", "Date": "August 22, 2013"}, {"Title": "a HUGE step up from my macbook", "Author": "carol irvin \"carol irvin\"", "ReviewID": "RG2WCFQMPOUB5", "Overall": "5.0", "Content": "I have used the macbook and ipads, both mini and full size, prior to this.  I have been very happy with those.  This is my first mac air and i just love it. i watched my sister use hers when i was visiting her a year ago and i was quite taken with it. i am 65 years old and have a number of health problems which this mac air aides as well so if you are a senior this may be an ideal machine for you. the major features for me are as follows:--the light weight.  this is lighter than my ipad, both mini and full size! it is the most portable laptop i have ever used. this is especially perfect for hauling around to hospitals, testing sites and medical offices.  you can even use it to pull up info you might need in a consult. it is also perfect for the sofa, bed, or beach chair.-- I have osteoarthritis and this unit puts NO stress on any part of my body.--the long, long battery life.  this is the first laptop i have ever used which i can use for hours on end without worrying about plugging it in to stop the battery from draining.--i am very sensitive to heat and can't stand the level of heat all other laptops put out.  this laptop is cool and remains cool.  this is simply wonderful.  this sensitivity to heat was even worse when i went through chemo.  if you are a cancer patient, you do not want a laptop which puts out heat onto your lap. You would also have no problem using this while in chemo treatment.--the speed.  i have never had a laptop which performs at this speed.  it makes my macbook seem like a snail. i did pay extra for the absolute top level of RAM and gigahurtz so that helps as well.  they were not expensive upgrades. multitasking is a dream on the mac air. no program displays the annoying not working sign (which means you need to close programs).  if you want a lot of programs open, this is the machine for that.--i have hearing and visual problems. the sound and viewing area on this mac air completely meets my losses.  i watched a movie on it the other night and it was perfect.i switched to macs from pcs in 2006.  i became quite adept on pcs but i got tired of fixing them.  macs by comparison almost never need repair. i've only ever had one mac crash and that was my first one in 2006 which apple fixed in a day. i, of course, had to put all my data back in which is a pain.  but it has never happened again on any apple hardware i've bought.  so reliability and durability is second to none.i did buy directly from apple online.  i did find it very easy to build the machine i wanted going through apple.  i don't see any monetary savings going through amazon instead or if there is, it must be nominal.although i have stressed the senior benefits, i have two nephews in their 20s and i think they would adore this machine as well.", "Date": "September 5, 2013"}, {"Title": "Known Issues with this Model.  Apple will deny it and waste your time. WAIT FOR THE RECALL!", "Author": "Michael T Macellari", "ReviewID": "R19R2W4LCN6MKQ", "Overall": "1.0", "Content": "Please, before you give yourself or someone you care about the gift of Frustration, read on.  I got one of these for Med School and from the first week I got it, the screen would periodically go black and the computer would not wake up from sleep.I chatted with 3 different Apple Care techs, I updated, I reset PRAM's and other acronyms that I do not know the meaning of (the whole freaking reason I spent the $$$ and got a Mac and not a cheap PC).  When nothing worked they told me to take it into the store.  Couldn't get an appointment  at any reasonable time, so before I committed and took off school, I did some research.  Found out there are tons of other  people having this same issue.  It is all over the Mac Forum, there is a Facebook Group, and Youtube videos.  I love my Apple products and it is really upsetting the way they handle it.  Even with over 50 open cases all reporting the same issue, the Apple techs will waste your time with the same song and dance, and try to get you to take it in...if you don't believe me go ahead get one.  Please do your research first though.", "Date": "December 23, 2013"}, {"Title": "Best Laptop I've Ever Owned!", "Author": "Brad G.", "ReviewID": "R3Q1RZ5PK5JGAV", "Overall": "5.0", "Content": "Longtime mac user here--over 20 years. I use PC's too (only when I have to, lol!). My first laptop was a Macbook Lombard purchased new in 1998 for about $2,800. This new MBA is 10 times the machine for about a 1/3 of the price. FWIW, my Macbook Lombard served me well for over NINE YEARS, and is still is use by a good friend!! Try that with a Windoze machine....I currently own a 2010 Macbook Pro 13\", a 2011 Macbook Air 11\", a 2012 Macbook Air 13\", and just a few days ago I got the newest MBA 13\" with the Haswell chipset. The battery on this newest version life is astonishing! They are not exaggerating when they say 12 hours--I get that and more! Seems like twice the battery life of my 2012 MBA.Other noticeable differences between my 2012 13\" and my 2013 13\":Screen is better (brighter/crisper)Speakers are betterWifi is fasterGraphics are fasterThe only thing close to a downside is that some tests show the new Haswell processor is about 5-10% slower than the previous i5 processor, but, I don't see a performance  difference at all (I think this is largely offset by the much improved flash drives in the newest models) and even if I did, it is a price I'm more than willing to pay for the amazing boost in battery life. If you're buying an Air, more than likely it's because you're highly portable, and having a highly portable laptop with less than great battery life doesn't make much sense. These new Haswell processors solve that problem.I like my Macbook Pro 13\", and for a long time I thought the Air's were kind of an expensive novelty that didn't even include an optical drive! However, these days I place a high value on portability, and nothing comes close to the Macbook Airs. I picked up a superdrive for $75, even though I rarely use it. (I also have an iMac 24\" for burning)Lastly, for those who are agonizing about whether to get an 11\" or 13\", as someone who owns both, I can say this: get the 13\"!At the end of the day, they weigh about the same (the 13\" only weighs 6 ounces more than the 11\") and the 13\", while it's only 1\" wider and 1.4\" deeper than the 11\", the difference in usability/visibility of the screen is HUGE. I really wanted the 11\" to be enough--its small size is awesome (being about the same size and weight of an iPad but it's actually a real computer) but I finally had to admit that the 13\" just has soooo much more screen real estate for a very small increase in footprint/size/weight. Both fit easily into a laptop backpack or shoulder bag and they're so light that you hardly notice you're carrying them, but the larger screen of the 13\" easily wins out over the coolness of the 11\"'s smaller form factor IMHO.", "Date": "October 11, 2013"}, {"Title": "Best Laptop on the Market", "Author": "DR", "ReviewID": "RT8H5JBVQO9SI", "Overall": "5.0", "Content": "This review is for the 11.6\" MBA which I just picked up last week at an Apple store. I'm a seasoned Apple user, owning a 24\" iMac, circa 2009 and a 13\" MBP (also 2009) which was bricked after I dropped a very small amount of water on the keyboard a few months ago.I always wanted to purchase a MBA and was always partial to the 11.6\" model but prior models just didn't cut it at a reasonable price point. A 64GB SSD is just not enough storage when you consider that your OS and basic productivity software are going to easily consume at least half that space. When Apple announced the new versions with 128GB standard and starting at $999, I decided the time was right. That said, I still sprung for the 256GB model simply because for an extra $200 I likely won't have to worry about storage concerns for the coming years I use this notebook and to me that's worth it. I think one could probably get along just fine with the stock 128GB if storage demands aren't high. Now that most large files are moving into the cloud, local storage space seems to be less of a concern.PerformanceOut of the box it took just a few minutes to configure the laptop and I was logged in. Right away I was blown away by the speed increase of this laptop. Keep in mind that I only have 4GB of RAM and the basic i5 Haswell processor that comes standard. Safari loads pages instantly and as much as it pains me to say, makes my iMac look rather sluggish. I was torn about whether or not to upgrade the RAM, but I decided to stick with the 4GB, reasoning that at 11.6\" it was unlikely that I would ever run software so complex to necessitate that much memory. Now I am glad I made that choice because between the improved processor and SSD, this thing runs at phenomenal speeds. Go ahead and upgrade your memory if it gives you peace of mind, but just know that it is probably completely unnecessary.DisplayOne thing that continues to bother me is the bevy of comments about the lack or Retina display on the MBA, especially the 11.6\" version. This is a small laptop, and while it might be nice to have a little crisper display, you aren't going to notice a huge difference at this size. Plus, running a Retina display consumes more battery life and increases the price. In any case, don't fret about the display on the new MBA's- I can tell you that the displays are great and you will be hard-pressed to notice a difference unless you've only used Retina displays for the past several months.BatteryOne of my biggest complaints about my old bricked MBP was the battery life and Apple's false claims of 7-hours of continuous usage. I can tell you that that was patently false. I was lucky to get four hours of use on a full charge and that was if I had the brightness way down and only running a couple of apps at a time. That said, I was extremely skeptical about Apple's claims of 9 hours of usage with the new 11.6\" model. I can say that I am again blown away by the improved battery life, which is the best I've ever gotten on any portable device. In the time I've used it, I continue to find myself glancing at the power meter and being surprised that it is still +90%. There is no doubt that the battery life has been substantially increased over previous models. I attribute this to Intel's new Haswell architecture more than anything. I am looking forward to upgrading to Mavericks which is supposed to improve the battery life even more.PortabilityWhen I bought my MBA, I had very little doubt that I would opt for the smaller, 11.6\" model. I had friends trying to convince me to spring for the 13\" model, saying that the 11.6\" model is too small. If you are debating between the two, I would just advise you to ask yourself the following- where will you use this laptop the most? If it is for work outside the home or travel, and you anticipate carrying it around a lot, there's no question- get the 11.6\" version. It is the perfect size and weight for a laptop. I am of the opinion that a laptop's purpose is portability, so I don't really think anybody should get the 13\" model. If you anticipate working mostly at home, then your best bet is to buy an iMac, which I believe is the best desktop on the market, or buy the 11.6\" model and get an external display to connect to it. For some reason people get scared by the seemingly small screen on the 11.6\" version, but as a power-user who does a lot of coding and productivity work on mine, I can tell you I love the size of this laptop and haven't regretted not getting the larger model.All-in-all this is in my opinion the best laptop on the market if you prefer OSX. If you are in the market for a new laptop you will never regret buying an Air.", "Date": "June 16, 2013"}, {"Title": "Good machine when it wakes up from sleep (after reboot)", "Author": "John R. Florian", "ReviewID": "R3MPLGSXR5V13K", "Overall": "3.0", "Content": "I love my 11\" Mid-2013 MBA! However, it has an annoying problem of going into power saving mode and not coming back if you touch it at the wrong time. I'll attach the bug report (15550585) I submitted to Apple. They closed the report since they said it was a duplicate of another bug report (15556091):Summary:On any mid-2013 MBA (11\" or 13\"), when system is idle long enough to dim the display/go to sleep, the screen fades to black. If the user tries to prevent sleep by tapping a key or trackpad, the system hangs with a black screen. The CAPS LOCK key toggles on/off when pressed, but no other user input seems to do anything. Closing the screen and reopening has no effect. Only a hard boot will bring system back. The happens whether on battery or plugged in. Any unsaved documents/code files are lost.Steps to Reproduce:1. Let system idle and wait for display to dim (based on power settings).2. Wait a couple more seconds for screen to go black.3. Wait a split second more for keyboard backlight to begin to fade.4. Before keyboard backlight is completely off, press a key or swipe the trackpad (as if trying to prevent the system from sleeping, thus requiring re-entry of password)Expected Results:I would expect the system to wake up and let me continue with what I was doing.Actual Results:When touching the input as the keyboard backlight is fading, the backlight illuminates brightly, but the screen stays black. The CAPS LOCK key will toggles its light on/off. No other action will wake up the system. Only a hard boot will bring system back on.Version:My personal machine is a mid-2013 MBA, 11\", 256GB SSD, 8GB RAM, i7 chip, currently running Mavericks, but issue first noticed out-of-box running Mountain Lion.Notes:I brought my MBA to an Apple Store on 11/2/2013 and demonstrated the behavior to a \"genius\" with my configuration running Mavericks and when booting to Apple's \"known good\" environment running Mountain Lion. My case number is 524999600. I first announced my findings on the following discussion thread with the username \"Yoganinja\": [...] Many others have been able to reproduce.Configuration:Any mid-2013 MacBook Air. Off-the-shelf models, brand new or refurbished. Custom models, brand new or refurbished. 11\" or 13\". Mountain Lion or Mavericks. Out of the box, or with additional software installed.", "Date": "December 23, 2013"}, {"Title": "Best MacBook Deal: A Sleek Technological Wonder", "Author": "Trevor L \"God is on the side of the army with...", "ReviewID": "R1NDCIH5CFO3E5", "Overall": "5.0", "Content": "My oldest son works in the Performing Arts and most of the software they use runs on Mac. The raw specs of every Apple notebook are sufficient to run the specialized software he uses, so it just comes down to individual preference of \"battery life, portability and price\" vs \"screen resolution and hard drive space\". In my analysis (see below) I came to the conclusion that 128gb is fine when supplemented with the SD card slot,an external drive and cloud storage (iCloud, DropBox, Box, etc).I also came to the conclusion that the $300ish price premium for the retina display would be better spent on a very nice external monitor and/or a  large external hard drive. The HD5000 video supports up to 2560-by-1600 resolution and with a tiny Thunderbolt to HDMI adapter you can use any HDMI monitor  (Tera Grand - Premium Mini DisplayPort / Thunderbolt to HDMI Adapter). We also owned notebooks with screens 11\" and larger and have come to the conclusion that 13\" is the minimum size needed to do \"real\" work.Here are the Accessories I recommend:Apple Magic Mouse or other Bluetooth MouseMini DisplayPort / Thunderbolt to HDMI AdapterMini DisplayPort / Thunderbolt to VGA AdapterExternal Hard Drive (examples 1tb, 4tb )Apple USB DVD Superdrive or other USB External DVD DriveSDXC or microSD Cards (there are some adapters on hte market that let the microSd sit flush)Office for Mac 2011[::: 2013 13.3\" MacBook Air vs 13.3\" Apple MacBook Pro MD101LL/A :::][+Air] 2.96 pounds vs 3.56 pounds[+Air] HD5000 Graphics vs HD4000 Graphics (40% faster)[+Air] PCIe based SSDs Drive vs ATA SATA drive[+Air] 17.3 mm thick vs 19.1 mm thick[+Air] 12 hours battery vs 7 hours[+Air] 802.11ac Wi-Fi vs 802.11n[+-Air] 128 GB SSD vs 500gb SATA (faster but less space)[-Air] 1440-by-900 pixels vs 1280-by-800 Resolution[-Air] no FW 800 Port[-Air] no Gigabit Ethernet[-Air] 1.3GHz dual-core Intel Core i5 vs 2.5GHz dual-core Intel Core i5 [::: 2013 13.3\" MacBook Air vs 13.3\" Apple MacBook Pro with Retina MD212LL/A :::]*** See above plus differences below[+Air] $1099 vs $1419[+Air] 128 GB PDIe SSD vs 128gb SATA SSD (slower interface)[-Air] 1440-by-900 pixels vs 2560-by-1600 Resolution[-Air] 4gb RAM vs 8GB Ram[::: 2013 13.3\" MacBook Air vs 2012 13.3 MacBook Air MD231LL/A :::][+] Faster PCIe based SSDs instead of SATA SSD drive[+] DDR3L to LPDDR3 for faster RAM memory[+] 802.11ac Wi-Fi for faster wireless[+] 12 hours battery life vs 7 hours[+] HD5000 video for better graphics and supporting DirectX 11.1, OpenCL 1.2 and OpenGL 4.0. It also features an improved decoder for 4K video[+] Dual mics", "Date": "June 22, 2013"}, {"Title": "FIRMWARE ISSUE AMONGST 2013 MACBOOK AIR MODELS", "Author": "ronaldo lomuto", "ReviewID": "R2BUAZQJQ75XOV", "Overall": "1.0", "Content": "The laptop would be great if it actually worked the way it is supposed to, however, I purchased a 13' 2013 MacBook Air on August 31st, 2013 and have had nothing but headaches since. Sleep-wake issues, powering off randomly during usage, battery life issues, etc.6 months since the date of purchase and Apple has still done nothing for me. After several visits to the Apple store, 5 day repairs, and long, tedious phone calls with tech support and customer service, the issue has yet to be resolved. They have refused an exchange and refund because we are no longer within the 30 day time frame.It was only after looking up issues related to the product that I learned of a firmware issue that has been going on with the 2013 air models as far back as June 2013. All customers with the issue are told to \"wait  until the update comes out\". Which I think is unnacceptable as a paying consumer. My experience with Apple from a customer service standpoint has been deplorable and I would not wish it upon anyone else. I should have researched any issues prior to the purchase but I trusted that since it was a huge company its products would be reliable, or at the very least that its protocol for dealing with issues would be a lot less tedious. I know better now. Decided to write this review to warn all of you.My advice: buy at your own risk. If you happen to be one of the unlucky ones, GOOD LUCK!", "Date": "February 23, 2014"}, {"Title": "Superfast compared to the Mid-2011 model.  Same form factor and screen quality", "Author": "Mark B", "ReviewID": "RVE76OQZWO9H3", "Overall": "5.0", "Content": "This latest iteration of the MacBook Air is very speedy.  At least double that of my mid-2011 model.  Other than that, the form factor is the same and the screen is of the same clarity, brightness, and quality.  I have not seen a great improvement in battery life compared to my 2011 model either; it has been lasting about 8 hours with normal use, and about 6 when running Parallels (with Windows 7) or working with pictures.  So maybe not worth an upgrade just yet if your MBA is 2011 or newer, but a highly recommended laptop otherwise.  I am the only MBA user out of a company of a few hundred, and my MBA has lasted longer and remains faster than the stock PCs we buy.  Using Parallels (and Windows 7), I am as able as any of them to use Windows applications as needed.  100% compatibility with our network and others so far!  I sure wish Macs would get a little more traction.  Apple laptops like the MBA are truly innovative, user friendly, and quality-built.  If you are new to Macs, the MBA is a great place to jump in.", "Date": "October 17, 2013"}, {"Title": "everyone should hv one.", "Author": "holin", "ReviewID": "R16YFG49IPQFR3", "Overall": "5.0", "Content": "This is my first ever purchased laptop. I just love it. It is very light, fast, user-friendly. Some may think 11.6 inches is too small, but I (a small girl) am completely fine with its size. I just need to buy the Microsoft office to do my documentation work.", "Date": "September 18, 2013"}, {"Title": "smooth, sleek, and functionally fast.", "Author": "B Vuong", "ReviewID": "R12OUHQLJ16FJ", "Overall": "5.0", "Content": "i prefer my laptops to be mac's and desktops to be windows. im, but no means a fanboy, but i love the MBA. it's replacing my 2009 MBP which is now slightly long in the tooth with performance for today's streaming media demands, as well as even everyday internet usage.no hiccups.", "Date": "September 16, 2013"}, {"Title": "Perfect balance of size and weight", "Author": "Dan Farley", "ReviewID": "R1EN8BBI612O3B", "Overall": "5.0", "Content": "Bought this for my wife - she didn't like being tied to our iMac. Impressive battery life, faster than the iMac (you have to love solid state drives). Screen is gorgeous. If your a mac person - you'll be used to the high build quality - if you're coming from windows it will delight you for months.", "Date": "September 13, 2013"}, {"Title": "Mac does it again", "Author": "J. Philip Geddes", "ReviewID": "R11Y4V7Q4YXN08", "Overall": "5.0", "Content": "A masterpiece in terms of size and weight with all the bells and whistles that make the mac top dog.  I'm an admitted Mac freak and have been since the macPlus many moons ago, while I wince at the price I revel in its simplicity and (horrible word) functionality.  Once you get over the sticker shock retreat to mac Heaven.", "Date": "September 4, 2013"}, {"Title": "great", "Author": "jie yang", "ReviewID": "R3F4RSZRQDBFYW", "Overall": "5.0", "Content": "fast delivery, good price and excellent produce, i love it. i think it will be better for cheaper price. Huh", "Date": "July 15, 2013"}, {"Title": "BEWARE - Get Warranty - Spend More Money to Protect your Investment or Spend More in Repairs!", "Author": "Jaswinder S Bola", "ReviewID": "R2UUFWJK8DW4Q9", "Overall": "1.0", "Content": "Get the WARRANTY - My Mid 2012 Macbook Air i5 8gb has already had:- Screen replaced (due to dead pixels)- Hard Drive SSD crashed and was replaced under their recall program- Now, that I am out of warranty the Memory has started to fail, so I was told by the Apple Tech - Ironically this is right after I took my Laptop in for Hardrive Replacement Recall... They messed up my laptop when they replaced the SSD and now I'm at fault for the memory failing!Apple wants me to fork out another $280 to replace the logic board after I have already spent $1400 USD on this laptop!This laptop is only a year and a half old!!!Apple \"USED\" to be reliable... but not anymore... which is probably why they are promoting the warranties so much.Good Luck to all... This is made in China so I guess we get what we pay for...By the way I own a lot of Apple products: iPad, iPad mini, iPhone 5, macbook pro, airport extreme, ipod's, iTouch.. Apple is slowly losing their loyal Customers...", "Date": "November 26, 2013"}, {"Title": "Great Purchase", "Author": "R. Allen", "ReviewID": "R3GD72ZIQ0H4J4", "Overall": "5.0", "Content": "Needed a Windows-based ultra book to take on the road for work. Purchased a Dell XPS 12 at a local retailer, and the machine had numerous issues so I took it back the next day.Fortunately I woke up and realized that I could run OS X and Windows on a Macbook Air - so no problem with running the Windows-only software that I needed for work.The new Macbook Air 13 is the best machine of its kind - design, materials, build-quality. I ordered it with the newer Intel i5 Haswell processor which is more than sufficient to meet my needs. It has 4GB of RAM and the 256GB Solid State Drive. The overall performance of this machine substantially exceeds the performance of my mid-2012 Macbook Air 11. Battery life is very significantly improved.Recommendation to those out there searching for a Windows-based ultra book - don't overlook running Windows via Boot Camp on a new Macbook!", "Date": "February 9, 2014"}, {"Title": "Recent Convert", "Author": "JayU", "ReviewID": "R2HOAG51GW4PV0", "Overall": "5.0", "Content": "If you're looking for a Windows PC equivalent, you've come to the wrong place. A Macbook is not a Windows PC, and that's the beauty of it. Apple does not believe in the numbers game of the hardware spec of a computer. Instead, it focuses on creating a beautiful machine in which all the parts work in harmony creating a spectacular result for the end user.Being a PC-guy, it took me a long time to even give Apple a chance. In terms of raw power and customizability, a Macbook in the same price range could never come close to a PC. However, when I saw how beautifully the touchpad and hotkeys worked in sync with the OS, I was hooked. I saw the beauty in simplicity, and how the this Macbook had everything I needed and none of the junk.The MBA is a small, light, extremely portable, has roughly a 12hrs battery life. The 1.3GHz i5 processor isn't the most powerful in the world, but it's perfect for running the everyday things that most people use their computers for, such as surfing the web, emails, streaming videos, and writing word documents, all without destroying the battery life. And if you need that extra power, it can boost up to 2.6GHz for the extra tasks. I haven't noticed any performance deficiencies between this laptop, and the $1000 desktop I built 3 years ago (granted 3 years is a long time). One thing that I did notice though, is that it is not a PC. Coming from a PC, many of the programs that I used to use were really optimized for PCs only. Sure Macs have their own equivalents, but if you're thinking about making the leap, you have to know there is a slight learning curve. But who cares, when Apple's software updates are free or close to free, and they hand out their amazing iLife and iWork suites for free for purchases made after Oct 2013.Great product, and great company! IMHO", "Date": "November 28, 2013"}, {"Title": "Will never buy a PC again!", "Author": "Jennifer Jahn", "ReviewID": "R2I2LIMLI7HHTT", "Overall": "5.0", "Content": "The Macbook Air is the perfect piece of technology for college students, such as myself, who need to have a laptop on them at all times (NOT A TABLET) but cannot stand carrying around a big chunky computer on top of all our books. It is so light, portable and fully functioning I would recommend this to anyone even though it is pricier than a PC from Windows or HP, etc. LOVE IT", "Date": "November 5, 2013"}, {"Title": "overall review of my I Mac Air", "Author": "Joel M Serin", "ReviewID": "R4DV80ZRHXAYS", "Overall": "5.0", "Content": "I love my Mac Air because it is so much faster than my PC desktop and so light  I can carry it  or store it easily  on trips. Because of the keyboard it is easier to type than on a pad plus my screen is free of smudges this way. I also like that my home screen has  my Favorite places which I use  frequently.", "Date": "April 7, 2014"}, {"Title": "an apple convert", "Author": "N. janus \"Kitzler Kino\"", "ReviewID": "RY0F8H68H09R7", "Overall": "5.0", "Content": "I hesitated getting this product from Amazon instead of going to an Apple store, turns out, everything is pretty intuitive and if you don't know, you can always go on line and get the right answer, I am a convert to Apple, no more Mr. Monkey Boy Ballmer products  for me!Sorry Mr. Nadella, but after trying Apple, your predecessor killed any goodwill I had for MS.", "Date": "April 6, 2014"}, {"Title": "Apple, what can I say", "Author": "peanuttz", "ReviewID": "R2LVP9J64TDF4U", "Overall": "5.0", "Content": "I hate iTunes.But, I love MacBook. Pro. Air. With retina display! An integrated experience. Leight weight. Nearly perfect...Get!!!", "Date": "April 4, 2014"}, {"Title": "A great choice", "Author": "Andrew W. Ryan \"Andy\"", "ReviewID": "R17FW86IJ84KJS", "Overall": "5.0", "Content": "I got this as an open box with an education discount when my desktop died. These discount put the MBA into my price range and I couldn't be happier.It's really an amazing machine. I'm not a fanboy of Macs or PCs. I've used PCs since the '80s and know my way around them pretty well.The instant-on features and battery life of about 10 hours makes this more like using an iPad than I ever would have thought. It's great to just pull out and get to work; no startup delay, no looking for a plug, and it's silent (I don't know if it has a fan, but I've never heard it). The SSD makes programs open nearly instantly. And it comes with Pages, Numbers and Keynote to get you up and running with productivity apps.Biggest pluses over everything else:- Best trackpad I've ever used: I never would have thought I could get used to a trackpad after almost unusable experiences on nearly every PC laptop I've used. It's huge, sensitive and nearly always makes sense after just a couple minutes of figuring out the gestures.- Long battery life: This really has all-day power. No need to find a plug or carry a bulky cord (this cord is actually not much bigger than an iPad cord and very portable).- Macs seem to make better use of screen space. It's hard to look at an 11-in Macbook and realize that's the same screen size as Windows netbooks. Multiple desktops, smart use of full-screen and fast gestures to navigate them help a lot.- Light and well built. Macs are known for this and it's no joke. Every aspect seems well thought out.Things to consider:- I got the base model because it was available but 256 GB would be a lot better than 128 GB. (Base OS install is about 12 GB; another 20 for included apps, Photoshop, MS Office, Xcode; 10s of GBs more for music, and that space goes quick). You really need to think about what files you need to keep on your computer and shift some to external backup drives. The extra space would all be available for downloads, pics, files.- There are still some things the iPad does more intuitively with dedicated apps, like keeping your Facebook current and Pandora playing.- More RAM. I'm not a power user but there are times I think I've got too much going on.- Retina display would be nice.Bottom line: With an external drive this makes a perfectly fine desktop replacement if you don't run ridiculously intensive apps -- you probably know who you are -- and if you're not a gamer. It seems every bit as good as the base MacBook Pro model. With the discounts, this wasn't a choice between this and higher MacBooks but a choice between this and midrange Windows laptops. There are some interesting things going on with the transformables and touch screens, but I'm completely satisfied with my choice.", "Date": "March 23, 2014"}, {"Title": "Simply beautiful", "Author": "Trotti", "ReviewID": "R1S5RAQLN1CAK2", "Overall": "5.0", "Content": "Everything I could want in a computer.  Great battery life, great keyboard, easy to use - it's nearly flawless.  I think my single complaint is the bulk of the charger and the fact that the battery lasts so long that I tend to misplace the charger because it's needed so infrequently.This was also my first Mac - a big switch for a long time PC user.  Not sure I'll ever go back to slow loads and bulky computers that are slammed together with inconsistent manufacturing standards.  This is a work of art that is also a great computer.", "Date": "March 20, 2014"}, {"Title": "Great computer", "Author": "Jeferson", "ReviewID": "R2EN37P6LN72U3", "Overall": "5.0", "Content": "I gave this computer as a gift to my wife. She loves it! It is really light and has a fast processor. I have been an IBM PC user for a long time so to get used to the different configuration of the IOS it is a little difficult in the beginning. As we are Iphone and Ipad users it made a little easier. In general a great computer, well designed and it is great looking!", "Date": "March 12, 2014"}, {"Title": "Apple's best Mac", "Author": "MARIA CELADA", "ReviewID": "R3QUS5D8WWCBX9", "Overall": "5.0", "Content": "This our fourth Mac within the family !!! and we think that MacBook is the best !! Light, Friendly, Nice performance !! and fair price", "Date": "March 8, 2014"}, {"Title": "Fantastic Laptop", "Author": "NL", "ReviewID": "R3JPOYLF4LQXVZ", "Overall": "5.0", "Content": "Lightweight and sturdy, with excellent battery life, this is the best laptop I have ever owned. Admittedly, I had to pay a little more for it, but that's okay when it comes to apple products--because they are built to last. It's amazing how fast the computer boots up when I flip up the screen. The flash hard drive is incredible. I would very much recommend this product to anyone in school needing to transport a laptop around throughout the day and who also requires said laptop to have a long battery life.", "Date": "March 2, 2014"}, {"Title": "My first Mac", "Author": "Mike Garzelloni", "ReviewID": "R10LG22HUO6WCB", "Overall": "5.0", "Content": "Allot more than I could afford, but Amazon/GE 12 month free financing plan made it work.Years of windows computers I thought would make for and awkward transition. WRONG. Mac's are really easy to use and their support people are the best ever. No regrets!", "Date": "February 28, 2014"}, {"Title": "Awsome", "Author": "neyda Hernandez", "ReviewID": "R30Y3PUBY676JM", "Overall": "5.0", "Content": "I like the sleekness of it and that it does not weight a lot, also that it does not take long to turn on.", "Date": "February 25, 2014"}, {"Title": "Apple MacBook Air", "Author": "Mrdwe", "ReviewID": "R2YOG6I8XQYS7", "Overall": "5.0", "Content": "I am very happy with the MacBook Air. My  Dell Laptop stopped working after 5 years and I purchased the MacBook Air to tie in with my iPhone and iPad. It is fast, great screen, light weight and the battery last a long time. I purchased through Amazon but my local Apple Store help me with the setup. My purchase was in December 12/2014 and it has worked as advertised so far.", "Date": "February 22, 2014"}, {"Title": "light and does all your need", "Author": "xtreme", "ReviewID": "RLGNVKSFJ45D5", "Overall": "5.0", "Content": "started on Mac notebook, then the Mac pro and finally this one. Though It has no CD rom, the ethernet port and has smaller hard disk space and smaller ram memory, the convenience of carrying this when you travel is priceless. This and a mini iPad and you have a perfect way to travel. As in any mac, you have to purchase all the softwares and cannot transfer old purchases (word for mac, adobe etc.) which I found was quite an expensive endeavor consider you now have 3 laptops with individual software. Thus, before buying a mac you prefer, consider its weight specially if you travel as this laptops are your carry ons. the rest of the missing component can be bought thru their store or online (portable cd rom thats mac compatible, an ethernet adapter thru mac port ..there is a name for it which i forgot, and a portable HD or usb with high capacity.", "Date": "February 9, 2014"}, {"Title": "I love it!", "Author": "O. Guzman", "ReviewID": "R1DECZ8V3XU0YP", "Overall": "5.0", "Content": "Not only does this computer feel well built, the battery lasts as long as an iPad.  I am amazed how I only have to charge it once a week for normal browsing.If you are stuck on picking between a MacBook Pro or MacBook Air, just ask yourself if you really ever watch physical DVDs anymore...it's not worth it.Computer boots in around 11 seconds, the flash hard drive is killer fast.  Some may say the 128 GB is small, however I no longer really keep stuff on my hard drive due to iTunes Match and iCloud, and you can always insert a large SD card for additional storage.In regards to the 4 GB of RAM, think about the fact that the computer has a solid state hard drive, which it uses for virtual memory.  4 GB RAM may not sound like much, but having a wicked fast solid state drive for virtual memory will not make it feel like a Mac Mini with 4 GB RAM.  I have 16 GB in my Mac Mini and my MacBook Air is faster.", "Date": "January 20, 2014"}, {"Title": "Best computer I've owned so far", "Author": "Trysta", "ReviewID": "R3C98ZBK4Q8N3K", "Overall": "5.0", "Content": "For my purposes as both a scientist and a student this laptop is basically perfect. You know how usually people say nothing is perfect but this gets close...NO.This computer is (at least for me) perfect.I wanted the lightest computer I could have with a reasonably sized display (because my laptop is my only computer and I use it for both work and personal stuff). I needed something powerful enough to handle Adobe illustrator and some scientific imaging software (imageJ) which I need to use for work. I also wanted good battery life. I would have been happy with 8-9hrs. This laptop regularly breaks 10hrs and mostly I run out of juice long before the battery does. Some people may complain about the lack of a retina display. IMO retina is not quite ready for primetime. I am happy that ALL of my software (whether it is ancient and abandoned or new) works perfectly with my display as does all of the web. The screen is just fine if you've never seen retina on a computer (I have an iPad Air and a Nexus 7 2013 both with \"retina\" displays and I don't cringe when I use my computer).The only issue with this laptop is the price but, if you can get over paying for the 8gb of ram (you should) and the higher storage options, you'll be happy.I upgraded from the 2012 MBA and even though the only real upgrade was the battery life it was totally worth it!", "Date": "January 18, 2014"}, {"Title": "I love my Air!", "Author": "Car321", "ReviewID": "R3UH0YHB2B5DMK", "Overall": "5.0", "Content": "This is a fantastic little laptop. I have no regrets about purchasing it, and I will likely stick with MacBook Air as long as they keep making them!I use my computer as a casual user I guess - web surfing, Office/iWorks type stuff, photos, etc. I sometimes stream Netflix but not often. The Air is PERFECT for my use.- It is SO LIGHT. So light. I just can't believe how portable this computer is. I use a MacBook Pro for work, and the Pro feels like a huge brick compared to the Air. I do a lot of casual web surfing and work alike on the couch with the laptop on my lap, and the Air is just perfect for that. It's light, it's compact, and it doesn't get hot.- The battery, oh the battery! This machine has amazing battery life. I charge it every few days. Right now I am just doing web surfing and I have 83% left...which it says is 10 hours and 49 minutes. My brightness is at a little less than half, which is how I usually keep it, because I don't like high brightness and that really kills the battery life. Although even with the highest brightness, This Air would last several hours on one charge.- It turns on and off in a a second or two. When I press the power button the computer is on SO quickly, it's unreal. Gone are the days of waiting for various programs to boot up. The Air gives instant gratification.- It's silent. Truly. No matter how many hours I'm on it, I've never heard any noise out of this thing.I have the 128GB solid state drive. I was worried at first that this wouldn't be big enough, but didn't want to pay the rather large price difference for 256GB. Honestly, I've discovered 128 is just fine. I can't store every single thing I own on here, but we have an external hard drive for that. It's changed the way I use my laptop, but that is fine with me. But then, I am not a person who has some enormous music library or owns an expensive DSLR camera and spends lots of time working with huge, high res images. I am, as I said, a casual user. 4GB of RAM is also just fine for me.I wish I had owned this computer in college - it would have been so perfect for those days where my laptop had to travel around with me everywhere!Anyway, I completely love this computer, and I would recommend it to anyone who uses computers like I do. I realize that others may have needs that require more power. For the casual user like myself, it really doesn't get better than the MacBook Air.", "Date": "January 18, 2014"}, {"Title": "Outstanding", "Author": "Shelley Baxter", "ReviewID": "R15UDXET34T3NG", "Overall": "4.0", "Content": "Since I can remember, I've always wanted a MacBook whether it was the Pro and Air, I wasn't that bothered which.When I was given this present for Christmas, I was so happy that I'd got a MacBook, and again I wasn't really that bothered if it was the Pro or the Air.The one thing that I was a tad confused about was, that one minute my battery said I had 11 Hours left, and one the next minute it goes straight down to 9 Hours, but I seem to have figured out why that happens now!Also, if I close the lid and come back to it later without pressing 'Sleep' or 'Shut Down', it seems to take a while for me to be able to type in my password to come back onto my Computer, but again, I feel that I have sorted that out now also.So all in all, I think this is a great computer and i'm glad that I got it for Christmas from my parents, but I felt that some things could be improved but nothing that caused me to make a hassle over it.", "Date": "January 8, 2014"}, {"Title": "Great buy!", "Author": "Reagan Harper", "ReviewID": "RC2UFYI7G9QVW", "Overall": "5.0", "Content": "A near perfect laptop!!! This is so much better than any PC I have owned before... I don't know how I could ever leave Apple for a PC again.", "Date": "January 4, 2014"}, {"Title": "great product", "Author": "Ed", "ReviewID": "R3RYS8ND42WOJP", "Overall": "5.0", "Content": "All is great with Mac Air. Truly easy to use and setup.I would recommend to anyone.Amazon made every thing easy", "Date": "January 4, 2014"}, {"Title": "Worth buying!", "Author": "Tomapep", "ReviewID": "R387GYWF11TVRN", "Overall": "5.0", "Content": "This Mac book air arrived like the next day. It came well packaged. My husband uses this device for everything. It also came with a one year warranty. I highly recommend this device and seller.", "Date": "December 30, 2013"}, {"Title": "Great computer", "Author": "John W. Chan", "ReviewID": "R38MXVPLK7E2C8", "Overall": "4.0", "Content": "I bought this mac because my old Sony labtop that is around 5+ years old (window XP was the O/S to give you an idea) and heavy touching about 6-7 pounds with a extended battery. Therefor it made me start shopping around for a new labtop. Also the main job for my labtop is for school work, microsoft words, power point, presentations and etc. a work horse and i'm not a gamer. In one aspect some say its a bit over kill for my needs. What made me go with this mac and comparing to my old sony is the battery life 12 hours Vs. about 6-7 hours. Weight 3 pounds vs. 6-7 pounds. Carrying labtop along with books around campus is a lot of work.Coming from a mircosoft and in to mac it is a huge learning curve. I have used older mac O.S but this one is so different.The only thing that I don't like on a mac Vs. p.c is some of the adapter is standard on a p.c but you have to buy on a mac, which mean more money.", "Date": "December 22, 2013"}, {"Title": "My first Mac, my first love", "Author": "D. Mengistie", "ReviewID": "R2W22VCFFOUCZ0", "Overall": "5.0", "Content": "Speed, Mobility, & BatteryIt boot up quick (less than 10 seconds) and it is very light. The battery life is amazingly long. I love it. This is my first mac. I've been using PC for the past 17 years, I will never buy another PC again!", "Date": "September 2, 2013"}, {"Title": "MacBook Air", "Author": "Terry Haldiman", "ReviewID": "R34R8PJQ94NVC3", "Overall": "5.0", "Content": "Awesone computer!! Light to handle and easy to take anywhere. A very fast processor. I like the lite keyboard.  Battery life is great.", "Date": "August 29, 2013"}, {"Title": "Best laptop I have ever owned!", "Author": "xman", "ReviewID": "R3KNNMRJ5PD03Z", "Overall": "5.0", "Content": "Words cannot describe how impressed I am with this laptop.  I purchased this as a secondary / mobile solution to compliment my custom built Windows 7 desktop, and this laptop is amazing.  A little expensive for a secondary computer but I'm willing to pay the Apple premium for the quality I receive in this product.  Everything from the screen, keyboard, trackpad is amazing.  The keyboard and trackpad is just a pure pleasure to use and makes navigation and typing a breeze.  The portability is amazing, its a true featherweight.. I have a speck case around it and I just put it in a sleeve and I am good to go.  I never have to take the charger with me because this thing literally gets 10+hours doing typical web browsing / internet and well over 6 hours of video playback.. I cannot run this battery down if I tried, it literally takes all day.. its that ridiculous - in a good way.i5 haswell processor with a SSD gives it more then enough performance then I need as well.I love windows and its still my favorite operating system, but as far as laptops go, Apple kills it.  Windows does okay here, but until they are able to make windows laptops with a keyboard and trackpad that can match Apples, they will always take second place here.If anyone is worried about the wifi problem that is apparently floating around.. I have not had any issues with mine, its been rock solid from the day I purchased it.  I seriously cannot find a flaw in this laptop, any I would find would just be pointless nitpicking.", "Date": "August 27, 2013"}, {"Title": "Excellent Product", "Author": "Daniel Ginsberg", "ReviewID": "RPJ0BU6RBQM02", "Overall": "5.0", "Content": "It is so light and compact and yet so powerful.Just one little thing has been bothering me and is that in some places (Panera Bread) the MacBook air has not been able to connect to the wi-fi. I researched it online and found out that there is a problem with this computer and the wi-fi. Hopefully Apple fix it soon", "Date": "August 21, 2013"}, {"Title": "Great product", "Author": "sun_shines", "ReviewID": "R1XCWC5WQ2RBAI", "Overall": "5.0", "Content": "My first apple product. Usually what held me back was the price. I could easily find computers with similar specs for hundreds cheaper. However, the macbook air has a great design, weighs less than 3 lbs, and has an incredibly loooong battery life. Totally worth the extra cost.", "Date": "August 20, 2013"}, {"Title": "pint sized powerhouse", "Author": "K. Strand", "ReviewID": "RLKHCUXMWTXF3", "Overall": "5.0", "Content": "This computer is small and light, essential for a road warrior like me. It slips into my bag or pack like an extra file rather than a laptop. It is fully functional and nicely handles all my \"heavy\" apps, such as those I use from the Adobe Creative Suite, Microsoft Office, etc. The resolution on the small screen is very good and during most work sessions feels as spacious as my 13\" mac pro.  The battery life is terrific; that was a major selling point for me. Amazon price and delivery were excellent. This is the first time I've purchased an Apple computer through Amazon but I will certainly consider doing so again.", "Date": "August 18, 2013"}, {"Title": "This is an amazing laptop!", "Author": "Hannah Wood", "ReviewID": "R1BTIOGABIWXX2", "Overall": "5.0", "Content": "I was a staunch PC devotee for a long time. I've had two HP laptops. The older one, I actually have no complaints with, it just got old. The newer one was a little slow and glitchy. I got an iPhone and loved it. Then I paid several visits to the Apple Store over a period of months and decided on the MacBook Air 13 inch. (I'm a writer and student, so I mainly use word processing, but I also watch a lot of TV, so I wanted a laptop with a fast processor where video would look good). I have no complaints so far. It's beautiful, the screen is amazingly clear and who wouldn't like 12 hours of battery life? Anyway, I would recommend it. I'm sad to leave HP, but honestly, I like this computer so much better than any PC that would have Windows 8.", "Date": "August 18, 2013"}, {"Title": "Best laptop I've ever owned", "Author": "Ohio Guy", "ReviewID": "R2PPHUAF7GNJPO", "Overall": "5.0", "Content": "I've been hoping my old Dell laptop would die and FINALLY the hard drive crashed so I had my excuse to get what I've been wanting for years - my own MBA.  I love it!  I abhor trackpads on Windows machine so I bought the smart mouse with it.  Well, other than checking to see if it worked, haven't used the mouse since.  The smart trackpad is incredible,  Lightweight, it's not much heavier than my iPad but does a heck of a lot more.  I wish it had the battery life of the newest version but a few hours still isn't all that bad for a laptop.  I'd rate this ten stars if I could.", "Date": "July 19, 2013"}, {"Title": "Bootcamp is currently not working", "Author": "N.Yorker", "ReviewID": "RY0XF75LOGLC5", "Overall": "4.0", "Content": "If you need to work under Windows 7, stay clear until apple fixes out all the bugs. Other than that, this Macbook Air 2013 is the best laptop currently out in 2013. Battery life is running at 12-13 hours and is unmatched by any other company. The screen resolution is more than enough for the 13 inch size, and the trackpad is also the best currently in the market.Once bootcamp works, I'll increase the rating to 5 stars.", "Date": "July 19, 2013"}, {"Title": "tops in my 2 fav laptops all time", "Author": "Kent Magnuson \"kmjinx\"", "ReviewID": "R1FDEA1LM1415H", "Overall": "5.0", "Content": "My fav traveler, and I get a newest version each time the changes come out. Had the 13 inch for a week, as the 11 inch was not avail yet. Also a great traveler and #2 fav of mine. I still prefer the 11 inch for the road warrior. Ease of packing, slim/trim profile...nothing better.", "Date": "July 16, 2013"}, {"Title": "I love it", "Author": "William Sherman", "ReviewID": "R1QDWGKCZ4XBPU", "Overall": "5.0", "Content": "i made the switch from PCs to a 27\" iMac it was way easier than i thought it would be learning a new OS and all i fell in love with just how easy Apple made everything but a 27\" iMac is not exactly portable so I bought the new Macbook Air to use when I travel again i love it it just works", "Date": "November 13, 2013"}, {"Title": "Exactly as billed", "Author": "Ronn Berrol", "ReviewID": "R2XEUC4GREVIEZ", "Overall": "5.0", "Content": "I decided to order from Amazon as the shipping is always superior and saved us a trip to the Apple store, which is always a headache.  The item is exactly what we ordered.  Works perfectly out of the box.  No having to deal with \"geniuses' at the Apple Store.Is light weight, good battery life, nice resolution.", "Date": "November 10, 2013"}, {"Title": "My son loves his MackBook.", "Author": "Marlene63", "ReviewID": "R2PPPGHP83MI4V", "Overall": "5.0", "Content": "I bought this for my son for school.  It is super fast and very attractive.I also bought myself a sony vaio using windows 8,  I am so sorry I did not get a Mac.", "Date": "November 6, 2013"}, {"Title": "Wow..my first Mac..Blows Windows away..Never seen anything like this...", "Author": "Jeep Stanley \"Stanley\"", "ReviewID": "R26N891GCZ35VE", "Overall": "5.0", "Content": "For the last 15 years, I  had multiple desktops and laptops. Most recent an $800 Asus i7 with 8GB Ram. So many issues, crappy sound card, screen burns, hard drive failure, sent back couple of times for repair, all in one year. Just got fed up and read the reviews on Apple products on Amazon . Didn't understand what everyone was raving and getting so emotionally attached about.. Convinced by the reviews, I ordered my first Apple product. I am blown away. My Mac has an i5 and it blows away my i7 on the Asus. The i7 is probably slow due to heavy bloatware. The screen clarity is unbelievable. Crisp, sharp and processor speed is unreal. MacBook has back light keyboard , another awesome feature. The download is really fast. No plastic bezel or plastic casing. Aluminum casing and it looks sharp and so beautiful. I am shocked at how well this machine is designed and built. I work as an engineer. I pay a lot of attention to detail , especially when it comes to form and function. Windows coupled with HP/DELL/ASUS are like circus clowns compared to this fine machine. I cannot believe all these years I missed out on such great product. Well built, really really fast, great audio, great video,  aesthetically pleasing...Great job..Time for me to sell all my other Windows run machines and buy Apples. This is it...", "Date": "October 23, 2013"}, {"Title": "Best ultra in 2013", "Author": "Wajih", "ReviewID": "R39XQ9G6IHSKY6", "Overall": "4.0", "Content": "I buy this laptop because of the all reviews i see before but you can't believe them until u try it,So i will put my review as features and disadvantageFeatures1) thinest and lightest laptop2) battery life up to 12 hrs with normal work will be 8 hrs with wifi and watching videos3) the speed in installing and transferring unbelievable it is take just 1-2 minutes to install office or big games like Xcome also it is transfer 50gb from and to hdd in minutes4) the keyboard and trackpad very good for working5) it will not be warm until you play big game like borderlands 2 and not that much warm so always you will not hear the fan workingDisadvantage1) wifi issue - wifi always disconnect even after update because the wifi need new modem with 802.11.ac dual band or you need modem near to you without pressure on it2) the screen is nice because it is thin but i think it's need more resolution than 1440*900Finally it is amazing laptop and it is good choice even for users more than normal which need to make some clips and photoshop workI need to mention that i use 1.3 i5 8gb ram 256 sdd", "Date": "August 31, 2013"}, {"Title": "So Happy!", "Author": "John Monahan", "ReviewID": "R4MQ1PILUJ6QB", "Overall": "5.0", "Content": "This is my first Macbook. I'm an IT person so I use a laptop every day for work. I usually get a new Windows laptop every 18 months. So most of my review will come from that experience.I bought the 13 inch version of this MBA with 4GB memory and the 128GB SSD for personal use. I travel a lot for work so I wanted something small so I could take both my personal and work laptop on business trips. Others in my family have the Macbook Pro. I went with the Air mainly for the portability, thin size, and weight of the Air. But the long battery life is what really sold me in the end. As far as choosing between the Air and Pro:- Everything is wireless now so I didn't need the physical network connection.- I bought a USB 3.0 hub to get additional USB ports.- I also go an external HDD for backups and movies, plus I got an external DVD writer.The SSD disk drive is really nice. New programs install in a matter of seconds. I have found everything quick and snappy, in general. Much better than my Windows 7 Lenovo.Other than the excellent battery, I think my most favorite thing is how cool this thing runs. My work Lenovo runs hot and I need a laptop pad to keep from sweating. Even with the pad, that thing still gets me hot when sitting with my feet up and the laptop in the lap. This new Air is hardly even warm. I always use it without the pad and have no issues. It really is a night and day difference.This is just a nice and sleek machine all the way around. I'm happy with everything. Performance, look, and feel. The only single thing I wish was better on this machine is the screen resolution. My other laptop has this one beat in that area.", "Date": "August 4, 2013"}, {"Title": "Mac-brick Air freezing constantly", "Author": "Balázs Zoltán", "ReviewID": "R3FD8F1D0CTRT8", "Overall": "2.0", "Content": "I bought this Macbook Air to my girlfriend. This is her first Apple product. It looks great, and it feels great to use it. She basically loves it. But she also hates it when it freezes. And it freezes a lot. In the first week, it freezed 5 times ! And when it freezes, you can't do basically anything, but hard reboot the system, and all of your unsaved works are lost.Apple know about this issue for months, and yet no solution at all. Just google for \"macbook air screen goes black\" or join the facebook group with the same name.This is really sad. Buying a premium quality machine, which freezes more than Win95 on a chinese hardware :( Disappointing...", "Date": "January 23, 2014"}, {"Title": "It's late 2013, and I just switched to a Macbook air from a PC.  I am not planning to go back.", "Author": "Amazon Customer", "ReviewID": "R2RUZMAWZGLU27", "Overall": "5.0", "Content": "When Apple makes the best, fastest PC on the market (i.e. running Windows via Bootcamp), there is no other choice but to buy a Mac.  This is coming from a lifelong PC power-user.  No more noisy fans, no more whirring, slow disk drives.  No more idiotic bloatware gumming up the circuits.  It's late 2013, and I just switched to a Macbook air.  I am not planning to go back.", "Date": "November 23, 2013"}, {"Title": "Plagued by Problems", "Author": "Rin \"yaoifix.com\"", "ReviewID": "R3834211DLOI4T", "Overall": "2.0", "Content": "This is my 3rd Apple and sadly, each new one I buy has more problems than the previous. It feels like Apple is riding on it's reputation at this point. The pro with this machine is of course its portability, and its SSD is nice and quick. On the downside, mine has been horribly unreliable. I had to bring this laptop into support a few months after buying it. The issue was so bad they had to wipe the entire computer and re-uploading from my time machine didn't work, so I had to add everything manually. I've had chronic problems with it ever since, but each time I take it in, they put a bandaid on the issue and run the software and hardware tests- never finding anything, and yet things KEEP going wrong. And this is a NEW machine, not refurbished. Apple doesn't seem to care that there are chronic problems, as long as the immediate ones are fixed. Which basically means that as soon as my support package runs out, I'm going to be left with a very unreliable machine that will need expensive repairs or an entire replacement after just a couple years. Maybe that's ok for people who have money to burn. I'm not one of those people. I need a reliable machine that doesn't require me spending hours on the phone with support or leaving my laptop for days at a time in the Apple store. Frankly, unless you are a dyer Apple fan and are married to the Apple OS, I would look to a good PC- especially considering most of them have touch screens and there's not a single Apple computer that does. Believe me, I've used Macs for over a decade and I used to love them. The quality just isn't there these days- at least not in my experience, You take your chances.", "Date": "October 25, 2013"}, {"Title": "It's almost as good as in my dreams", "Author": "Phoj", "ReviewID": "R3NRFHNYT6EY5W", "Overall": "4.0", "Content": "The BATTERY!It's not quite 12 hours but it's got lots of stamina that puts many men to shame in bed. I seem to get around 8 through basic uses such as web browsing or typing on Pages. I do a little light gaming but nothing big.After that the mac is a sleek, thin, and speedy computer. That kind of makes it sound like a race car, but it is in fact a laptop computer... not a race car.  It would be cool if it transformed into a car though.I can't say I do anything to push this thing to it's limits such as any 3d imaging or current gen high end gaming on it, so I can't comment on any of that crap.  For what I do though it is very fluid. pages load, menus transition, and magic happens on my screen without any lag.  It's really quite nice. Well.. in fact it's pretty close to great because its so light that I can hold it on my lap without it seeming like a oil filled space heater burning my skin.I do honestly have to say I am impressed with this laptop. It defines mobility and power like advertised.  Sure it's not an alienware or a fully upgraded macbook pro, but it does have a lot of power under it's petite frame. Of course boobs would help, but it's not a human girl so i'm cool with that.I completely recommend this hunk of aluminum.  It's sturdy, lasts most of the day, has a high quality look and replicates that in function as well.If you don't have a significant other in your life it'll fill in that empty space.  If you do, it'll drown out their nagging.", "Date": "August 19, 2013"}, {"Title": "Good laptop", "Author": "Mona", "ReviewID": "R1W8FPWW38TF6Q", "Overall": "4.0", "Content": "It's good purchase small but its so delicate and so thin. It doesn't have DVD/CD drive but with apple you can download everything you won't need that", "Date": "June 4, 2014"}, {"Title": "Love it", "Author": "Jim L \"jimtechsd\"", "ReviewID": "R3GNSNBEJIIDEC", "Overall": "5.0", "Content": "As a convert from PC's, I can't say enough about how wonderful Mac's are.  They work flawlessly and the customer service and technical support are exceptional.  I have literally five PC laptops, all from the same manufacturer - a well known brand.  And while I would buy another one from this manufacturer if I was to ever get another PC, there is no way I could ever do that to myself or my clients.  Why?1. Mac's boot up quickly and consistently.  I had a one year old PC laptop in great condition.  From the time I booted up the computer to the time the document loaded into my email, 7 minutes passed!  On my Mac, it's about 30 seconds, even the one that's over a year old.  No issues over time.2. Battery life - PC battery life is about 2 hours maximum. I get 3 times that and more from my Mac, even one that I've had for over a year.3. Support - got a problem, take it to the Apple Store. I had an issue with the new one.  Took it in and within 8 hours it was diagnosed, fixed, and back in my hands for free.4. Impressive - the impression people get when they see me pull out my Mac is that I mean business, I've stepped up my game, and that I can get the job done.The other day, my wife was complaining about how slow her PC was after a year of ownership.  She was trying to place an order online and couldn't.  I gave her my Mac to try; within 2 minutes, she had the order completed.  It was her computer, not the website.So, if you want a computer that is problem free, impressive, and just simply works, get a Mac.  If you don't have enough stress in your life and have plenty of time to sit and wait, then get a PC.", "Date": "June 2, 2014"}, {"Title": "Great for daily usage, but also for Djing!", "Author": "Erico", "ReviewID": "R257EUVK2THB3H", "Overall": "5.0", "Content": "This computer is just incredible!I bought it to work with some of my personal projects, being one of them djing. I am able to use this laptop with my jig connected through USB for hours. Yesterday I was able to play during 4 hours and still had 3 hours left. I was using a Numark mixer with Traktor consuming some of the battery.Besides that the boot-up is extremely quick due to the ssd as well as the usage of several different software.My advice is to buy the 256 hard drive version. It won't create any problem to you!Beware of the RAM memory usage, though!", "Date": "May 24, 2014"}, {"Title": "Macbook Air is convenient use", "Author": "markham Johnson", "ReviewID": "R1VL27WJKZ3TI2", "Overall": "4.0", "Content": "coming from a macbook pro i have to say that this is most convenient as it is light, thin and easy to carry. I initially bought it for my wife, then for us to share, now i don't want to give it to her. Money well spent. Works just as well for Adobe CS.My only issue is that if you don't have wifi connection it is almost of no use to you. That's my only issue.", "Date": "May 22, 2014"}, {"Title": "Cool Laptop", "Author": "Deepak A", "ReviewID": "RLZ3DLSZFQHZ7", "Overall": "5.0", "Content": "Nothing new to describe about Mac. Pioneer in Market, Just loved the product. The interface is pretty new as I am more of windows user, yet its just awesome.", "Date": "May 17, 2014"}, {"Title": "A brilliant device", "Author": "cfab", "ReviewID": "R1YCZZBNA3GHON", "Overall": "5.0", "Content": "This was for my daughter. She loves it as does her husband who created a great iMovie on it. Brilliant", "Date": "May 16, 2014"}, {"Title": "Very Happy With The Purchase", "Author": "Randy", "ReviewID": "R26PGSQB97BWUJ", "Overall": "5.0", "Content": "My daughter is going into her 5th year of college at OSU and requested that we upgrade her from the MacBook to the MacBook Air.  Physically, it's a very thin computer and has more \"cool\" features than the predecessors.  The bottom line is my daughter is really happy with the purchase and I would recommend it to you.", "Date": "May 13, 2014"}, {"Title": "MACBOOK AIR", "Author": "pat howell", "ReviewID": "R1FC0S3QVQU9CE", "Overall": "5.0", "Content": "I WANTED A MAC OF MY OWN AND A COUSIN CAME TO VISIT US WITH HIS MACBOOK AIR.  I FELL IN LOVE WITH IT RIGHT AWAY.  WE WILL BE TRAVELING A LOT AND THE SIZE AND WEIGHT ARE PERFECT FOR EASY MOBILITY, AND PACKING.  I WOULD RECOMMEND IT TO EVERYONE, IT DOES EVERYTHING I NEED TO DO VERY QUICKLY AND EASILY AND I AM NOT TECH SAVY AT ALL.  YOU LIST THIS AS THE \" OLD VERSION \"....WHAT IS THAT ?  I THOUGHT I WAS ORDERING THE NEWEST MAC AIR.", "Date": "May 13, 2014"}, {"Title": "good", "Author": "Terese Teganlakla", "ReviewID": "RZ2X9HE120RZQ", "Overall": "3.0", "Content": "It was alright not quite what I expected. But it works good for us:) I'd recommend this to someone who would like to be simple and easy.", "Date": "April 16, 2014"}, {"Title": "Everything I expected...", "Author": "Mike Goforth", "ReviewID": "R3QHAJNCXXMO80", "Overall": "5.0", "Content": "This macbook air is everything I expected in a compact sized computer.  Very fast performance and lightweight.  Love the machine.", "Date": "April 10, 2014"}, {"Title": "Awesome!", "Author": "Carmelita Somerville", "ReviewID": "R3780T2Q0I4X2A", "Overall": "5.0", "Content": "This was a great purchase and I am enjoying my new Mac. My PC just crash on me so this was a gift to myself and I am happy.", "Date": "January 13, 2014"}, {"Title": "So happy I choose the Macbook Air", "Author": "DL", "ReviewID": "R3AM2U2TDUNKTZ", "Overall": "5.0", "Content": "I absolutely love this computer. I have always had a PC but since I have an iphone and ipad I thought I would try the laptop and it is great. It's been a much easier transition than I expected so I am thrilled with it so far.", "Date": "January 3, 2014"}, {"Title": "Nice Device", "Author": "D. Villanueva", "ReviewID": "R1C4IV0JOL4N9I", "Overall": "4.0", "Content": "After receiving it the set up went well, updates loaded and had to purchase the Microsoft Suite.  That had to be digitally uploaded as there is not CD on the airbook.  That was a strange part but the upload from Amazon was flawless.  The airbook use of screen minimization so you can move from application to application was a nice feature.  Overall, we are very pleased with it.  Oh, and yes, it is so light it is like holding an iPad.", "Date": "December 30, 2013"}, {"Title": "great!", "Author": "coatzzz", "ReviewID": "R2CQF7J3RCI9IC", "Overall": "5.0", "Content": "love this after switching from a pc. long overdue. so easy and lightweight and the shipping for this purchase was on time. I'm using it to write this review right now and so far iv never had any problems with it. one of the best decisions iv made so far!", "Date": "December 29, 2013"}, {"Title": "Nice laptop for college", "Author": "megan mcginnis", "ReviewID": "ROY65N7ZVY1NL", "Overall": "5.0", "Content": "i love it bc its light and awesome because it a mac from apple and they never fail at their products.", "Date": "December 24, 2013"}, {"Title": "awesome", "Author": "Land", "ReviewID": "R35DRT9ZVSAJHX", "Overall": "5.0", "Content": "Glad I made the switch. The fit and finish is nice and its a very powerful little laptop. love it", "Date": "December 23, 2013"}, {"Title": "If you can afford it - buy it", "Author": "alejandrolevy", "ReviewID": "R2MKRSKC4DD9CS", "Overall": "5.0", "Content": "The size the speed the quality the weight everything about this computer Iis amazing!  If you can afford it. Buy it!", "Date": "December 21, 2013"}, {"Title": "Fast long life battery BEAST!", "Author": "Zakatronics", "ReviewID": "R2D5MZDGI29QOD", "Overall": "5.0", "Content": "This is by far the lightest and fastest laptop I've used to date. I underestimated how long the battery life is as well. Apple really have outdone themselves with the Macbook AIr. I've put it to the test and have multitasked like a maniac, doesn't even bog down a bit.", "Date": "November 4, 2013"}, {"Title": "What you expect from apple", "Author": "Matthew T Olson", "ReviewID": "R4DKEC1CFNAV5", "Overall": "5.0", "Content": "Works out of the box. It's a lot lighter but feels sturdy.Not a computational power house - its good for basic computer uses.", "Date": "November 1, 2013"}, {"Title": "Road Warrior Heaven", "Author": "James Turley", "ReviewID": "R1SHITYQ15HZ09", "Overall": "5.0", "Content": "Immense battery life. SFO to BKK without a chargeSleek, small, thin, fast, elegant, smoothBeautiful displayBeyond LovelyWatch out! Everyone will want to take it", "Date": "November 1, 2013"}, {"Title": "The best Mac laptop for heavy travelers", "Author": "Miguel Danielson", "ReviewID": "RVBX7QAHDQYQC", "Overall": "5.0", "Content": "If you like to bring your laptop with you when you travel, or to meetings, etc., there simply is no better Mac than the Macbook Air.  It is by far the lightest laptop in the Mac lineup and it has significant amounts of processing power, graphics capabilities, and perhaps most importantly, battery life.  About the only reason I might go with a different Apple laptop would be if I needed greater processing power for video editing, gaming, or similar applications.  However, for virtually every other application, the Macbook Air is by far the best offering in terms of portability, ruggedness, and battery life.Would not hesitate to buy the next update of the MBA once it comes out.  Hopefully Apple will be adding Retina displays to these things soon, but until then, there's simply nothing better out there.", "Date": "October 30, 2013"}, {"Title": "wow", "Author": "Kyle Shell", "ReviewID": "R2IKFX3LGRWXUE", "Overall": "5.0", "Content": "My wife Loves it.  I have to admit that I am a little jealous, and would almost trade my nice MCP retina 15'' for it but she wouldn't ... thin, light, fast, .... I have to say now that the \"new\" 13\" MBP-r are out I would but them instead but I don't mind this .... for a great travel / coffee shop machine it is one of the BEST!", "Date": "October 25, 2013"}, {"Title": "best laptop EVER", "Author": "S. LIU \"Stanluca\"", "ReviewID": "RGRSD6ODN58Q3", "Overall": "5.0", "Content": "Apple has outdone itself again.  There is simply no other laptop in the market that can even compete with this.  I had the MacBook Air 11 from 2010 and just upgraded to the MacBook Air 13 one week ago.  I LOVE IT!!  The battery life is just incredible.  I've been using it without power cord for a staggering 2 days already and still have 43% power left good for another 4 hours!  The touch pad is classic Apple and very response.  Why can't windows machines make a touchpad like this???  The keyboard is a joy to use and I love the SSD.  I literally have it on my bed and whenever I need to do stuff, just open it up and there it is ready for me.  Amazing!!!", "Date": "October 25, 2013"}, {"Title": "Great!", "Author": "jrd", "ReviewID": "R2XG0UYMMNUDK1", "Overall": "5.0", "Content": "Opens in seconds!  Easy to use, very light weight.  Almost as easy to carry as an IPad.  I highly recommend thie Air.", "Date": "October 22, 2013"}, {"Title": "Awesome !!!", "Author": "donnie campbell \"Donnie\"", "ReviewID": "R3B2NB4MMRRZZA", "Overall": "5.0", "Content": "This is a awesome macbook air I will tell all of my friends and will recommend this apple macbook air to everyone I come in contact with.", "Date": "October 22, 2013"}, {"Title": "What can I say about this computer? It's amazing!", "Author": "Carlos Silva", "ReviewID": "R5UX55UCIJX52", "Overall": "5.0", "Content": "As described by Apple, the product has everything that I need. It's fast and light. Instead to spend some money buying an iPad, I decided to buy this computer. I would say that I'm not regretted about my decision.", "Date": "October 17, 2013"}, {"Title": "Nice!  Don't hesitate.", "Author": "Amazon Customer", "ReviewID": "R1R6G8XGUIMV2O", "Overall": "5.0", "Content": "Love it!  Should have migrated earlier.  And for disk drive you can share the drive with another mac.  Battery lasts long enough for any workday.", "Date": "October 16, 2013"}, {"Title": "Love it!", "Author": "anonymous", "ReviewID": "R32SE97QSS9FP8", "Overall": "5.0", "Content": "I am writing the review using my new macbook air. I totally love it. So thin and nice looking. So far I have done only very simple use and the computer seems to be fast. It is my first mac and I was worried about learning new system could be difficult, but I was wrong. It is so easy.", "Date": "October 16, 2013"}, {"Title": "Fantastic", "Author": "Jowanza", "ReviewID": "R1CN9SFXIXVE3Q", "Overall": "5.0", "Content": "This is by far the best laptop I've owned.  It's not the nicest screen out there but all the other specs are top notch.", "Date": "October 14, 2013"}, {"Title": "What a Beauty!", "Author": "Jefecece", "ReviewID": "R642YTELJRJ30", "Overall": "5.0", "Content": "I love, love, love my new Mac Air 11.6.  Was very concerned about the size - thought it may be too small.  Turns out it's a perfect size screen.  and light as a feather.  I don't even miss not have a DVD/CD player with it - I just install using another computer's CD, via remote access.  This is my very first Apple and I couldn't be happier.", "Date": "October 7, 2013"}, {"Title": "Great Buy!", "Author": "LePete Dorant \"BoBo Duron\"", "ReviewID": "R10HYK7M5WUNRW", "Overall": "5.0", "Content": "Its very light and battery life is great if your just using 1 or 2 apps at a time. Get something to cover it from scratches.", "Date": "October 2, 2013"}, {"Title": "love my new macbook air", "Author": "jorge", "ReviewID": "R352P8AR5AYBYJ", "Overall": "5.0", "Content": "It was great even better than i expected, super fast and extremely lightweight, was a little worried about ios(never had a mac before) but it is really easy to use, and the battery last a lot, i dont have to worry about running out of battery anymore", "Date": "October 2, 2013"}, {"Title": "In love", "Author": "ednaroc", "ReviewID": "R2J96XPAO1PSZS", "Overall": "5.0", "Content": "Love my computer is working perfectly is light and is just amazing in love with all the mac products will purchase again from amazon", "Date": "September 27, 2013"}, {"Title": "Loved it!", "Author": "Hilda", "ReviewID": "RKOYJDXWNXM6N", "Overall": "5.0", "Content": "This is my first time buying something off amazon and I was a bit concerned that I was going to get ripped off.  Everything the description said was true.  My macbook air did come with Microsoft installed which I loved because it saved me a lot of money.  Also, my laptop looks new as if I bought it from the store.", "Date": "September 25, 2013"}, {"Title": "Lighter than \"AIR\"", "Author": "Gail E Stark", "ReviewID": "R2U10DAQON4YA3", "Overall": "5.0", "Content": "Definetely  heaven sent. Everyday I'm learning more \"tech\" capabilities. It's giving me just what I wanted. My first personal purchase in a Mac Household.", "Date": "September 23, 2013"}, {"Title": "Awesome!!", "Author": "June C. Mcbride \"June McBride\"", "ReviewID": "RUS2WTYB90HOD", "Overall": "5.0", "Content": "Apple has the best devices!  Love, love, love it!!  I highly recommend for any one interested in a portable computer!", "Date": "September 21, 2013"}, {"Title": "Amazing upgrade", "Author": "Ali", "ReviewID": "R3QN5OBTJQ2UNF", "Overall": "5.0", "Content": "Very satisfied with the new release. Its super fast and responsive.The battery lasts all day long! I really love it.", "Date": "September 14, 2013"}, {"Title": "Will never get a Windows computer again", "Author": "Tana Be", "ReviewID": "R31ENIEY3AVM1I", "Overall": "5.0", "Content": "Incredible computer! Fast, lightweight, and with amazing battery life. I would definitely recommend it. Please, don't even consider a PC.", "Date": "September 13, 2013"}, {"Title": "Love it", "Author": "faelmayrink", "ReviewID": "R21F7LP9EBPPWK", "Overall": "5.0", "Content": "The best notebook ever!!! I really recommend it. I missed the 256GB memory, though :(  But that's ok. Go ahead and get the 256GB", "Date": "September 2, 2013"}, {"Title": "The best!", "Author": "mike", "ReviewID": "R34WZ8Y9374YJR", "Overall": "5.0", "Content": "I was excited to order this computer. I ordered it at around 5:30 PM Friday, with Saturday shipping. I got it the next day at noon. Impressive already! I opened it up, in brand new carefully packaged condition, turned it on, and fell in love. Today, I got 6-7 hours with it while playing Pandora, and playing a game, and surfing occasionally which is phenomenal in my opinion. I love the backlit keyboard and the build and size/weight. Do not hesitate to buy!", "Date": "September 1, 2013"}, {"Title": "Excellent condition, when I received it.", "Author": "Truc Trung Nguyen", "ReviewID": "R2W4NVHTECEP5E", "Overall": "5.0", "Content": "I am a big fan of IBM compatible computers for more than 25 years, this is my first Apple IOS, so need time to learn about it, but after a few times fiddle with it, turn out it is not a bad decision to buy it.", "Date": "April 11, 2014"}, {"Title": "Love It...", "Author": "Asia Mobley", "ReviewID": "R1I6E48TJSXX9K", "Overall": "5.0", "Content": "I bought this laptop around the end of January 2014 & so far, so good! This laptop has been perfect for me.Pros:- worth the money- fast- good quality- all around GREATNo complaints only Con I have would be that it's super fragile. I didn't realize how small it was. I'd suggest this laptop to anyone.", "Date": "March 22, 2014"}, {"Title": "Air book", "Author": "Bart Howard", "ReviewID": "R3IZLVNT96158R", "Overall": "5.0", "Content": "We upgraded to the new Air Book so we were already sold on the Brand and device before we ordered. Prior to this we had tried out the Asus and Samsung Ultra books before returning them. Compared to them them Air book is far superior. Both of thos models had really bad touch pad problems and were almost impossible to use. Great service, Swift shipping and great customer service.  Can't be faulted.", "Date": "January 28, 2014"}, {"Title": "Apple is apple", "Author": "Maxim Podolskiy", "ReviewID": "R2KPVWOMQHTGKA", "Overall": "5.0", "Content": "I rate this as 5 star cause... i really don't know what to say, everything in this notebook placed where it should be, everything is needed and usable! Love it!", "Date": "January 22, 2014"}, {"Title": "MacBook Air with flash drive in 13 inch model", "Author": "Malcolm L. Mac Leod", "ReviewID": "RB79FBV7MBMRZ", "Overall": "5.0", "Content": "This puppy has flash drive instead of hard drive and is a complete joy in every way.It's a wise purchase.", "Date": "December 30, 2013"}, {"Title": "Excellent", "Author": "Lynne Noble-Danischevsky", "ReviewID": "R1ZDUBU5NHW3FJ", "Overall": "5.0", "Content": "Have used a MacBook Air for some years now and this is lovely being smaller and lighter, as we travel a lot a lighter version is ideal. Absolutely love it and would thoroughly recommend it to everyone....", "Date": "December 17, 2013"}, {"Title": "Nice Ultrabook", "Author": "Doc Ott", "ReviewID": "R1CC88B6NDTUIX", "Overall": "4.0", "Content": "Nice compact ultra book.  Design is awesome.  Battery life is awesome.  Love the SSD drive.  Love the fact that alot of the games I purchased through Steam give me a Mac copy also.  Don't plan on playing any 3D games on this at a good frame rate but 2d stuff plays great. Good to take on the road. Price is a little high for what you get, but this is an Apple product. Overall happy with my purchase.  This is my first Mac and it did not convert me over. But still enjoying it.", "Date": "December 16, 2013"}, {"Title": "So good", "Author": "denis_25", "ReviewID": "R6LC95GBRWF9X", "Overall": "5.0", "Content": "Amazing laptop !! Till now, no complains. All work well. The most important, it's very beautiful and easy to carry. I love it !", "Date": "November 24, 2013"}, {"Title": "Sierra Burtons Review", "Author": "sierra", "ReviewID": "RSTW0FH5H1VA2", "Overall": "5.0", "Content": "All apple products are usually amazing products they make many different things. Phones, Lap Tops, Computers, iPads, and iPods Even with a few glitches at times here and their all Apples products are reliable and durable.One amazing about the Mac is the light weight it has. Being a college student and always needing my lap top attached to my hip, I don not want a heavy 10 pound laptop. I want something durable and light that I can just throw into my backpack or purse and not notice the weight difference. With the light weight I can take is any where and everywhere and it barley takes up any space either.But one thing I love the most is the 12 hour battery life. I am able to do work all day long on the go and I don't have to worry about my battery life and loosing all my work I worked on. Being on the go and not always near a power source is hard when it comes to keeping things charged.A add on though for the Mac is the 2 usb sources instead of 1. Having 2 usb ports is such a life save when it comes to a college student or even just a person always on the go. I can charge my phone 24/7 while I put in a a usb to save and transfer all my school work.Having a Mac book pro is one of the most amazing things for being a college. I love having it with me to be able to always look things up. I can carry around a lap top with no problem at all. The mac is one of the most reliable lap tops yet, i would never ever trade it for anything else. My life is my lap top it is my savior at times. Apple is the way to go no doubt about it. It compares to nothing else what so ever.", "Date": "October 21, 2013"}, {"Title": "In general its GREAT!", "Author": "Jessica Mateus", "ReviewID": "R3MTLYFOFTO4XV", "Overall": "5.0", "Content": "Its perfect! I love tha fact that is not heavy at all! you could travel or take it to work and never notice it in you purse.The keyboard is great, the screen is nice, it's fast, impecable and with long durable battery charge, I have used it 3 days in a row for approximately 3-4 hours before charging it up.The only issue I have is that o bought the 128 GB hard drive and I had to buy a portable external one of 2 tb because when I'm getting close to the maximun mac storage my computer gets slow and even frezzes up.But in general is the best computer I have ever had! I love every single detail, And definately consider myself an apple fan! I would only change it for one macbook air with more storage capacity.", "Date": "October 13, 2013"}, {"Title": "First Mac", "Author": "ACS", "ReviewID": "R1WHZ6WDOT1FOH", "Overall": "5.0", "Content": "This is my first Mac and it's great.  I only wish that it had more storage and that the card read was deep enough to keep the a SD card from sticking out almost half way out.  I like to keep my SD card plugged in.", "Date": "October 10, 2013"}, {"Title": "YES", "Author": "Bnunn08", "ReviewID": "R3PB9MDWQQ3N7F", "Overall": "5.0", "Content": "I LOVE MY COMPUTER!! I saved $50 ordering it from Amazon, even though it was brand new and still comes with all the perks that buying through Apple does. The computer is super fast, ultra responsive, and while I though that 128GB wouldn't be enough, the innovative flash storage proved me wrong. I love the size, I have a 13.3\" pro and it's MASSIVE compared to my air. It's just super convenient.", "Date": "October 5, 2013"}, {"Title": "Near Perfect!", "Author": "Sean Raidley", "ReviewID": "R1KGERC90Z9Z36", "Overall": "5.0", "Content": "I say \"near perfect\" in my header only because I wish it had a Retina display. However, everything else is amazing! Plus, the screen isn't bad either--it's just not Retina. The battery is incredible. It's better than my iPhone's battery by far. I got the 11\" 128GB version and it's seriously perfect. I'm not  pack rat so I have 100GB left still. I have some pics and some stuff for school on here. Also iWork and Xcode. At the store I thought the 11\" was noticeable smaller and would take getting used to. But once you get used to it the screen doesn't feel small at all. It feels perfect. Not too big, not too small. Apple is amazing.", "Date": "September 26, 2013"}, {"Title": "You can never go wrong with Apple", "Author": "Naif", "ReviewID": "RELNFODPY5IVY", "Overall": "5.0", "Content": "I'm not a big fan of Apple's Mac OS. However, I love the hardware Apple produces. That is why I decided to buy this laptop and install Windows 8 on it. It's perfectly compatible and fairly simple to instal.", "Date": "September 24, 2013"}, {"Title": "Solid notebook, could have better screen", "Author": "Alberto Pena", "ReviewID": "RR6OY8UGCBT0X", "Overall": "5.0", "Content": "We bought this MBA because we needed to replace my wife's windows computer.  This is a little bit of a Windows rant but I figure it might be useful for people looking into a new PC/Laptop.The main reasons are as follows:1) I need full disk encryption.  I want to protect personal data in case the computer falls into the wrong hands . I believe this is something every laptop should have, possibly every desktop.  Otherwise if I lose my laptop, anyone can get all my family pictures, bank statements etc.  To have this feature with the previous (relatively new) computer I needed Windows 7 Ultimate or Windows 7 Professional. W7-Pro does not have it.  I had Windows 7 Pro.  So I upgraded to W8 Pro via employer provided license.  What a huge mistake.  Windows 8 is the worst operating system I have seen in many years.  Even early Linux was friendlier.  Ugly design, confusing , settings all over the place, split personality, etc.  Then I thought, well , my wife is really used to Windows, so I considered getting a Windows 7 Ultimate license.  Then I found that in order to have full disk encryption you need TPM module in your computer, or you need to boot from USB drive every time.  Mine doesn't have it.  I considered Tru-Crypt, but I will not install a software that I have no idea who writes it and very few smart people in the world are able to build from source.2) I want easy back-ups.  Time machine is really hard to beat in ease of use.  Plug in a USB drive, you're done.For some people the two above reasons might not be relevant, but for me they are.Back to the MBA 11\".What I like:-Solid build.  Aluminum.-Magsafe power connector.  Very easy to plug , unplug. Compact. \"Looks\" safe.  Haven't tried pulling it, but the MBA will probably fly .-USB3, but you can get this on most new laptops.-Thunderbolt is there, even though I use it as mini display port.-Camera is pretty good for what I use it (Skype etc)-It's very light and easy to carry.-I love the size.  Compared to my Macbook Pro 13\", it's much lighter and easier to carry.  If we are going to do serious work we need a bigger screen anyway, so no need to carry a 13\" around (more on the screen below)-Battery life is excellent.-Runs pretty cool, so far.-Mac OS has a consistent user interface (on par with W7, but much better than W8)-Airport Mirroring.  Mirror almost anything to the AppleTV if you have one.-Full easy-to-use full disk encryption (FileVault 2)-Instant on as you open the lid.-Time machine painless backups (and encrypted as well).-Bundled software (iPhoto, iMovie etc)-Cheap upgrades (OS X)-Backlit keyboard-Very secure OS.  Don't even need an antivirus if you use common sense.-No bloatware. Default install is clean, no propaganda slowing down or confusing you.-You can choose the language.-Only one OS.  No Starter vs Pro vs Ultimate nonsense.What I don't like:- The screen is OK but I think Apple could fit a slightly larger screen in the same space.  The metal frame around the screen is pretty thick.- Not a fan of shiny screens, prefer matte.- Kind of expensive.  For this price it could have at least longer warranty.Overall a great notebook.  I would give it a 4 1/2 but I can't , so I give it a 5", "Date": "August 25, 2013"}, {"Title": "Excellent product. I'm really happy.", "Author": "Luis", "ReviewID": "R106SXMAE7HQ72", "Overall": "5.0", "Content": "A product of excellent quality. I'm really fascinated by my new MacBook Air.Packaging excellent and easy.I recommend it.", "Date": "August 2, 2013"}, {"Title": "Fast, sleek, and powerful!", "Author": "Justin Glisan", "ReviewID": "R1FFCQLSUZK85N", "Overall": "5.0", "Content": "I've been looking to upgrade my old MacBook Pro and when the new MacBook Air came out, I purchased it as soon as possible! It's a great investment; fast, sleek, and very powerful. Not only is Apple known for their great design process, but also the quality of the materials used. Even though the MacBook Air is extremely light and has a thin profile, you can feel the heft and quality of workmanship. I can't imagine going back to the MacBook Pro!", "Date": "August 2, 2013"}, {"Title": "Such a beautiful piece of technology", "Author": "Nicholas Leung", "ReviewID": "R1A1I7PTUV7OLJ", "Overall": "5.0", "Content": "This is coming from a previous 2008 Macbook pro user. This macbook air is a work of art. Flawless design. The battery life is so good that it scares me. I have been using it for more than 12 hours and i still have 1.5 hours to go! I used time machine to reinstall my data and it was a breeze. Fantastic technology. Very portable and great battery life!", "Date": "July 31, 2013"}, {"Title": "New Apple MacBook Air", "Author": "Judy Hundley", "ReviewID": "R384B2VTBN5RHM", "Overall": "5.0", "Content": "Worried about leaving my PC but the Apple MacBook Air exceeds my expectations.It is close to my I-Phone in use so easy to learn.", "Date": "July 30, 2013"}, {"Title": "Perfect!!", "Author": "Weidong Jiang CEJAJ", "ReviewID": "R3IMWBM8QRLGZ0", "Overall": "5.0", "Content": "The laptop runs very quickly, and it is never very hot. It looks really nice. It is light enough and thin enough. The screen looks really amazing. The buttery is awesome, too!!All in all, I love this laptop, I love Apple.", "Date": "July 26, 2013"}, {"Title": "Love it!", "Author": "New Mac User", "ReviewID": "R12RPN48XPM3Y2", "Overall": "5.0", "Content": "I am a completely non-techie former PC user and never thought I would want a Mac. I thought the new system would be too hard of an adjustment. I tried buying 2 laptops that ran Windows 8- now that is hard to get used to! Returned both of those, got the Mac, learning what I can by trial and error and Googling the rest. Love it! Easy to use, beautiful, light and responsive. Only thing is- I am not getting nearly 12 hours of regular use (not streaming) and at half dim screen. I found a way to reset the battery online; will have to try that out. If the battery issue gets resolved, this laptop will be perfect for me.", "Date": "July 24, 2013"}, {"Title": "Love it!", "Author": "Reem Kharbat", "ReviewID": "RMQ1WR7NX8A49", "Overall": "5.0", "Content": "Simply loving it.. i received it in one day :) How cool is that! This laptop is just great, light, fast, simply apple :)", "Date": "July 24, 2013"}, {"Title": "A great laptop", "Author": "Li Chen", "ReviewID": "RXA5JIDMWC2HJ", "Overall": "5.0", "Content": "This is my first apple computer. I am really impressed by its solid quality and the OSx. The battery life is also a good feature.", "Date": "July 14, 2013"}, {"Title": "Sold my Dell ultrabook with windows 8", "Author": "W. Hoover", "ReviewID": "R2R9CEX0MMUFH8", "Overall": "5.0", "Content": "The more I use my MacBook Air 11 inch computer the more I like it!  Super fast when surfing the Internet, the flash drive brings up applications quickly such as Lightroom 4.0, and much faster than my iMac.  It is so light and compact.  It is a joy to use.", "Date": "July 2, 2013"}, {"Title": "Awesome", "Author": "Vince Castillo", "ReviewID": "R2XJ2MFRPAEP3P", "Overall": "5.0", "Content": "Depending on your needs you might consider the pro, however for the price and my needs I choose the air.1st laptop I bought, couldn't be happier. Really easy to use, convenient, fast, Lightweight, sexy. Enjoy", "Date": "June 26, 2013"}, {"Title": "Returned it for something cheaper", "Author": "Amazon Customer", "ReviewID": "R280FVQ1JCN1ZA", "Overall": "2.0", "Content": "For the last couple of years I wanted the 11 inch macbook air. I just couldn't justify the price of just under $1000. I ended up buying one. It is light and fast. Built well and has a good screen. However when the screen would go to sleep, sometimes it wouldn't wake up and I would have to perform a hard re-start to use it again and nothing was saved when it came back. A few days later a friend came over with his Acer c720. It's also 11 inches. I noticed it's been the number one selling laptop on Amazon for a while now. I was extremely impressed with the 4 second startup time and the 9 hr battery life. It also wakes up after going into sleep mode. His laptop is easily as fast as the macbook air if not faster. But the deal breaker for me was that the acer is 1/5th the price of the macbook air. I ended up returning the mac and bought the acer and I've been thrilled. It can't do everything the mac can do but it does about 98% of what I was doing on the mac so for me it's perfect. I'm knocking 1 star for the sleep issue and 2 more for the inflated price. The macbook air is probably a good machine for some - just not for me for what I do and especially for the price.", "Date": "February 3, 2014"}, {"Title": "Not the newest version- mid 2012", "Author": "123456", "ReviewID": "R3T33EHPC2T6SO", "Overall": "1.0", "Content": "It says newest version but i got mid 2012 macbook air.. be sure to confirm the model before buying it. I am returning the laptop. You can get the latest model from apple store though its $ 50 bucks more..", "Date": "November 4, 2013"}, {"Title": "My first Mac.", "Author": "Briggs", "ReviewID": "R2RMUPKVK0TVDQ", "Overall": "3.0", "Content": "I wanted something very portable to use when my ipad air or iphone isn't enough. This is my first MacBook and I don't understand the hype honestly. I can understand the weak processor to save on battery and the low ram, I don't even fault it for the typical Apple overpricing of ssd space. The display however is un-excusable. This thing looks like blurry junk. They can put Retina in everything but the air? My wife was jealous of my new toy until I said you take it. She changed her mind real quick. I will keep it but I'll probably never use it. Mac OS is better than I expected though and I knew the res going in but I had no idea how much I would actually hate it. I'm an overpriced Apple fan through and through because their stuff works, I'm just very disappointed this time.", "Date": "December 31, 2013"}, {"Title": "Order directly from Apple...", "Author": "RPlanet \"Rich\"", "ReviewID": "R28VVD1WUXQNNY", "Overall": "2.0", "Content": "Very annoyed that I received this brand new machine and it had an old OS on it.  Should have ordered directly from Apple...", "Date": "December 16, 2013"}, {"Title": "Used for NetFlix and some light Gaming on the road.", "Author": "Keralis", "ReviewID": "R1AGOKE46YO3X7", "Overall": "5.0", "Content": "Hey, its Apple I can always expect something awesome from them! Lightweight, Intel HD5000 to back up BF4 at 30FPS and a powerfull i5 Processor none of that Windows pentium, i3 stuff. Super light and 5+ Hour battery life while watching a movie on netflix. Just enough of options to save power, the Apple logo, the keyboard, and the screen. Very slim and light for easy putting it in small places! Would recommend.", "Date": "April 26, 2014"}, {"Title": "Love it..", "Author": "A. Chandani", "ReviewID": "R2JKBLYKHM3D7U", "Overall": "4.0", "Content": "Love the new Macbook Air.. Its light as air and quite fast.. the flash memory does make a difference.. the battery life is amazing..", "Date": "August 24, 2013"}, {"Title": "Hardware defect - audio input/output device broke 3 times", "Author": "EG", "ReviewID": "RMNVRZ73CIEZ", "Overall": "1.0", "Content": "Same hardware defect happened for 3 new laptops - audio input/output device no longer detected.- After 30 days, the audio broke.  Apple shipped me a new one.- After 7 days, the audio broke.  Apple shipped me a second new one.- After 1 hour, the audio broke.  With Apple support now - probably returning this.Root cause: I believe it is a hardware design problem.  My speakers (Arctic S111) are powered via USB.  Seems the speaker drains the voltage causing the nearby audio card to break.  That's my running theory.I DON'T recommend buying this laptop - unless you like to waste your time with support and geniuses who spend 5 seconds to verify it is a defect.", "Date": "July 31, 2013"}, {"Title": "DEFECTIVE", "Author": "Sarah Westby", "ReviewID": "R179ELSO0D9W9H", "Overall": "1.0", "Content": "I purchased the Macbook Air 11.6\" in July of 2013 and was very excited about it.  I was converting from a PC and loved the machine, at first.  About 7 months after I purchased the laptop the charger stopped working.  I took it inot the ApplE store at Grand Central in NYC, and they informed me that there was extensive corrosive damage to the logic board.  There was no cause for this to happen, and this extent of damage is iexplicable.  Apple informed me that I would have to pay over $750 to fix the machine, despite being covered under warranty.  I am very displeased with this product and considering switching back to a PC.SarahNew York, NY", "Date": "April 11, 2014"}, {"Title": "Disappointed", "Author": "M. Bast", "ReviewID": "R3VH9TXD6K996J", "Overall": "2.0", "Content": "I had a Macbook Pro and when I needed a new laptop, decided to switch to the Air. At first I loved it. It is a lot lighter and easier to store. But then reality struck. It is a wireless only laptop (meaning if wifi is down, you can't hook it up). It has no CD drive. I didn't think this would bother me because I don't use CD's BUT a lot of technology comes with CD's to install on your computer. It over heats A LOT quicker and A LOT hotter than the Pro. I am regretting not getting another Macbook Pro.", "Date": "April 23, 2014"}, {"Title": "I like the new MBA but…..", "Author": "Mickey", "ReviewID": "R3EUHAKLLGRX8C", "Overall": "3.0", "Content": "This is my second MBA, the first one I bought was in late 2010, but I still have one problem or expectation that this laptop haven't met yet, battery power, I couldn't get the promised 12 hours battery time, do I need to return it back, or should I consult Apple forums or do I have to do some kind of calibration ?please help :)", "Date": "December 17, 2013"}, {"Title": "Love this MacBook Air", "Author": "Gregory Y. Mishima \"Greg M\"", "ReviewID": "R2Z6DMIGMNXN7Y", "Overall": "5.0", "Content": "I took a chance and got this for my wife, she love's it! She said it has a long battery life.", "Date": "December 9, 2013"}, {"Title": "it's worth every 1$", "Author": "yousef", "ReviewID": "R1TJP5VCD0EFN6", "Overall": "5.0", "Content": "This laptop is a beast it's worth every 1$ i paid on , every 6 month to 9 months i by the newer vision and it's always surprising me with the factions ,,,,,,", "Date": "December 4, 2013"}, {"Title": "So happy!", "Author": "Oceans1419", "ReviewID": "R1ZF7PDTVLPBZL", "Overall": "5.0", "Content": "Had an old MacBook Air and after about 8 years, wine spillage and it being dropped multiple times, it gave out on me.  Bought this new 11in version and I am stoked.  Love the size and all new features.  You can't beat a MAC!", "Date": "August 13, 2013"}, {"Title": "It's great", "Author": "Xuan Qiu", "ReviewID": "RTVG0R9JJXC6O", "Overall": "5.0", "Content": "I love this Macbook Air MD760LL/A 13.3-inch laptop. It has excellent operation system. Moreover, the battery in this laptop is able to keep this laptop working for nearly twelve hours.", "Date": "August 10, 2013"}, {"Title": "envy since I use a pc", "Author": "William B. Lawsonj", "ReviewID": "R12CIIE7B36A66", "Overall": "5.0", "Content": "My wife loves it and she is a technophobe i started with apple products then shifted to PC;s because of my work.", "Date": "August 5, 2013"}, {"Title": "Not actually the newest version.", "Author": "Adrian Alejos", "ReviewID": "R2H04GSZ5TBP5H", "Overall": "1.0", "Content": "Wasn't the Newest version. Not sure if this was amazons fault or the company who actually had the product. Should be fixed for future buyers.", "Date": "January 2, 2014"}, {"Title": "Terrible design - ergonomically inefficient and power adaptor does not stay plugged in", "Author": "Parwana Ashari", "ReviewID": "REUPT66DEECUX", "Overall": "1.0", "Content": "The computer randomly turns itself off when I'm in the middle of doing something. This may happen 2-3 times in a row, and each time it takes at least 30-45 seconds for the computer to turn back on. I just get a black screen with a mouse cursor button and unable to get any response by pressing any buttons, including the power button. Just have to sit there and wait for the computer to come back from the ether...Second issue is the keyboard - although the thinness is pretty incredible and great for portability, this is the LEAST ergonomically designed computer I've ever used! After less than a minute of typing on this super flat keyboard, my wrists are KILLING me and I'm young! It physically hurts to keep my hands on the keyboard - the chassis is far too thin - the distance between the edge of the computer to the start of the keyboard is literally 1.5x longer than any other laptop - so almost half my forearm rests on the computer in order to type. I should only have to put my wrists and hands on the computer to type. I end up using my horrible, clunky Lenovo work computer to do any serious typing or even gchatting with friends because it's just not worth it physically to me to do anything but browse the net or watch videos on this thing. The pain is too much.Finally, the newly designed power adaptor SUCKS. You so much as look at the thing, and it falls out. You cannot use the laptop in your lap while it's plugged in because the power cord falls out of the side of the thing. It's seriously the worst design I've ever seen. I guess Apple doesn't think you should use laptops in your lap unless they're fully charged. The only redeeming quality is the batter life is long enough where I can afford to use it unplugged in my lap for a few hours. Even when it's sitting on my desk, if i move the laptop even slightly, the power cord falls out.", "Date": "November 9, 2013"}, {"Title": "good, but", "Author": "Gabriela Teixeira de Lucena", "ReviewID": "R3DST55HQ9TYYY", "Overall": "3.0", "Content": "i didn't learn very well how to deal with macs, but i am missing the windows system.. macs are complicated in my opinion", "Date": "April 25, 2014"}, {"Title": "Very Disappointed", "Author": "d. piazza", "ReviewID": "R2PYQ617R28DKM", "Overall": "2.0", "Content": "Apps keep closing and giving me the message \"blah blah closed unexpectedly, report to Apple\"  I expect crap like that from windows which is why I bought the MacBook.  Everyone says how great they are. Well so far Bull S***.  Nine hours battery life my  -ss! I barely get between 3 and 4.  So far it has not lived up to anything I was told.  Will not make the mistake of buying another Apple anything.", "Date": "October 4, 2013"}, {"Title": "Battery", "Author": "Joseph L. Chestnut", "ReviewID": "R3QI10CP93AO9G", "Overall": "3.0", "Content": "Battery loses power even when computer is turned off.  Out of the box the battery was completely dead. Is this normal?", "Date": "March 13, 2014"}, {"Title": "Dream comes  true", "Author": "Mary Keohane", "ReviewID": "R1HCK9NJHER7OL", "Overall": "5.0", "Content": "When she saw  the box it made her happy, when she opened the box it made her very happy ,when she saw the computer  it made overjoyed,  when she put it on her desk  and opened it  up, it made her ecstatic  happy and over-joyed  when  it came on \\ she was speechless, for the first in long long time ...She  was very happily  using it  until 3am .  But  at 5'30 am when she had to get up she as not happy nor over-joyed or even slightly ecstatic in fact she was miserable  but she still loves the computerWe as family are very pleased with  this computer .", "Date": "March 1, 2014"}, {"Title": "great new air", "Author": "jessie", "ReviewID": "R3NH391YSFX98E", "Overall": "5.0", "Content": "first i bought the old version. and then the new air just came out. so i returned the old one and bought the new one with cheaper price.", "Date": "August 22, 2013"}, {"Title": "New to Mac", "Author": "avch-bayarea", "ReviewID": "R1BWDKGPYI3X77", "Overall": "4.0", "Content": "It's just nice. I like the the all the features weight etc.. I'm new to mac so still learning. I would give it a five star if it comes with retina display..", "Date": "August 9, 2013"}, {"Title": "Y r u reading this? Go get a MacBook Air 13 NOW", "Author": "Matthew A.", "ReviewID": "R1QWSR2RB8ZH6Q", "Overall": "5.0", "Content": "It's the only rating I can honestly give! 5stars need I say more? Stop reading this & go get urs NOW!!!", "Date": "January 4, 2014"}, {"Title": "2013 MacBook Air 11 inch", "Author": "asul", "ReviewID": "R3ORBQ97LJ7QET", "Overall": "5.0", "Content": "Here's my review of the MacBook Air 11 inch 2013. This is way better than iPad Air. You really do get your money's worth![...]", "Date": "December 13, 2013"}, {"Title": "Apple macbook air", "Author": "R.L. Fuller", "ReviewID": "RR2ZFAM4ROVD4", "Overall": "3.0", "Content": "I ordered this computer for my wife to replace an old computer she has been using to read and send her e mails.She found the print to be too small to read comfortably and the measures necessary to enlarge quite inconvenient.We have returned the computer with the intention to order another from Amazon which will be easier for her to change fontsto a larger version.", "Date": "August 16, 2013"}, {"Title": "Apple's famed customer service, like their innovation, is a thing of the past.", "Author": "Kevin C.", "ReviewID": "R118NITQR16UM3", "Overall": "2.0", "Content": "The air book is a light weight fast and efficient computer.  It is very expensive and has not drastically changed in the past few years.  However,  all our other home computers are Apple.  Thus, in looking for a new one we felt this was the way to go.  Our initial reason for buying an Apple over a PC was the dreadful experiences we had with on line support for our PCs as opposed to the pleasant service we got dealing with a damaged iPod that belonged to our daughter.  The prices are the same on line or at the Apple store so we chose to purchase at the Apple store.  We have heard friends in the past few years complain that the Apple service had gone downhill, but had not experienced it.  Thus, for these reasons we decided to purchase the product.  This product Was supposed to come with a gift card, which the cashier was supposed to activate.  The only way that we found this out was when we went online to use it.  After speaking with both online support and the store, there was no dispute that the card was supposed to be activated.  Apple's high-tech solution: take the time from your day to travel to the store to have them do what they should have done in the first place.  This is hardly the old type of apple service.  Rather, it reflects a company that continues to live on its past reputation.  Thus, when considering a lightweight computer in the future, I'm going to consider products from Samsung and others that are trying to accomplish what apple is squandering.  I would suggest others do so also.", "Date": "September 15, 2013"}, {"Title": "turky leg", "Author": "Eddie ferger", "ReviewID": "R38ZUT7BKM3LM8", "Overall": "5.0", "Content": "i love all the gravy it gave me on cold nights with no heat for me to hit  in my arm pit", "Date": "August 11, 2013"}, {"Title": "WARNING - READ THIS BEFORE YOU BUY APPLE", "Author": "Frank Erfurth", "ReviewID": "R20GKR4BNP6D4J", "Overall": "2.0", "Content": "If you are purchasing an Apple computer for ease of use and a super user-friendly GUI, go ahead and push \"BUY IT NOW\".  But if you are migrating over to Apple to take advantage of the apparent bargains to be found in the professional software arena (Music Production, Video Production, Graphic Arts, etc.) I am issuing a warning that Apple is lying to you.  Apple has implemented an aberrant pricing policy that varies widely from the industry standard pricing policy for professional software.  Apple, in true corporate fashion, has made this change without warning or notice.  The new policy is NO PATH TO UPGRADE.  You heard me right.  If you pay professional software prices for a piece of Apple software, and two months later they release the new and improved package, you will be stuck paying full price for the upgrade.  Do you feel like you got a deal now?  You have now paid more for your software than if you had gone with the industry leading software package (PreSONUS, Adobe Premiere, CorelDraw, etc.) and next update, you will be well behind the pricing curve.  I do not have a problem with Apple software, but rather the sneaky way in which they implemented the pricing policy.  If you are buying Apple to take advantage of these apparent deals...save your money and stick with a PC.  You will pay more initially for your software, but within a year you will be saving money.", "Date": "September 5, 2013"}, {"Title": "Device is perfect but hard to resell.", "Author": "Alexander", "ReviewID": "R3TZKIWYSA1EFH", "Overall": "2.0", "Content": "Purchased the device for reselling. Bad idea! The design and the device itself are obsolete. I should have purchased new MBP Retinas.", "Date": "January 10, 2014"}, {"Title": "Useless over priced junk.", "Author": "Starbuck88", "ReviewID": "R2DDQ9HGKGUBLY", "Overall": "1.0", "Content": "Save your money, buy a better quality operating system from another brand, and get an OS that actually does something, unlike mac os, that is just good for itunes.", "Date": "December 17, 2013"}, {"Title": "Save yourself the $$ and buy a chromebook!!", "Author": "CameraGuy", "ReviewID": "R31E6GIUOIXAG6", "Overall": "2.0", "Content": "Don't waste your $$ on this macbook! I ended up sending mine back and getting the Acer chromebook!The chromebook is great for school, watching videos, playing games and surfing the web, what else do you need?", "Date": "January 31, 2014"}, {"Title": "refund", "Author": "david friedman", "ReviewID": "R2QQED8ZOL99LH", "Overall": "1.0", "Content": "Did not like this computer to all.  That's why I sent it back for a refund.  Was very much a disappointment for that kind of money!", "Date": "February 1, 2014"}, {"Title": "Underpowered DEFINITELY", "Author": "Skacoolio", "ReviewID": "RB9CN9V6P0139", "Overall": "2.0", "Content": "I have owned this MacBook Air since the day it had came out and to my surprise....it was just not powerful enough! Simple tasks such as copying files to the SSD would take 15 minutes on a 10gb file. That is clearly unacceptable. It does have great battery life though and an okay screen. It looks elegant and sleek. I just wish it would push my files and around faster. I think I am going to just stick with my Samsung Series 9 15 inch ultrabook because that is VERY fast compared to this. The Samsung with a 1.9ghz i7 compared to Apple's 1.7ghz i7 for some reason is so much faster. I would not really recommend this unless you are an extremely basic user. Well back to Apple it goes =/", "Date": "June 17, 2013"}, {"Title": "Purchased as a gift.", "Author": "Joe P", "ReviewID": "R25UCN58UDAYM3", "Overall": "3.0", "Content": "Purchased as a gift to be given at Christmas. Will provide more details after the holidays. I am very optimistic.", "Date": "November 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00746YPQI"}}